const p="ahastack",n="faq-scale",t="هل يتوسّع؟",a="index",c="هل يتوسّع؟",e=[],s=`<p>هل يهمّ ذلك؟</p>
<p>هل تحتاج فعلًا إلى التوسّع، أم أننا نتكلّم في صور مجرّدة فقط؟</p>
<p>أي مقدار من التوسّع نقصد؟ وأيّ توسّع بالضبط: توسّع تعقيد التطبيق، أم توسّع قاعدة المستخدمين؟</p>
<p>هل يمكنك بناء Facebook بهذا؟</p>
<p>هممم... لا أعرف. بل قد أقول لك <em>ربما</em>. ليس الأمر سوى مجموعة من النماذج. انشر هذا، وردّ على ذاك.</p>
<p>جرّبه على تطبيق للاستخدام الداخلي، أو شيء يتعامل مع قاعدة بيانات داخلية، أو ببساطة شيء شخصي.</p>
<p>قارن تجربة المطوّر DX (كيف تحبّ استخدام هذه الحزمة) وتجربة المستخدم UX الناتجة (ما جودة الواجهة التي تستطيع صنعها بهذه الحزمة)، وشاهد بنفسك.</p>
<p>التوسّع التقني مسألة تخصّ الواجهة الخلفية. وتتوسّع هذه الحزمة بقدر ما تستطيعه واجهتك الخلفية من توسّع.</p>
<p>هل يمكن لهذا أن يتوسّع إلى فريق أكبر؟ أو إلى مشروع أكبر؟ أو إلى قاعدة مستخدمين أكبر بكثير؟</p>
<p>ربما.</p>
<p>يعتمد الأمر.</p>
`,o={book:p,chapter:n,chapterTitle:t,slug:a,title:c,headings:e,html:s};export{p as book,n as chapter,t as chapterTitle,o as default,e as headings,s as html,a as slug,c as title};
