const n="mooc",i="auxiliary",o="صفحات مساعدة",l="exam_intro",s="اختبار مقدمة في البرمجة 05.09.",t=[],c=`<!--# مقدمة في البرمجة-->
<ul>
<li>ستتاح أسئلة الاختبار، في صورة تعليمات مهام برمجة، على courses.mooc.fi في الساعة 10:00 صباحًا (UTC+3) يوم الاختبار.</li>
<li>يمكن العثور على روابط أسئلة الاختبار من هذه الصفحة في قسم <a href="#exam-questions-and-starting-the-exam">أسئلة الاختبار وبدء الاختبار</a></li>
</ul>
<h4>أداء اختبار البرمجة</h4>
<ul>
<li>لا تحتاج إلى التسجيل في الاختبار.</li>
<li>أداء اختبار البرمجة شرط إلزامي لإكمال الدورة.</li>
</ul>
<h4>ترتيبات الاختبار</h4>
<ul>
<li>ستُقدَّم حلولك لمهام البرمجة في الاختبار في بيئة برمجة Visual Studio Code، بالطريقة نفسها التي تقدّم بها تمارين الأسبوع في الدورة.</li>
<li>يمكن أداء اختبار الدورة في 5 سبتمبر 2026 <strong>بين الساعة 10:00 (UTC+3) صباحًا والساعة 10:00 مساءً (UTC+3)</strong>.</li>
<li>ينتهي الاختبار في الساعة 10:00 مساءً (UTC+3) على أبعد تقدير. إذا أردت أن تتمكن من قضاء أقصى وقت مسموح في الاختبار، فيجب أن <strong>تبدأ في الساعة 6:00 مساءً (UTC+3) على أبعد تقدير</strong>.</li>
<li>سيكون لديك <strong>أربع ساعات</strong> لإكمال الاختبار. إذا مُنحت وقتًا إضافيًا بموجب ترتيبات خاصة، فسيكون لديك خمس ساعات لإكمال الاختبار، ويجب أن تبدأ في الساعة 5:00 مساءً (UTC+3) على أبعد تقدير.</li>
</ul>
<h4>قبل تاريخ الاختبار</h4>
<ul>
<li>اقرأ هذه التعليمات بعناية</li>
<li>اجلب قوالب مهام البرمجة، وجرّب تقديم التمارين <a href="#fetching-the-programming-task-templates">باتّباع التعليمات أدناه</a></li>
<li>إذا واجهت مشكلات في جلب القوالب أو في تقديم التمارين، أو كانت لديك مشكلات تقنية أخرى أو أسئلة حول ترتيبات الاختبار، فيمكنك طلب المساعدة في <a href="https://study.cs.helsinki.fi/discord/join/ohjelmoinnin_mooc">Discord</a> الخاص بالدورة.</li>
</ul>
<h4>في تاريخ الاختبار</h4>
<ul>
<li>في حالة المشكلات التقنية، سيكون مدرّس الدورة متاحًا للانتظار <strong>من الساعة 10:00 صباحًا (UTC+3) إلى الساعة 2:00 مساءً (UTC+3)</strong> على <a href="https://study.cs.helsinki.fi/discord/join/ohjelmoinnin_mooc">Discord</a> في القناة <code>ohjelmoinnin_mooc_english</code>.</li>
<li>في تاريخ الاختبار <strong>من الساعة 2:00 مساءً (UTC+3) إلى الساعة 10:00 مساءً (UTC+3)</strong> يُحظر النقاش في قنوات دعم الدورة. فقناة Discord الخاصة بالدورة مقفلة، ولا يمكن إرسال الرسائل إلى القنوات.</li>
</ul>
<h4>جلب قوالب مهام البرمجة <span class="content-anchor" id="fetching-the-programming-task-templates"></span></h4>
<p><strong>ستتمكن من جلب قوالب مهام البرمجة واختبارها في اليوم السابق للاختبار أصلًا.</strong></p>
<ol>
<li>شغّل Visual Studio Code.</li>
<li>اختر عرض <code>My courses</code> في قائمة TMC.</li>
<li>اضغط على زر <code>Add new course</code>.</li>
<li>اختر المؤسسة <code>Helsingin yliopisto</code>.</li>
<li>اختر الدورة <code>Introduction to Programming, autumn 2026, Online Exam 1</code>.</li>
<li>اجلب قوالب مهام البرمجة.</li>
<li>جرّب تقديم مهام البرمجة.</li>
<li>إذا كنت قادرًا على تقديم المهام، فأنت جاهز لأداء الاختبار. وإلا، فتواصل مع مدرّسي الدورة. لا تفزع، فسنجد حلًا.</li>
</ol>
<h4>أسئلة الاختبار وبدء الاختبار <span class="content-anchor" id="exam-questions-and-starting-the-exam"></span></h4>
<blockquote>
<p><strong>ملاحظة:</strong> يُرجى عدم طرح أي أسئلة حول مهام البرمجة المحددة المكلّفك بها على قنوات دعم الدورة العامة أثناء استمرار فترة الاختبار. أي أنه لا يمكنك طرح أسئلة خاصة بمهمة معينة من الاختبار إلا بعد الساعة 10 مساءً يوم الاختبار. أكمل مهام البرمجة إلى أفضل فهمك، ويُرجى الإشارة في ملاحظاتك على الدورة إذا كانت التعليمات مربكة.</p>
</blockquote>
<ul>
<li>ستتاح أسئلة الاختبار، في صورة تعليمات مهام برمجة، على courses.mooc.fi في الساعة 10:00 صباحًا يوم الاختبار.</li>
<li>يجب أن تستخدم بيانات تسجيل الدخول المعتادة إلى mooc.fi لتسجيل الدخول في صفحة الاختبار.</li>
<li>يمكن العثور على أسئلة الاختبار من هنا: <a href="https://courses.mooc.fi/org/uh-cs/exams/f458d30e-adc4-4e9f-9a7c-bb375dd66b21">https://courses.mooc.fi/org/uh-cs/exams/f458d30e-adc4-4e9f-9a7c-bb375dd66b21</a></li>
<li>إذا مُنحت وقتًا إضافيًا بموجب ترتيبات خاصة، فافتح أسئلة الاختبار من هذا الرابط: <a href="https://courses.mooc.fi/org/uh-cs/exams/d009e9e4-fe37-46cc-9904-c4c4db75acc9">https://courses.mooc.fi/org/uh-cs/exams/d009e9e4-fe37-46cc-9904-c4c4db75acc9</a></li>
<li>سيبدأ وقت الاختبار المخصّص لك عندما تضغط على الزر <code>START THE EXAM!</code>.</li>
</ul>
<h4>تقديم حلولك</h4>
<ul>
<li>تُقدَّم حلولك لمهام البرمجة في الاختبار بالطريقة نفسها التي تقدّم بها حلولك لتمارين البرمجة في الدورة.</li>
<li>مهام البرمجة في الاختبار <strong>لن تحتوي على اختبارات آلية</strong>.</li>
<li>ستؤدي أي محاولة لتقديم المهام بعد انتهاء وقت الاختبار المخصّص لك إلى رسوب تلقائي.</li>
</ul>
<h4>إنهاء الاختبار</h4>
<ul>
<li>يُرجى التأكد من تقديمك جميع مهام البرمجة قبل إنهاء الاختبار.</li>
<li>يمكنك التحقق من وصول التمارين التي قدّمتها إلى الخادم عن طريق <strong>تسجيل الدخول</strong> إلى الصفحة <a href="https://tmc.mooc.fi/org/hy/courses/1723">https://tmc.mooc.fi/org/hy/courses/1723</a>. تكون مهمة البرمجة قد وصلت إلى الخادم إذا استطعت رؤية اسم قالب المهمة والوقت الذي قدّمت فيه المهمة.</li>
<li>عند الانتهاء، يمكنك إغلاق جميع تبويبات ونوافذ Visual Studio Code، مع صفحة أسئلة الاختبار. ولا حاجة لفعل أي شيء آخر.</li>
</ul>
<h4>نتائج الاختبار</h4>
<ul>
<li>ستُرسل نتائج الاختبار إليك بالبريد الإلكتروني بعد أن يُقيّم الدورة بالكامل. وسيكتمل تقييم الاختبار في غضون 4 أسابيع من تاريخ الاختبار.</li>
<li>سيحتوي البريد الإلكتروني أيضًا على تعليمات تسجيل وحداتك الدراسية للدورة.</li>
<li>تُسجَّل الوحدات الدراسية بالتسجيل في الدورة في الجامعة المفتوحة.</li>
</ul>
<h4>معلومات أخرى</h4>
<ul>
<li><strong>لا</strong> يُسمح لك بالتعاون مع طلاب آخرين أو بنسخ حلول جاهزة من أي مكان أثناء الاختبار. ومع ذلك، <strong>فهذا اختبار كتاب مفتوح، لذا فالمصادر المعتادة مثل مادة الدورة وأداة العرض المرئي Python Tutor وGoogle مسموحة</strong>.</li>
<li><strong>لا</strong> يُسمح لك باستخدام نماذج اللغة الكبيرة، مثل ChatGPT أو ما يشابهها، أثناء الاختبار.</li>
<li>ستُفحص تقديماتك لمهام البرمجة بوساطة كاشف الانتحال. وأي غش يُكتشف يؤدي إلى رسوب في الاختبار على أقل تقدير، لكنه قد يؤدي أيضًا إلى الفصل من الدورة.</li>
<li>ستكون مهام البرمجة في الاختبار مشابهة لمهام البرمجة في مادة الدورة. وأفضل طريقة للاستعداد للاختبار هي مراجعة مادة الدورة.</li>
<li>ستُرسل نتائج دورتك إليك بالبريد الإلكتروني بعد الاختبار، مع تعليمات تسجيل وحداتك الدراسية للدورة.</li>
</ul>
`,e={book:n,chapter:i,chapterTitle:o,slug:l,title:s,headings:t,html:c};export{n as book,i as chapter,o as chapterTitle,e as default,t as headings,c as html,l as slug,s as title};
