const n="crafting-interpreters",e="a-bytecode-virtual-machine",t="آلة افتراضية للبايت-كود",a="index",c="آلة افتراضية لشيفرة البايت",o=[],r=`<p>علّمنا مفسّرنا المكتوب بلغة Java، وهو jlox، كثيرًا من أساسيات لغات البرمجة، لكنّ ما
زلنا لدينا الكثير مما نتعلّمه. أولًا، إن شغّلت أيّ برامج Lox مثيرة للاهتمام في jlox،
فإنّك ستكتشف أنّها بطيئة لدرجة موجعة. أسلوب التفسير الذي يستخدمه -- التجوّل على شجرة
التحليل المجرّد مباشرةً (tree-walk) -- جيّد بما يكفي لبعض الاستخدامات في العالم
الحقيقي، لكنّه يترك الكثير مما يُرام على حاله للغة برمجة نصّية عامّة الغرض.</p>
<p>كما أنّنا نعتمد ضمنيًا على مزايا وقت التشغيل في JVM نفسها. فنحن نأخذ أمرًا مثل
<code>instanceof</code> في Java على أنّه يعمل <em>بطريقة ما</em>. ولا نقلق ولو للحظة واحدة بشأن إدارة
الذاكرة لأنّ جامع نفايات (garbage collector) في JVM يتولّى ذلك نيابةً عنا.</p>
<p>حين كان تركيزنا على المفاهيم عالية المستوى، كان من المقبول أن نمرّ على تلك الأمور دون
تعمّق. لكن الآن بعد أن صرنا نعرف طريقنا حول المفسّر، حان وقت أن نهبط إلى تلك الطبقات
الأدنى ونبني آلتنا الافتراضية (virtual machine) الخاصة من الصفر باستخدام مكتبة C
القياسية فحسب...</p>
`,i={book:n,chapter:e,chapterTitle:t,slug:a,title:c,headings:o,html:r};export{n as book,e as chapter,t as chapterTitle,i as default,o as headings,r as html,a as slug,c as title};
