const i="mooc",n="auxiliary",l="صفحات مساعدة",o="frontmatter-guide",a="دليل بيانات الترويسة الأمامية",e=[{depth:3,id:"جميع-حقول-بيانات-الترويسة-الأمامية-الممكنة",text:"جميع حقول بيانات الترويسة الأمامية الممكنة:"}],t=`<h3 id="جميع-حقول-بيانات-الترويسة-الأمامية-الممكنة">جميع حقول بيانات الترويسة الأمامية الممكنة:</h3>
<p>banner</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع منطقي (boolean)</li>
<li>يضيف صورة banner.svg الموجودة في جذر المشروع إلى أعلى الصفحة.</li>
<li>انتبه! لا تُضاف صورة الغلاف إلا إذا كانت information_page تساوي true</li>
</ul>
<p>hidden</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع منطقي (boolean)</li>
<li>لا تظهر الصفحة في الشريط الجانبي (انتبه! يُفضَّل استخدام الحقل hide_in_sidebar إذا أردت إخفاء الصفحة من الشريط الجانبي فقط)</li>
<li>يُطلق خطأ 404 إذا حاول أحد الذهاب إلى عنوان url الخاص بالصفحة</li>
</ul>
<p>hide_in_sidebar</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع منطقي (boolean)</li>
<li>يخفي الصفحة من الشريط الجانبي لو كانت ستظهر فيه بغير ذلك. ويظهر في الشريط الجانبي افتراضيًا جميع الملفات المسمّاة index.md، وكذلك جميع ملفات markdown الموجودة في جذر مجلد data.</li>
</ul>
<p>information_page</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع منطقي (boolean)</li>
<li>من أجل الشريط الجانبي. والملفات التي تكون فيها information_page تساوي true تظهر أولًا في الشريط الجانبي</li>
</ul>
<p>overview</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع منطقي (boolean)</li>
<li>مُخصّص لصفحات فهرس أجزاء الدورة (مثل osa-01/index.md). يُخفي قائمة الصفحات الفرعية للجزء الموجودة أسفل الصفحات. انتبه! هذه الصفحات مخفية أيضًا في صفحات information_page، أي لا حاجة إلى ضبط هذا الحقل على false بشكل منفصل في صفحات information_page</li>
</ul>
<p>path</p>
<ul>
<li>مطلوب</li>
<li>من نوع سلسلة نصية (string)</li>
<li>المسار إلى الملف في عنوان url، بصيغة baseurl/path</li>
</ul>
<p>separator_after</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع سلسلة نصية (string)</li>
<li>يضيف فاصلًا إلى الشريط الجانبي بعد رابط الصفحة.</li>
<li>إذا ضُبط على نص فارغ (separator_after: &quot;&quot;)، فيكون فاصلًا مجردًا بلا عنوان. وإذا لم يكن فارغًا، فيظهر النص المضبوط عنوانًا فوق الفاصل.</li>
</ul>
<p>sidebar_priority</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع عدد صحيح (integer)</li>
<li>مُخصّص لصفحات information_page فقط</li>
<li>يتيح هذا الحقل إعادة ترتيب روابط صفحات information_page في الشريط الجانبي. ويظهر في الشريط الجانبي افتراضيًا صفحات information_page أولًا، ثم بقية الصفحات. وتُرتَّب صفحات information_page وسائر الصفحات ترتيبًا أبجديًا.</li>
<li>تسبق الصفحات التي تحمل الحقل sidebar_priority بقية الصفحات، وتُرتَّب تنازليًا من الأكبر إلى الأصغر (<code>sidebar_priority: 5000</code> تسبق <code>sidebar_priority: 2000</code>)</li>
</ul>
<p>title</p>
<ul>
<li>مطلوب</li>
<li>من نوع سلسلة نصية (string)</li>
<li>عنوان الصفحة في أعلى المتصفّح، وفي تبويب المتصفّح، وكذلك في أعلى الملف نفسه</li>
</ul>
<p>upcoming</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع سلسلة نصية (string)</li>
<li>إذا كان مضبوطًا، فإن رابط الصفحة في الشريط الجانبي يظهر رماديًا وغير قابل للنقر، ويظهر بجانبه النص المضبوط.</li>
<li>نوصي بأن يُضبط النص على تاريخ نشر الصفحة بالصيغة &quot;يوم.شهر&quot;، لأن الحقل صغير بما يكفي بحيث لا يتّسع له رقم السنة بالكامل.</li>
</ul>
<p>vocabulary_page</p>
<ul>
<li>غير مطلوب</li>
<li>من نوع منطقي (boolean)</li>
<li>مُخصّص حصريًا لصفحة المفردات. وإذا ضُبط هذا الحقل، تتوفّر في الصفحة إمكانية الوصول إلى بيانات مفردات المعجم.</li>
</ul>
`,r={book:i,chapter:n,chapterTitle:l,slug:o,title:a,headings:e,html:t};export{i as book,n as chapter,l as chapterTitle,r as default,e as headings,t as html,o as slug,a as title};
