const t="nand2tetris-2",n="project08",i="المشروع 8: الآلة الافتراضية II: التحكم في البرنامج",a="index",e="المشروع 8: الآلة الافتراضية II: التحكم في البرنامج",d=[{depth:2,id:"المشروع-8-الآلة-الافتراضية-ii-التحكم-في-البرنامج",text:"المشروع 8: الآلة الافتراضية II - التحكم في البرنامج"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"الهدف",text:"الهدف"},{depth:3,id:"العقد",text:"العقد"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"الاختبار",text:"الاختبار"},{depth:3,id:"التنفيذ-المقترح",text:"التنفيذ المقترح"},{depth:3,id:"الأدوات",text:"الأدوات"}],s=`<h2 id="المشروع-8-الآلة-الافتراضية-ii-التحكم-في-البرنامج">المشروع 8: الآلة الافتراضية II - التحكم في البرنامج</h2>
<h3 id="خلفية">خلفية</h3>
<p>نواصل بناء مُترجِم VM - وهو برنامج يترجم البرامج المكتوبة بلغة VM إلى برامج مكتوبة بلغة آلة Hack. وهذه قطعة هندسية محترمة، لذا نؤدّيها على مرحلتَين. مرحبًا بك في المرحلة الثانية.</p>
<h3 id="الهدف">الهدف</h3>
<p>وسّع المترجم الأساسي المبني في المشروع 7 ليصبح مترجم VM متكاملًا. فعلى وجه الخصوص، في المشروع 7 ركّزنا على التعامل مع أوامر الحساب على المكدس والوصول إلى الذاكرة في لغة VM. وننتقل الآن إلى التعامل مع أوامر التفريع واستدعاء الدوال في لغة VM.</p>
<h3 id="العقد">العقد</h3>
<p>اكتب مترجمًا متكاملًا من VM إلى Hack، موسّعًا للمترجم الأساسي المطوَّر في المشروع 7، ومطابقًا لمواصفة VM الجزء الثاني (قسم 8.2 من الكتاب) ولتعيين VM القياسي على Hack الجزء الثاني (قسم 8.3.1 من الكتاب). واستخدم مترجمك لترجمة برامج VM المرفقة أدناه، منتِجًا برامج مقابلة مكتوبة بلغة التجميع Hack. وعند تشغيلها على محاكي CPU المرفق، يجب أن تُنتِج الشيفرة المترجمة التي يولّدها مترجمك النتائج المطلوبة في سكربتات الاختبار وملفات المقارنة المرفقة أدناه.</p>
<p>لاحِظ أن برنامج الآلة الافتراضية قد يمتد إمّا على ملف .vm واحد أو على مجلد يحتوي على ملف .vm واحد أو أكثر. وفي الحالة الأولى، يُستدعى المترجم بالأمر VMTranslator fileName.vm. ويُنشئ المترجم ملف إخراج باسم fileName.asm، يُخزَّن في نفس مجلد الملف المدخل. وفي الحالة الثانية، يُستدعى المترجم بالأمر VMTranslator dirName. ويُنشئ المترجم ملف إخراج وحيدًا باسم dirName.asm، يُخزَّن في المجلد نفسه. ويحتوي هذا الملف الواحد على شيفرة التجميع الناتجة عن ترجمة كل ملفات .vm في المجلد المدخل. وقد يحتوي اسم الملف أو المجلد المدخل على مسار. فإن لم يُحدَّد مسار، يعمل المترجم على المجلد الحالي افتراضيًّا.</p>
<h3 id="الموارد">الموارد</h3>
<p>القراءة ذات الصلة بهذا المشروع هي الفصل 8. وستحتاج إلى أداتَين: لغة البرمجة التي ستُنفِّذ بها مترجم VM، ومحاكي CPU المرفق. ويتيح هذا المحاكي تنفيذ واختبار شيفرة الآلة التي يولّدها مترجم VM على حاسوبك. وأداة أخرى تأتي في متناول اليد في هذا المشروع هي محاكي VM المرفق. ويتيح محاكي VM (الموصوف أسفل هذه الصفحة) التجريب مع برامج VM المرفقة قبل الشروع في كتابة مترجمك.</p>
<h3 id="الاختبار">الاختبار</h3>
<p>نوصي بإكمال تنفيذ مترجم VM على مرحلتَين. أولًا، نَفِّذ واختَر ترجمة أوامر التفريع في لغة VM. ثم نَفِّذ واختَر ترجمة أوامر استدعاء الدوال والإرجاع. وسيتيح لك ذلك اختبار تنفيذك تدريجيًّا، باستخدام برامج الاختبار المرفقة أدناه.</p>
<p>اختبار كيفية تعامُل مُترجِم VM مع أوامر التفريع:</p>
<table>
<thead>
<tr>
<th>البرنامج</th>
<th>الوصف</th>
<th>سكربتات الاختبار</th>
</tr>
</thead>
<tbody>
<tr>
<td>BasicLoop.vm</td>
<td>يحسب المجموع 1+2+...+ n ويدفع الناتج إلى المكدس. وهو يختبر تنفيذ أمرَي التفريع goto و if-goto في لغة VM.</td>
<td>BasicLoopVME.tst BasicLoop.tst BasicLoop.cmp</td>
</tr>
<tr>
<td>FibonacciSeries.vm</td>
<td>يحسب أول n عناصر من متسلسلة فيبوناتشي ويخزّنها في الذاكرة. وهذا البرنامج النموذجي لمعالجة المصفوفات يمثّل اختبارًا أكثر تحديًّا لأوامر التفريع في VM.</td>
<td>FibonacciSeriesVME.tst FibonacciSeries.tstFibonacciSeries.cmp</td>
</tr>
</tbody>
</table>
<p>اختبار كيفية تعامُل مُترجِم VM مع أوامر استدعاء الدوال والإرجاع:</p>
<table>
<thead>
<tr>
<th>البرنامج</th>
<th>الوصف</th>
</tr>
</thead>
<tbody>
<tr>
<td>SimpleFunction.vm</td>
<td>يؤدّي عملية حساب بسيطة ويعيد النتيجة. ويوفّر هذا البرنامج اختبارًا أساسيًّا لتنفيذ أمرَي function و return في VM.</td>
</tr>
<tr>
<td>NestedCall: Sys.vm اختبار اختياري ومتوسط، قد يكون مفيدًا عندما ينجح SimpleFunction (الاختبار السابق) ويفشل FibonacciElement (الاختبار التالي).</td>
<td>يختبر عدة متطلبات من بروتوكول استدعاء الدوال. لمزيد من المعلومات حول هذا الاختبار الاختياري، انظر <a href="https://www.nand2tetris.org/copy-of-hdl-survival-guide">هذا الدليل</a> و<a href="https://www.nand2tetris.org/copy-of-nestedcall">هذا الرسم التوضيحي للمكدس.</a> ويمكن استخدامه مع شيفرة تهيئة VM أو بدونها.</td>
</tr>
</tbody>
</table>
<table>
<thead>
<tr>
<th>سكربتات الاختبار</th>
<th>البرنامج</th>
<th>الوصف</th>
</tr>
</thead>
<tbody>
<tr>
<td>SimpleFunctionVME.tst SimpleFunction.tstSimpleFunction.cmp</td>
<td>FibonacciElement: Main.vm Sys.vm تكوّن البرنامج من أكثر من ملف .vm، يجب ترجمة المجلد بأكمله. وينبغي أن تُنتِج الترجمة ملف تجميع وحيدًا باسم FibonacciElement.asm. انظر الملاحظة أدناه لمزيد من المعلومات حول التعامل مع ملفات .vm المتعددة.</td>
<td>يختبر التعامل مع أوامر استدعاء الدوال في VM، وقسم التهيئة (bootstrap)، ومعظم أوامر VM الأخرى. ويتكوّن مجلد البرنامج من ملفَّين كالآتي: يحتوي Main.vm على دالّة واحدة تُسمّى Main.fibonacci. وهذه الدالّة العودية تعيد العنصر رقم n من متسلسلة فيبوناتشي، وهي غير متعلّقة ببرنامج متسلسلة فيبوناتشي الموصوف سابقًا في هذا المشروع. ويحتوي Sys.vm على دالّة وحيدة تُسمّى Sys.init. وهي تستدعي Main.fibonacci بالقيمة n=4، ثم تدور إلى ما لا نهاية (ودالّة Sys.init نفسها ستُستدعى من شيفرة التهيئة التي تولّدها تنفيذات VM).</td>
</tr>
<tr>
<td>NestedCallVME.tst NestedCall.tst NestedCall.cmp</td>
<td>StaticsTest: Class1.vm Class2.vm Sys.vm</td>
<td>تحتوي Class1.vm و Class2.vm على دوال VM مصمَّمة لضبط قيم static متنوعة وقراءتها؛ وذلك لاختبار التعامل مع مقطع الذاكرة static. ويحتوي Sys.vm على دالّة Sys.init وحيدة تستدعي دوال get/set من Class1 و Class2</td>
</tr>
<tr>
<td>FibonacciElementVME.tst FibonacciElement.tst FibonacciElement.cmp بخلاف الاختبارات السابقة، يفترض هذا الاختبار أن المترجم يهيّئ تنفيذ VM. فإن لم تبدأ شيفرة التجميع المولَّدة بشيفرة التهيئة (bootstrap)، فسيفشل الاختبار.</td>
<td></td>
<td></td>
</tr>
<tr>
<td>StaticsTestVME.tst StaticsTest.tst StaticsTest.cmp يفترض هذا الاختبار أن المترجم يهيّئ تنفيذ VM؛ فإن لم تبدأ شيفرة التجميع المولَّدة بشيفرة التهيئة (bootstrap)، فسيفشل الاختبار.</td>
<td></td>
<td></td>
</tr>
</tbody>
</table>
<h3 id="التنفيذ-المقترح">التنفيذ المقترح</h3>
<p>لكل واحد من برامج الاختبار الخمسة، اتّبع الخطوات التالية:</p>
<ul>
<li>
<p>للتعرّف على السلوك المقصود لبرنامج الاختبار Xxx.vm المرفق، شغّله على محاكي VM المرفق باستخدام سكربت XxxVME.tst (فإن تكوّن البرنامج من ملف واحد أو أكثر موجودة في مجلد، فحمّل المجلد بأكمله إلى محاكي VM ونفّذ الشيفرة).</p>
</li>
<li>
<p>استخدم مترجم VM لترجمة ملف Xxx.vm المرفق، أو المجلد، حسب الحاجة. ويجب أن تكون النتيجة ملفًا نصّيًا جديدًا يحتوي على شيفرة تجميع Hack. ويجب أن يكون اسم هذا الملف Xxx.asm.</p>
</li>
<li>
<p>افحص برنامج Xxx.asm المترجَم. فإن ظهرت أخطاء في الصياغة (أو أي أخطاء أخرى)، نقِّح وأصلح مترجم VM.</p>
</li>
<li>
<p>وللتحقق من أداء الشيفرة المترجَمة بشكل سليم، استخدم ملفَّي Xxx.tst و Xxx.cmp المرفقَين لتشغيل برنامج Xxx.asm المترجَم على محاكي CPU المرفق. فإن ظهرت أي مشاكل، نقِّح وأصلح مترجم VM.</p>
</li>
</ul>
<p>واجهة برمجة التطبيقات (API): يتضمّن الفصل 8 واجهة برمجة تطبيقات مقترحة ومستقلّة عن اللغة لمترجم VM. ويمكن أن تكون هذه الواجهة مخططًا لتنفيذك.</p>
<p>ترتيب التنفيذ: خُطِّطت برامج الاختبار المرفقة بعناية لاختبار الميزات التدريجية التي تُدخِلها كل مرحلة في تنفيذ VM خاصتك. لذا من المهم تنفيذ المترجم بالترتيب المقترح، واختباره باستخدام برامج الاختبار المرفقة في كل مرحلة. وقد يُسبّب تنفيذ مرحلة لاحقة قبل مرحلة سابقة فشل برامج الاختبار.</p>
<p>التهيئة: لكي تُنفَّذ شيفرة VM المترجمة على منصة الحاسوب المضيف، يجب أن يتضمّن تدفّق الشيفرة المترجمة (المكتوب بلغة آلة المنصة المضيفة) بعض شيفرة التهيئة (bootstrap) التي تُخطِّط المكدس على ذاكرة الحاسوب المضيف وتبدأ تنفيذ الشيفرة الفعلية. وتفترض برامج الاختبار الثلاثة الأولى في هذا المشروع أن شيفرة التهيئة لم تُنفَّذ بعد، وتتضمّن سكربتات اختبار تؤدّي التهيئات اللازمة (كما في المشروع 7). أما برنامجا الاختبار الأخيران فتفترض أن شيفرة التهيئة يولّدها المترجم. وبعبارة أخرى، يجب أن تبدأ الشيفرة التي يولّدها الإصدار النهائي من مترجِم VM بشيفرة تضبط مؤشّر المكدس وتستدعي دالّة Sys.init. ثم تستدعي Sys.init دالّة Main.main، ويبدأ البرنامج بالعمل (كما تفعل JVM في Java دائمًا، إذ تبحث عن main وتبدأ تنفيذها).</p>
<h3 id="الأدوات">الأدوات</h3>
<p>قبل الشروع في توسيع مترجم VM الأساسي، نوصي باللعب مع برامج الاختبار .vm المرفقة. وسيتيح لك ذلك التجريب مع أوامر التفريع واستدعاء الدوال والإرجاع، باستخدام محاكي VM المرفق.</p>
<p>محاكي VM: هذا البرنامج المكتوب بلغة Java، الذي يجب أن يكون في مجلد nand2tetris/tools خاصتك، مصمَّم لتنفيذ برامج VM بطريقة مباشرة ومرئية، دون الحاجة إلى ترجمتها أولًا إلى لغة الآلة. فعلى سبيل المثال، يمكنك استخدام محاكي VM المرفق لترى - حرفيًّا - كيف تستدعي دالّة أخرى، وكيف تؤدّي الدالّة المستدعاة عملها وتعيد قيمة إلى المستدعي. ولمزيد من المعلومات، انظر درس محاكي VM (<a href="https://www.nand2tetris.org/_files/ugd/56440f_720eab6f8ffe42aca11f7c93020776c4.ppsx?dn=VM%20Emulator%20Tutorial.ppsx">PPT</a>، <a href="https://www.nand2tetris.org/_files/ugd/44046b_d17a762a9fe74be5acee88a7bb91cd15.pdf">PDF</a>)</p>
<p>إليك صورة شاشة نموذجية لمحاكي VM أثناء العمل:</p>
<p><img src="/arabic-cs-library/images/nand2tetris-2/project07-44046b_c10120e0fa4d47718251b5038.webp" alt=""></p>
`,p={book:t,chapter:n,chapterTitle:i,slug:a,title:e,headings:d,html:s};export{t as book,n as chapter,i as chapterTitle,p as default,d as headings,s as html,a as slug,e as title};
