const l="hello-algo",t="chapter_preface",n="المقدمة",i="summary",e="الملخص",c=[{depth:3,id:"مراجعة-أساسية",text:"مراجعة أساسية"}],o=`<h3 id="مراجعة-أساسية">مراجعة أساسية</h3>
<ul>
<li>الجمهور الرئيسي لهذا الكتاب هو المبتدئون في الخوارزميات. وإذا كانت لديك خلفية معينة، فيمكن أن يساعدك هذا الكتاب على مراجعة المعرفة الخوارزمية مراجعة منهجية، كما يمكن استخدام الشيفرة المصدرية في الكتاب «كصندوق أدوات لحل المسائل».</li>
<li>يتضمن محتوى الكتاب أساساً ثلاثة أجزاء: تحليل التعقيد، وبنى البيانات، والخوارزميات، ويغطي معظم الموضوعات في هذا المجال.</li>
<li>بالنسبة إلى المبتدئين في الخوارزميات، تُعدّ قراءة كتاب تمهيدي في مرحلة التعلم الأولى أمراً بالغ الأهمية، إذ تساعدك على تجنب الكثير من الطرق الالتفافية.</li>
<li>تُستخدم الرسوم التوضيحية المتحركة في الكتاب عادةً لعرض المفاهيم الأساسية والموضوعات الصعبة. وعند قراءة هذا الكتاب، ينبغي أن تولي هذه الموضوعات مزيداً من الاهتمام.</li>
<li>التطبيق العملي هو أفضل طريقة لتعلم البرمجة. ويُوصى بشدة بتشغيل الشيفرة المصدرية وكتابة الشيفرة بنفسك.</li>
<li>تتضمن النسخة الإلكترونية من هذا الكتاب قسم تعليقات لكل فصل، ونرحب بأن تشارك أسئلتك وأفكارك في أي وقت.</li>
</ul>
`,a={book:l,chapter:t,chapterTitle:n,slug:i,title:e,headings:c,html:o};export{l as book,t as chapter,n as chapterTitle,a as default,c as headings,o as html,i as slug,e as title};
