const n="crypto-101",e="key-derivation-functions",t="دوال اشتقاق المفاتيح",o="index",p="دوال اشتقاق المفاتيح",c=[{depth:2,id:"دوال-اشتقاق-المفاتيح",text:"دوال اشتقاق المفاتيح"},{depth:3,id:"نظرة-أوفى-إلى-hkdf",text:"نظرة أوفى إلى HKDF"}],d=`<h2 id="دوال-اشتقاق-المفاتيح">دوال اشتقاق المفاتيح</h2>
<h4>الوصف</h4>
<p>دالة اشتقاق المفاتيح (key derivation function) هي دالة تشتقّ قيمةً سرّية واحدة
أو أكثر (وهي <em>المفاتيح</em>) من قيمة سرّية واحدة.</p>
<p>وكثير من دوالّ اشتقاق المفاتيح تقبل أيضًا معامل <code>الملح</code> (salt)\\s، وهو معامل
اختياري عادةً. ويجعل هذا المعامل دالة اشتقاق المفاتيح لا تُعيد دائمًا المفاتيح
نفسها للقيمة السرّية نفسها. وكما في أنظمة التشفير الأخرى، فإنّ <code>الملح</code>\\s يختلف
جوهريًّا عن الدخل السرّي: فالملح لا يلزم عادةً أن يكون سرّيًا، ويمكن إعادة
استعماله.</p>
<p>وتُفيد دوالّ اشتقاق المفاتيح، مثلًا، عندما يبدأ بروتوكول تشفير بقيمة سرّية واحدة،
مثل كلمة مرور مشتركة أو قيمة سرّية مشتقّة بواسطة تبادل المفاتيح
Diffie-Hellman، لكنّه يحتاج إلى عدّة قيم سرّية ليعمل، مثل مفاتيح التشفير ومفاتيح
MAC. ومن استعمالات دوالّ اشتقاق المفاتيح أيضًا المولّدات العشوائيّة الآمنة
تشفيريًّا، وسنراها بمزيد من التفصيل في فصل لاحق، حيث تُستعمل لاستخراج عشوائيّة
ذات كثافة إنتروبيّة عالية من مصادر كثيرة، لكلٍّ منها كثافة إنتروبيّة منخفضة.</p>
<p>وهناك فئتان رئيسيّتان من دوالّ اشتقاق المفاتيح، بحسب محتوى إنتروبيا القيمة
السرّية، وهو ما يحدّد عدد القيم المختلفة التي يمكن أن تتّخذها القيمة السرّية.</p>
<p>فإذا كانت القيمة السرّية، مثلًا، كلمة مرور يقدّمها المستخدم، فإنّها تحوي عادةً
إنتروبيّة ضئيلة جدًّا. فعدد القيم التي يمكن أن تتّخذها كلمة المرور قليل جدًّا.
وكما ثبّتنا من قبل في <code>قسم سابق عن تخزين كلمات المرور &lt;password storage&gt;</code>،
فإنّ ذلك يعني أنّه من الضروري أن تكون دالة اشتقاق المفاتيح صعبة الحساب. أي أنّها
تتطلّب مقدارًا غير تافهٍ من الموارد الحاسوبيّة، مثل دورات المعالج أو الذاكرة.
فإذا كانت دالة اشتقاق المفاتيح سهلة الحساب، لأمكن للمهاجم بمجرّد أن يعدّد كلّ
القيم الممكنة للسرّ المشترك، إذ الاحتمالات قليلة، ثمّ يحسب دالة اشتقاق المفاتيح
لكلٍّ منها. وكما رأينا في ذلك القسم السابق عن تخزين كلمات المرور، فإنّ هكذا
تعمل معظم الهجمات الحديثة على مخازن كلمات المرور. واستعمال دالة اشتقاق مفاتيح
مناسبة يمنع هذه الهجمات. وسنرى في هذا الفصل scrypt، فضلًا عن دوالّ اشتقاق
مفاتيح أخرى في هذه الفئة.</p>
<p>ومن ، يمكن أن تكون القيمة السرّية ذات محتوى إنتروبي عالٍ أيضًا. فمثلًا،
قد تكون سرًّا مشتركًا مشتقًّا من بروتوكول <code>اتّفاق المفاتيح</code> (key agreement)
خاص بـ Diffie-Hellman، أو مفتاح API مكوّنًا من بايتات عشوائيّة تشفيريًّا
(وسنناقش التوليد العشوائي الآمن تشفيريًّا في الفصل التالي). وفي هذه الحالة،
ليس ضروريًّا أن تكون دالة اشتقاق المفاتيح صعبة الحساب: فحتى لو كانت دالة اشتقاق
المفاتيح بسيطة الحساب، فإنّ القيم التي يمكن أن تتّخذها القيمة السرّية كثيرة إلى
حدٍّ ما، فلا يستطيع المهاجم أن يعدّدها كلّها. وسنرى في هذا الفصل أفضل ما في
هذا النوع من دوالّ اشتقاق المفاتيح، وهو HKDF.</p>
<h4>قوّة كلمات المرور</h4>
<p>TODO: منشور NIST الخاص رقم 800-63</p>
<h4>PBKDF2</h4>
<p>bcrypt</p>
<h4>bcrypt</h4>
<p>scrypt</p>
<h4>scrypt</h4>
<h4>HKDF</h4>
<p>HKDF، المعرَّف في RFC 5869 <code>rfc5869</code> والمُفصَّل بدقّة في بحثٍ مرتبط <code>hkdf</code>،
هي دالة اشتقاق مفاتيح مصمَّمة للدخالات ذات الإنترتروبيّة العالية، مثل الأسرار
المشتركة المشتقّة من تبادل مفاتيح Diffie-Hellman. وهي مصمَّمة تحديدًا <em>لا</em>
لتكون آمنة مع الدخالات منخفضة الإنترتروبيّة مثل كلمات المرور.</p>
<p>ويُوجد HKDF ليوفّر على الناس دالة اشتقاق مفاتيح مناسبة جاهزة. وقبل ذلك، كان
اشتقاق المفاتيح في الغالب يجري على نحو ارتجالي لكلّ معيار بعينه. وعادةً ما لم
تكن تلك الحلول الارتجاليّة تملك مقتضيات HKDF الإضافيّة، مثل <code>الملح</code>\\s أو معامل
info الاختياري (وسنناقشه لاحقًا في هذا القسم)؛ وذلك في أَجود الحالات فقط، حيث
لم تكن دالة اشتقاق المفاتيح (KDF) معطوبة أصلًا من البداية.</p>
<p>ويُبنى HKDF على HMAC. ومثل HMAC، فإنّه بناء عامّ يستعمل دوالّ التجزئة، ويمكن
بناءه باستعمال أيّ دالة تجزئة آمنة تشفيريًّا تشاء.</p>
<h3 id="نظرة-أوفى-إلى-hkdf">نظرة أوفى إلى HKDF</h3>
<p>متقدّم</p>
<p>يتألّف HKDF من مرحلتين. في المرحلة الأولى، وتُسمّى <em>مرحلة الاستخراج</em>
(extraction phase)، يُستخرج مفتاح ثابت الطول من إنتروبيا الدخل. وفي المرحلة
الثانية، وتُسمّى <em>مرحلة التوسيع</em> (expansion phase)، يُستعمل ذلك المفتاح لإنتاج
عدد من المفاتيح شبه العشوائيّة.</p>
<p>مرحلة الاستخراج
'''''''''''''''''''</p>
<p>تقع مرحلة الاستخراج على عاتق استخراج كمٍّ صغير من البيانات ذي محتوى إنتروبي عالٍ
من كمٍّ كبير محتمل من البيانات ذو كثافة إنتروبيّة أقلّ.</p>
<p>ولا تستعمل مرحلة الاستخراج إلّا HMAC مع <code>الملح</code> (salt):</p>
<pre><code>def extract(salt, data):
    return hmac(salt, data)
</code></pre>
<p>وقيمة <code>الملح</code> اختياريّة. فإذا لم يُحدَّد <code>الملح</code>، استُعمل سطر من الأصفار طوله
مساوٍ لطول خرج دالة التجزئة. ومع أنّ <code>الملح</code> اختياريّ من الناحية التقنيّة،
فإنّ المصمّمين يُشدّدون على أهميّته، لأنّه يجعل الاستعمالات المستقلّة لدالة اشتقاق
المفاتيح (مثلًا في تطبيقات مختلفة، أو مع مستخدمين مختلفين) تُنتج نتائج مستقلّة.
وحتّى <code>الملح</code> منخفض الإنترتروبي إلى حدٍّ معقول يمكن أن يُسهم إلى حدٍّ كبير في
أمن دالة اشتقاق المفاتيح. <code>rfc5869</code> <code>hkdf</code></p>
<p>وتشرح مرحلة الاستخراج لماذا لا يصلح HKDF لاشتقاق المفاتيح من كلمات المرور.
فبينما مرحلة الاستخراج ممتازة في <em>تركيز</em> الإنترتروبيا، فإنّها غير قادرة على
<em>تكبير</em> الإنترتروبيا. فهي مصمَّمة لضغط كمٍّ صغير من الإنترتروبيا المنتشر على كمٍّ
كبير من البيانات إلى المقدار نفسه من الإنترتروبيا في كمٍّ صغير من البيانات، لكنّها
غير مصمَّمة لإنتاج مجموعة مفاتيح يصعب حسابها عند وجود كمٍّ قليل من الإنترتروبيا
المتاحة. كما أنّه لا مقتضيات تجعل هذه المرحلة مكثفة حسابيًّا. <code>rfc5869</code></p>
<p>وفي بعض الحالات، يمكن تخطّي مرحلة الاستخراج إذا كان السرّ المشترك يمتلك
الخصائص المطلوبة كلّها، مثلًا إذا كان سطرًا شبه عشوائي بطول كافٍ وبإنتروبيّة
كافية. لكنّ هذا لا ينبغي فعله في بعض الحالات البتّة، مثلًا عند التعامل مع سرّ
مشترك خاص بـ Diffie-Hellman. وتتعمّق RFC قليلًا في مسألة تخطّي هذه الخطوة من
عدمه؛ غير أنّ الأمر غير مُستحسن في العموم. <code>rfc5869</code></p>
<p>مرحلة التوسيع
''''''''''''''''</p>
<p>في مرحلة التوسيع، تُوسَّع البيانات العشوائيّة المستخرجة من الدخاخل في مرحلة
الاستخراج إلى قدر البيانات المطلوب.</p>
<p>وتحخطوة التوسيع بسيطة بدورها: إذ تُنتَج كتل البيانات باستعمال HMAC، وهذه المرّة
بالسرّ المستخرَج لا بالملح العلني <code>الملح</code>، إلى أن يُنتَج عدد كافٍ من البايتات.
والبيانات التي يُطبَّق عليها HMAC هي الخرج السابق (انطلاقًا من سطر فارغ)،
ومعامل «info» (وهو السطر الفارغ أيضًا افتراضيًّا)، وبايت عدّاد يعدّ الكتلة
التي يجري إنتاجها حاليًّا.</p>
<pre><code>def expand(key, info=&quot;&quot;):
    &quot;&quot;&quot;Expands the key, with optional info.&quot;&quot;&quot;
    output = &quot;&quot;
    for byte in map(chr, range(256)):
        output = hmac(key, output + info + byte)
        yield output

def get_output(desired_length, key, info=&quot;&quot;):
    &quot;&quot;&quot;Collects output from the expansion step until enough
    has been collected; then returns that output.&quot;&quot;&quot;
    outputs, current_length = [], 0
    for output in expand(key, info):
        outputs.append(output)
        current_length += len(output)

        if current_length &gt;= desired_length:
            break
    else:
        # This block is executed when the for loop *isn't*
        # terminated by the \`\`break\`\` statement, which
        # happens when we run out of \`\`expand\`\` outputs
        # before reaching the desired length.
        raise RuntimeError(&quot;Desired length too long&quot;)

    return &quot;&quot;.join(outputs)[:desired_length]
</code></pre>
<p>ومثل <code>الملح</code> في مرحلة الاستخراج، فإنّ معامل «info» اختياريّ تمامًا، لكنّه يمكن
أن يزيد بدوره إلى حدٍّ كبير في أمن التطبيق. والمقصود بمعامل «info» أن يحتوي على سياق
خاصّ بالتطبيق تُستعمل فيه دالة اشتقاق المفاتيح. ومثل <code>الملح</code>، فإنّه سيجعل دالة
اشتقاق المفاتيح تُنتج قيمًا مختلفة في السياقات المختلفة، ممّا يزيد من أمنها
أكثر. فمثلًا، قد يحتوي معامل info على معلومات عن المستخدم محلّ النظر، أو عن
جزء البروتوكول الذي تُنفَّذ من أجله دالة اشتقاق المفاتيح، أو ما شابه. <code>rfc5869</code></p>
`,u={book:n,chapter:e,chapterTitle:t,slug:o,title:p,headings:c,html:d};export{n as book,e as chapter,t as chapterTitle,u as default,c as headings,d as html,o as slug,p as title};
