const t="ahastack",o="faq-why",p="لماذا؟",e="index",n="لماذا؟",c=[],a=`<p>توقّفت عن كل ما كنت أنشغل به كي أبني هذا الموقع، لأخبرك عن هذه المجموعة من التقنيات التي تبيّن لي أنها تعمل بشكل ممتاز.</p>
<p>لماذا؟</p>
<p>لأنني أعتقد أننا نبني عالمنا.</p>
<p>ولأنقل عن ستيف جوبز:</p>
<blockquote>
<p><em>كل ما حولك وتسمّيه حياة صنعه أشخاص لم يكونوا أذكى منك، وأنت تستطيع تغييره، واستحداثه، وبناء أشياء خاصة بك يستطيع الآخرون استخدامها.</em></p>
</blockquote>
<p>أستطيع أن أشعر متى لا أحب استخدام شيء ما. وفي غياب ما يُجبرني على استخدامه، سواء كان جهة عمل أو راعيًا، أستطيع أن أفعل ما أراه.</p>
<p>وأنا أريد البساطة.</p>
<p>لكن الإبقاء على الأمور بسيطة أمر صعب:</p>
<blockquote>
<p>«البساطة فضيلة عظيمة، لكن بلوغها يتطلّب عملًا شاقًا، وتقديرها يتطلّب تربية. والأسوأ من ذلك: التعقيد يُباع أفضل.» – إيدسغر دايكسترا — <a href="https://twitter.com/flaviocopes/status/1422893172573736960">@flaviocopes, 4 أغسطس 2021</a></p>
</blockquote>
<blockquote>
<p>ما أنشغل به هذه الأيام: تجريدٌ أقلّ وتوقّعيةٌ أكثر، خوادم بلا خادم أقلّ وخوادم أكثر، تعقيدٌ أقلّ وبساطةٌ أكثر، «حافة» (edge) أقلّ وموقعٌ واحد وحيد أكثر (تعرف، إذا كان تطبيقي بلا مستخدمين إطلاقًا...)، تحجيمٌ تلقائي أقلّ و«أحتاج هذا القدر فقط» أكثر — <a href="https://twitter.com/flaviocopes/status/1715793063551832106">@flaviocopes, 21 أكتوبر 2023</a></p>
</blockquote>
<p>غرّدت بهذا في عام 2021، ولم أَرَه يتحقّق إلا بعد سنوات:</p>
<blockquote>
<p>أعتقد أننا على وشك تحوّل كبير في الطريقة التي نبني بها التطبيقات، فالأدوات كلها تتّجه في الاتجاه نفسه: بساطةٌ أكثر، ومقدّمات متكرّرة أقلّ، وسهولةٌ أكبر، وسرعةٌ أكبر، وحشوٌ أقلّ. وأصبحت منصّات النشر أسهل وأرخص ومتكاملة بشكل جيّد مع الأدوات — <a href="https://twitter.com/flaviocopes/status/1459232384168214528">@flaviocopes, 12 نوفمبر 2021</a></p>
</blockquote>
`,s={book:t,chapter:o,chapterTitle:p,slug:e,title:n,headings:c,html:a};export{t as book,o as chapter,p as chapterTitle,s as default,c as headings,a as html,e as slug,n as title};
