const t="nand2tetris-2",n="project11",d="المشروع 11: المصرِّف II: توليد الشيفرة",i="index",a="المشروع 11: المصرِّف II: توليد الشيفرة",p=[{depth:2,id:"المشروع-11-المصرف-ii-توليد-الشيفرة",text:"المشروع 11: المصرِّف II - توليد الشيفرة"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"العقد",text:"العقد"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"التنفيذ-المقترح",text:"التنفيذ المقترح"},{depth:3,id:"الاختبار",text:"الاختبار"}],e=`<h2 id="المشروع-11-المصرف-ii-توليد-الشيفرة">المشروع 11: المصرِّف II - توليد الشيفرة</h2>
<h3 id="خلفية">خلفية</h3>
<p>في هذا المشروع نُكمل بناء مصرِّف Jack الذي بدأناه في المشروع السابق.</p>
<h3 id="العقد">العقد</h3>
<p>وسّع مُحلّل الصياغة المبني في المشروع 10 ليصبح مصرِّف Jack كامل النطاق. وينبغي أن يكون خرج المصرِّف شيفرة VM مصمّمة للعمل على الآلة الافتراضية المُنفّذة في المشروعين 7-8. واستخدم مصرِّفك لتجميع جميع برامج Jack المذكورة أدناه. وتأكّد من أن كل برنامج مترجم ينفّذ وفق ما تقتضيه وثائقه.</p>
<h3 id="الموارد">الموارد</h3>
<p>القراءة ذات الصلة بهذا المشروع هي الفصل 11 من الكتاب. وستحتاج إلى أداتين: لغة البرمجة التي ستنفّذ بها مصرّفك، ومُحاكٍ الآلة الافتراضية المرفق، لاختبار الشيفرة التي يولّدها مصرّفك. وجميع ملفات الاختبار اللازمة لهذا المشروع متوفّرة في projects/11 على حاسوبك.</p>
<h3 id="التنفيذ-المقترح">التنفيذ المقترح</h3>
<p>يتضمّن الفصل 11 واجهة برمجة تطبيقات (API) مقترحة للمصرِّف، يمكن أن تكون بمثابة مخطط تنفيذك. ويعتمد التنفيذ المقترح على تحويل مُحلّل الصياغة المبني في المشروع السابق إلى مصرِّف كامل النطاق. على وجه الخصوص، نقترح استبدال وحدات البرمجيات التي تولّد خرج XML تدريجيًا بوحدات تولّد شيفرة VM. ويمكن إنجاز ذلك في مرحلتي تطوير رئيسيتين، على النحو التالي.</p>
<p>المرحلة الأولى: جدول الرموز</p>
<p>نقترح أن تبدأ ببناء وحدة جدول الرموز في المصرِّف واستخدامها لتوسيع مُحلّل الصياغة المبني في المشروع 10. ففي الوقت الحاضر، كلما صادف المُحلّل معرّفًا في الشيفرة المصدريّة، مثل foo مثلًا، يُخرج سطر XML الآتي: &quot;<identifier> foo </identifier>&quot;. وبدلًا من ذلك، دَع مُحلّلك يُخرج المعلومات التالية كجزء من خرجه بصيغة XML (باستخدام أي صيغة خرج تختارها):</p>
<ul>
<li>
<p>اسم المعرّف، كما يفعل الإصدار الحالي من مُحلّل الصياغة.</p>
</li>
<li>
<p>فئة المعرّف: var، أو argument، أو static، أو field، أو class، أو subroutine.</p>
</li>
<li>
<p>إذا كانت فئة المعرّف var أو argument أو static أو field، فإن الفهرس الجاري الذي يُسنده جدول الرموز إلى المعرّف.</p>
</li>
<li>
<p>ما إذا كان المعرّف يُعرَّف حاليًا (أي أنه يمثّل متغيّرًا مُعلَنًا في عبارة &quot;var&quot;) أو مستخدَمًا.</p>
</li>
</ul>
<p>يمكنك اختبار وحدة جدول الرموز والقدرة المذكورة أعلاه بتشغيل مُحلّل الصياغة المُوسّع على برامج Jack الاختبارية المرفقة في المشروع 10. وحين يتضمّن خرج مُحلّلك المُوسّع المعلومات الواردة أعلاه، فذلك يعني أنك طوّرت قدرة تنفيذية كاملة على فهم البنية النحوية لبرامج Jack. وفي هذه المرحلة يمكنك التحوّل إلى مصرِّف كامل النطاق، والبدء في توليد شيفرة VM بدلًا من خرج XML. ويمكن فعل ذلك بتحويل شيفرة مُحلّل الصياغة المُوسّع تدريجيًا إلى مصرِّف كامل النطاق.</p>
<p>المرحلة الثانية: توليد الشيفرة</p>
<p>نظرًا إلى أننا قدّمنا أمثلة ترجمة عديدة في الفصل 11، فإننا لا نقدّم إرشادات محدّدة حول كيفية تطوير ميزات توليد الشيفرة في المصرِّف. بل نقدّم بدلًا من ذلك مجموعة من ستة برامج تطبيقية، مصمّمة لاختبار هذه الميزات تدريجيًا اختبارًا وحدويًا. ونقترح بشدّة اختبار مصرّفك على هذه البرامج بالترتيب المعطى. وبهذه الطريقة، ستبني قدرات توليد الشيفرة في مصرّفك على مراحل، وفقًا للمتطلّبات المتكشّفة لكل برنامج اختبار.</p>
<p>طريقة الاختبار: عادةً، حين يُترجم برنامج وتظهر بعض المشكلات، يستنتج المرء أن البرنامج هو المخطئ. لكن الوضع في هذا المشروع معاكس تمامًا: فجميع برامج Jack التي نرفقها لأغراض الاختبار خالية من الأخطاء. لذلك، إذا أسفرت ترجمتها عن أي أخطاء، فالمصرِّف هو الذي عليك إصلاحه، لا برامج الاختبار.</p>
<p>لكل برنامج اختبار، اتّبع الروتين التالي:</p>
<ul>
<li>
<p>ترجم مجلد البرنامج باستخدام مصرّفك. وينبغي أن يترجم هذا الإجراء جميع ملفات .jack في المجلد إلى ملفات .vm مقابلة؛</p>
</li>
<li>
<p>افحص ملفات .vm المولّدة. وإذا كانت هناك أي مشكلات ظاهرة، فأصلح مصرّفك وارجع إلى الخطوة 1 (تذكّر: جميع برامج الاختبار المرفقة خالية من الأخطاء)؛</p>
</li>
<li>
<p>اختبر برنامج VM المترجَم بتحميل مجلد البرنامج إلى مُحاكٍ الآلة الافتراضية المرفق، وتنفيذه باستخدام وضع &quot;no animation&quot;. ويتضمّن كل برنامج من برامج الاختبار الستة إرشادات تنفيذ محدّدة، كما هي مُبيّنة أدناه؛ فاختبر البرنامج وفقًا لهذه الإرشادات؛</p>
</li>
<li>
<p>إذا تصرّف برنامج الاختبار على نحو غير متوقّع، أو عرض مُحاكٍ الآلة الافتراضية رسالة خطأ ما، فأصلح مصرّفك وارجع إلى الخطوة 1.</p>
</li>
</ul>
<h3 id="الاختبار">الاختبار</h3>
<p>كل برنامج من البرامج المذكورة أدناه مصمّم لاختبار قدرات محدّدة على التعامل مع اللغة في مصرّفك، اختبارًا تدريجيًا وحدويًا.</p>
<table>
<thead>
<tr>
<th>برنامج الاختبار</th>
<th>الوصف</th>
<th>الغرض</th>
</tr>
</thead>
<tbody>
<tr>
<td>السبعة: Main.jack</td>
<td>يحسب قيمة العبارة (3*2)+1 ويطبع الناتج في أعلى يسار الشاشة. ولاختبار ما إذا كان مصرّفك قد ترجم البرنامج ترجمة صحيحة، شغّل الشيفرة المترجمة في مُحاكٍ الآلة الافتراضية المرفق وتأكّد من أنها تعرض العدد 7 بصورة صحيحة.</td>
<td>يختبر كيف يتعامل مصرّفك مع برنامج بسيط يتضمّن ثلاثة أشياء: عبارة حسابية بثوابت صحيحة (دون متغيّرات)، وعبارة do، وعبارة return.</td>
</tr>
<tr>
<td>التحويل إلى ثنائي: Main.jack</td>
<td>يفكّك عددًا من 16 بتًّا إلى تمثيله الثنائي. يأخذ البرنامج القيمة من 16 بتًّا المخزّنة في RAM[8000] ويخزّن بتّاتها فردةً في RAM[8001..8016] (كل موقع سيحتوي على 0 أو 1). وقبل بدء التحويل، يهيّئ البرنامج مواقع RAM[8001...8016] إلى -1. ولاختبار ما إذا كان مصرّفك قد ترجم البرنامج ترجمة صحيحة، حمّل الشيفرة المترجمة إلى مُحاكٍ الآلة الافتراضية المرفق واتّبع الروتين التالي: - ضع (تفاعليًا) قيمة ما في RAM[8000]؛ - شغّل البرنامج لبضع ثوانٍ، ثم أوقف تنفيذه؛ - تحقّق (تفاعليًا) من أن مواقع RAM[8001...8016] تحتوي على النتائج الصحيحة، وأن أياً منها لا يحتوي على -1.</td>
<td>يختبر كيف يتعامل مصرّفك مع جميع العناصر الإجرائية للغة Jack، أي العبارات والدوالّ وجميع عبارات اللغة. ولا يختبر البرنامج التعامل مع الدالّات العضوية والبانيات والمصفوفات والسلاسل والمتغيّرات الساكنة ومتغيّرات الحقول.</td>
</tr>
<tr>
<td>رقصة المربعات: Main.jack Square.jack SquareGame.jack</td>
<td>تطبيق تفاعلي بسيط، موصوف بالتفصيل في المشروع 9. يتيح تحريك مربّع رسومي حول الشاشة باستخدام مفاتيح الأسهم الأربعة في لوحة المفاتيح. وأثناء الحركة، يمكن زيادة حجم المربّع أو تصغيره بالضغط على مفتاحي &quot;z&quot; و&quot;x&quot; على الترتيب. وللخروج من التطبيق، اضغط مفتاح &quot;q&quot;. ولاختبار ما إذا كان مصرّفك قد ترجم الشيفرة المصدريّة ترجمة صحيحة، شغّل الشيفرة المترجمة في مُحاكٍ الآلة الافتراضية المرفق وتأكّد من أنها تعمل وفق الوصف أعلاه.</td>
<td>يختبر كيف يتعامل مصرّفك مع التراكيب الموجّهة بالكائنات في لغة Jack: البانيات والدالّات العضوية والحقول والعبارات التي تتضمّن نداءات دوالّ عضوية. ولا يختبر البرنامج التعامل مع المتغيّرات الساكنة.</td>
</tr>
<tr>
<td>المتوسط: Main.jack</td>
<td>يحسب متوسّط متتالية من الأعداد الصحيحة يقدّمها المستخدم. ولاختبار ما إذا كان مصرّفك قد ترجم البرنامج ترجمة صحيحة، شغّل الشيفرة المترجمة في مُحاكٍ الآلة الافتراضية المرفق واتبع التعليمات المعروضة على الشاشة.</td>
<td>يختبر كيف يتعامل مصرّفك مع المصفوفات والسلاسل.</td>
</tr>
<tr>
<td>Pong: Main.jack Ball.jack Bat.jack PongGame.jack</td>
<td>في هذه اللعبة الكلاسيكية، تتحرّك الكرة عشوائيًا وترتد عن &quot;جدران&quot; الشاشة. ويمكن للمستخدم تحريك مجداف صغير أفقيًا بالضغط على مفتاحي السهم الأيسر والأيمن في لوحة المفاتيح. وفي كل مرة يصطدم فيها المجداف بالكرة، يكسب المستخدم نقطة ويصغر المجداف قليلًا، لتجعل اللعبة أصعب قليلًا. وإذا أخطأ المستخدم واصطدمت الكرة بالأسفل، تنتهي اللعبة. ولاختبار ما إذا كان مصرّفك قد ترجم هذا البرنامج ترجمة صحيحة، شغّل الشيفرة المترجمة في مُحاكٍ الآلة الافتراضية المرفق والعب اللعبة. وتأكّد من كسب بعض النقاط، لاختبار الجزء من البرنامج الذي يعرض النتيجة على الشاشة.</td>
<td>يوفّر اختبارًا كاملاً لكيفية تعامل مصرّفك مع الكائنات والمتغيّرات الساكنة.</td>
</tr>
<tr>
<td>مصفوفات مركّبة: Main.jack</td>
<td>ينفّذ خمسة حسابات مركّبة باستخدام المصفوفات. وبالنسبة لكل حساب منها، يطبع البرنامج على الشاشة النتيجة المتوقّعة مقابل النتيجة الفعلية (كما ينفّذها البرنامج المترجَم). ولاختبار ما إذا كان مصرّفك قد ترجم البرنامج ترجمة صحيحة، شغّل الشيفرة المترجمة في مُحاكٍ الآلة الافتراضية المرفق وتأكّد من أن النتائج الفعلية مطابقة للنتائج المتوقّعة.</td>
<td>يختبر كيف يتعامل مصرّفك مع مراجع المصفوفات والعبارات المركّبة.</td>
</tr>
</tbody>
</table>
`,o={book:t,chapter:n,chapterTitle:d,slug:i,title:a,headings:p,html:e};export{t as book,n as chapter,d as chapterTitle,o as default,p as headings,e as html,i as slug,a as title};
