const e="database-foundations",n="model-conceptueel-oefeningen",a="Conceptual data model: exercises",o="index",i="نموذج البيانات المفاهيمي: تمارين",l=[{depth:2,id:"تمرين-1-نادي-الشباب-أنواع-الكيانات",text:"تمرين 1: نادي الشباب: أنواع الكيانات"},{depth:2,id:"تمرين-2-نادي-الشباب-الخواص",text:"تمرين 2: نادي الشباب: الخواص"},{depth:2,id:"تمرين-3-نادي-الشباب-العلاقات",text:"تمرين 3: نادي الشباب: العلاقات"},{depth:2,id:"تمرين-4-نادي-الشباب-أنواع-الخواص",text:"تمرين 4: نادي الشباب: أنواع الخواص"},{depth:2,id:"تمرين-5-شركة-تأجير-السيارات",text:"تمرين 5: شركة تأجير السيارات"},{depth:2,id:"تمرين-6-إدارة-الطلاب",text:"تمرين 6: إدارة الطلاب"},{depth:2,id:"تمرين-7-المكتبة",text:"تمرين 7: المكتبة"},{depth:2,id:"تمرين-8-جمعية-ألعاب-الطاولة",text:"تمرين 8: جمعية ألعاب الطاولة"}],p=`<blockquote>
<p>لتكن القوة معك. —Star Wars</p>
</blockquote>
<p>تتيح لك التمارين أدناه التدريب على إنشاء نماذج البيانات المفاهيمية (conceptual data models). ولكل تمرين يُقدَّم نموذج حل. ومن الممكن أن يكون لديك حل مختلف وصحيح بالقدر نفسه. وإذا كانت لديك أسئلة عن حلك الخاص، فلا تتردد في التواصل معنا!</p>
<h2 id="تمرين-1-نادي-الشباب-أنواع-الكيانات">تمرين 1: نادي الشباب: أنواع الكيانات</h2>
<p>تجد أدناه وصفًا لكيفية عمل نادي شباب محتمل. وستُستخدم هذه القصة في التمارين التالية. وستبحث تباعًا عن أنواع الكيانات والخواص والعلاقات. وفي هذا القسم، سنقتصر أولًا على أنواع الكيانات.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-0-chiro.webp" alt=""></p>
<p>اقرأ الوصف أدناه بتمعّن وحاول تحديد أنواع الكيانات.</p>
<p>يريد نادي شباب إنشاء قاعدة بيانات لدعم إدارة عضويته وتخطيط أنشطته. وعند التسجيل الأولي يُمنح كل عضو رقم عضوية فريد. وتُسجَّل معلومات مثل الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني والجنس وتاريخ الميلاد.</p>
<p>وعلى أعضائنا إعادة التسجيل كل عام، لذا يكون التسجيل صالحًا لمدة عام واحد. وتُدفع رسوم العضوية أيضًا سنويًا لتغطية تكاليف التأمين مثلًا. وهذا المبلغ مختلف كل عام، والمهم معرفة أي الأعضاء دفعوا رسوم تسجيلهم وأيّهم لم يدفعها بعد. وفي لحظة إجراء التسجيل، يُوضع العضو في فئة عمرية معينة، مثل &quot;6 إلى 9 سنوات&quot; أو &quot;10 إلى 12 سنة&quot;... وتُحدَّد الفئة العمرية بناءً على عمر العضو عند بداية العام الجديد.</p>
<p>وبعد التسجيل يُضاف الأعضاء إلى مجموعة. ومع كثرة التسجيلات داخل فئة عمرية معينة، من الممكن إنشاء عدة مجموعات لفئة عمرية معينة. وتختار المجموعات نفسها اسمًا تستخدمه طوال العام. وكما في حالة التسجيل، يُعاد النظر في ذلك كل عام وتُعاد القسمة من جديد.</p>
<p>وسيكون لكل مجموعة عضو معيّن يتولّى دور &quot;القائد&quot; للمجموعة. وإضافة إلى ذلك، قد يكون لكل مجموعة &quot;قادة مساعدون&quot; إضافيون، وهم عضو أو أكثر يدعمون القائد &quot;الرئيسي&quot;. ومن الواضح أنه لا ينبغي أن يتطابق عمر القادة مع الفئة العمرية للمجموعة، إذ سيكون ذلك غير لائق بعض الشيء. وتُعاد تحديد القيادة كل عام، وبالتالي تسري مدة حياة المجموعة. ويمكن للأعضاء تولّي قيادة مجموعة واحدة على الأكثر، وينطبق ذلك على &quot;القادة&quot; و&quot;القادة المساعدين&quot; معًا.</p>
<p>وينظّم القادة أنشطة معينة لمجموعاتهم تشكّل معًا الجدول السنوي للمجموعة. ويُجدول كل نشاط في تاريخ ومكان معينين. ويمكن جدولة النشاط نفسه لعدة مجموعات في الوقت نفسه.</p>
<p>ونستخدم قائمة بالأنشطة الممكنة موصوفة في قائمة طويلة. وتحتوي هذه القائمة، لكل نشاط مثل &quot;Swimming&quot;، على ما ينبغي أن يحضره الأعضاء، وكم يستغرق النشاط، وبعض الأمور الأخرى التي يجب مراعاتها. وتُستخدم قائمة الأنشطة الممكنة لتخطيط الأنشطة. ثم تُستخدم القائمة أيضًا للتواصل مع الأعضاء وذويهم.</p>
<p>وتقع مسؤولية تنسيق هذه الأنشطة على عاتق &quot;القائد&quot;. وسيُبلَّغ بعنوان البريد الإلكتروني للقائد حتى يستطيع الأعضاء وذووهم طرح الأسئلة.</p>
<p>والغرض من النظام هو تتبّع سجلات العضوية حيث نريد أن نكون قادرين على الإجابة عن الأسئلة التالية:</p>
<ul>
<li>ما المجموعات التي لدينا؟</li>
<li>ما الأعضاء الذين لدينا هذا العام؟</li>
<li>ما الأعضاء الذين كانوا لدينا العام الماضي؟</li>
<li>ما الأعضاء الذين لدينا من فئة عمرية معينة؟</li>
<li>ما الأعضاء الذين دفعوا رسوم التسجيل؟</li>
<li>أي الأعضاء في أي مجموعة؟</li>
<li>ما القيادة التي لدينا؟</li>
<li>من يقود أي مجموعة؟</li>
<li>ما الأنشطة المخطط لها لمجموعة معينة؟</li>
<li>من المسؤول عن تنسيق الأنشطة المخطط لها؟</li>
<li>متى تُخطط الأنشطة المختلفة؟</li>
<li>أين ستُقام الأنشطة؟</li>
</ul>
<h4>الحل</h4>
<p>الأسماء المرشّحة لتكون نوع كيان هي: Member وRegistration وAge Group وGroup وActivity وActivity Type.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-1-model_conceptueel_oefening1_oplossing_afb01.webp" alt="الحل للتمرين Conceptual.1"></p>
<h2 id="تمرين-2-نادي-الشباب-الخواص">تمرين 2: نادي الشباب: الخواص</h2>
<p>عُد إلى التمرين conceptual.1 وحدّد لكل من أنواع الكيانات الخواص التي تجدها في النص. وينبغي أن تتيح لك الخواص وصف الكيانات. واسأل نفسك الأسئلة التالية:</p>
<ul>
<li>ما الخصائص التي ينبغي أن أتبّعها لكل من أنواع الكيانات؟</li>
<li>ما المعلومات اللازمة لتطبيقي؟ هل أستطيع إيجاد هذه المعلومات في الخواص؟</li>
<li>هل تنقص أنواع كيانات معينة لهيكلة البيانات اللازمة؟ هل يصعب وضع خواص معينة مع أنواع الكيانات التي حدّدتها؟</li>
<li>هل توجد أنواع كيانات معينة لها خاصية واحدة فقط؟ هل نحن متأكدون أن هذا نوع كيان بخاصية واحدة، أم خاصية لنوع كيان آخر؟ فمثلًا، إذا أردنا تتبّع عمر شخص ما، فيمكننا تحديد نوع كيان &quot;Age&quot; بخاصية &quot;Age&quot;. ومن جهة أخرى، قد تكون هذه ببساطة خاصية لنوع الكيان &quot;Person&quot;، دون أن نجعل نموذج بياناتنا معقدًا بلا داعٍ.</li>
</ul>
<p>وسّع مخطط الكيانات والعلاقات (ERD) لديك في draw.io بالخواص التي توصلت إليها. (نصيحة: يمكنك تكرار علامة تبويب في diagrams.net. وبذلك تستطيع البناء على إجابة سؤال سابق، دون فقدان إجابة السؤال الأول).</p>
<h4>الحل</h4>
<p>فيما يلي نظرة عامة على الخواص المختلفة التي حُدِّدت لكل من أنواع الكيانات:</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-2-model_conceptueel_oefening2_oplossing_afb01.webp" alt="الحل للتمرين Conceptual.2"></p>
<h2 id="تمرين-3-نادي-الشباب-العلاقات">تمرين 3: نادي الشباب: العلاقات</h2>
<p>ابنِ على نتائج التمرين conceptual.2 واستكشف العلاقات المختلفة القائمة بين أنواع الكيانات. وصِف العلاقات باسم واضح وحدّد التعددية (cardinality) لكل من أنواع الكيانات المشاركة في العلاقة. واطرح الأسئلة التالية أثناء ذلك:</p>
<ul>
<li>هل تتيح العلاقات إدراج جميع الروابط والمعلومات؟</li>
<li>هل جميع أنواع الكيانات متصلة؟</li>
</ul>
<p>وسّع مخطط الكيانات والعلاقات لديك في diagrams.net بالعلاقات التي توصلت إليها.</p>
<h4>الحل</h4>
<p>يحتوي مخطط الكيانات والعلاقات أدناه على العلاقات مع تعددياتها.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-3-model_conceptueel_oefening3_oplossing_afb01.webp" alt="الحل للتمرين Conceptual.3"></p>
<h2 id="تمرين-4-نادي-الشباب-أنواع-الخواص">تمرين 4: نادي الشباب: أنواع الخواص</h2>
<p>عُد إلى نتيجة التمرين conceptual.3 وحسّن نتيجتك بأنواع الخواص الصحيحة. هل يطابق تدوين خواصك نوعها؟ هل توجد علاقات معينة لها خاصية؟</p>
<p>وسّع مخطط الكيانات والعلاقات لديك في diagrams.net بالعلاقات التي توصلت إليها.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-4-model_conceptueel_oefening4_oplossing_afb01.webp" alt="الحل للتمرين Conceptual.4"></p>
<h2 id="تمرين-5-شركة-تأجير-السيارات">تمرين 5: شركة تأجير السيارات</h2>
<p>في التمارين التالية، سنرسم مخطط كيانات وعلاقات كاملًا على عدد من الخطوات. وتضيف كل خطوة قدرًا من المنطق و/أو التعقيد (النص الأزرق المائل). وصِف الكيانات والخواص والعلاقات بوضوح. ولكل من العلاقات، بيّن بوضوح تعددية كل من أنواع الكيانات المشاركة. وبما أن المهام المختلفة تُبنى على بعضها، يمكنك تكرار علامة تبويب في diagrams.net. ويتيح لك ذلك الاحتفاظ بنظرة عامة على عملك والتمييز بين الخطوات المختلفة.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-5-autoverhuur.webp" alt=""></p>
<h4>الخطوة 1</h4>
<p>تؤجّر شركة لتأجير السيارات سيارات للعملاء. وعند أول عملية تأجير، يُمنح العملاء رقم عميل. ولكل عميل نخزّن أيضًا الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني ورقم الهاتف المحمول. ولكل سيارة نحتفظ بسجل لعلامتها التجارية وطرازها ولوحة أرقامها ورقم هيكلها. وينبغي أن يولّد نظامنا سجلًا لـ:</p>
<ul>
<li>العملاء الذين يؤجّرون سيارة حاليًا</li>
<li>السيارات ومع أي العملاء هي حاليًا</li>
<li>السيارات وما إذا كانت متاحة للتأجير التالي</li>
</ul>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-6-model_conceptueel_oefening5_oplossing_afb01.webp" alt="الحل للتمرين Conceptual.5.1"></p>
<h4>الخطوة 2</h4>
<p>النص الأزرق المائل هو امتداد للتمرين السابق. وتُضاف متطلبات إضافية في كل مرة.</p>
<p>تؤجّر شركة لتأجير السيارات سيارات للعملاء. ويمكن للعملاء حجز نوع من السيارات مسبقًا، مع بيان موعد الاستلام المفضل وموعد الإعادة المفضل. وعند أول عملية تأجير، يُمنح العملاء رقم عميل. ولكل عميل نخزّن أيضًا الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني ورقم الهاتف المحمول. ولكل سيارة نحتفظ بسجل لعلامتها التجارية وطرازها ولوحة أرقامها ورقم هيكلها. وينبغي أن يولّد نظامنا سجلًا لـ:</p>
<ul>
<li>الحجوزات التي أجراها العملاء</li>
<li>العملاء الذين يؤجّرون سيارة حاليًا</li>
<li>السيارات ومع أي العملاء هي حاليًا</li>
<li>السيارات وما إذا كانت متاحة للتأجير التالي</li>
</ul>
<p>نصيحة: لمن لم يؤجّر سيارة من قبل قط، قم بزيارة إحدى شركات تأجير السيارات على الإنترنت. واسأل نفسك: ما الذي أحجزه فعليًا؟</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-7-model_conceptueel_oefening5_oplossing_afb02.webp" alt="الحل للتمرين Conceptual.5.2"></p>
<h4>الخطوة 3</h4>
<p>تؤجّر شركة لتأجير السيارات سيارات للعملاء. ويمكن للعملاء حجز نوع من السيارات مسبقًا، مع بيان موعد الاستلام المفضل وموعد الإعادة المفضل. وعند أول عملية تأجير، يُمنح العملاء رقم عميل. ولكل عميل نخزّن أيضًا الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني ورقم الهاتف المحمول. ولكل سيارة نحتفظ بسجل لعلامتها التجارية وطرازها ولوحة أرقامها ورقم هيكلها. وينبغي أن يولّد نظامنا سجلًا لـ:</p>
<ul>
<li>الحجوزات التي أجراها العملاء</li>
<li>العملاء الذين يؤجّرون سيارة حاليًا</li>
<li>السيارات ومع أي العملاء هي حاليًا</li>
<li>السيارات ومتى تكون متاحة للتأجير التالي</li>
<li>جميع السيارات التي أجّرها عميل معين في الماضي</li>
<li>جميع العملاء الذين أجّروا سيارة معينة في الماضي</li>
</ul>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-8-model_conceptueel_oefening5_oplossing_afb03.webp" alt="الحل للتمرين Conceptual.5.3"></p>
<h2 id="تمرين-6-إدارة-الطلاب">تمرين 6: إدارة الطلاب</h2>
<p>في التمارين التالية، سنرسم مخطط كيانات وعلاقات كاملًا على عدد من الخطوات. وتضيف كل خطوة قدرًا من المنطق و/أو التعقيد (النص الأزرق المائل). وصِف الكيانات والخواص والعلاقات بوضوح. ولكل من العلاقات، بيّن بوضوح تعددية كل من أنواع الكيانات المشاركة. وبما أن المهام المختلفة تُبنى على بعضها، يمكنك تكرار علامة تبويب في diagrams.net. ويتيح لك ذلك الاحتفاظ بنظرة عامة على عملك والتمييز بين الخطوات المختلفة.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-9-kuloket.webp" alt=""></p>
<h4>الخطوة 1</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُدرَّس كل مقرر على يد محاضر واحد. ويُدرّس المحاضرون للطلاب. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجال الخبرة وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-10-model_conceptueel_oefening6_oplossing_afb01.webp" alt="الحل للتمرين Conceptual.6.1"></p>
<h4>الخطوة 2</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُدرَّس كل مقرر على يد محاضر واحد. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجال الخبرة وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p>يمكننا توليد القائمة بناءً على النتيجة السابقة. ولا حاجة إلى إضافة أي شيء.</p>
<h4>الخطوة 3</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُدرَّس كل مقرر على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجال الخبرة وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-11-model_conceptueel_oefening6_oplossing_afb03.webp" alt="الحل للتمرين Conceptual.6.3"></p>
<h4>الخطوة 4</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد على الأكثر لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجال الخبرة وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-12-model_conceptueel_oefening6_oplossing_afb04.webp" alt="الحل للتمرين Conceptual.6.4"></p>
<h4>الخطوة 5</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p>يمكنك حل ذلك بطريقتين: من جهة بنوع كيان &quot;Field of Expertise&quot;، ومن جهة أخرى بخاصية متعددة القيم &quot;Field of Expertise&quot;. وكلا الحلين صحيح.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-13-model_conceptueel_oefening6_oplossing_afb05a.webp" alt="الحل للتمرين Conceptual.6.5.a"> <img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-14-model_conceptueel_oefening6_oplossing_afb05b.webp" alt="الحل للتمرين Conceptual.6.5.b"></p>
<h4>الخطوة 6</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-15-model_conceptueel_oefening6_oplossing_afb06.webp" alt="الحل للتمرين Conceptual.6.6"></p>
<h4>الخطوة 7</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويختار الطالب تدريبًا ضمن مجال خبرة. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-16-model_conceptueel_oefening6_oplossing_afb07.webp" alt="الحل للتمرين Conceptual.6.7"></p>
<h4>الخطوة 8</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويختار الطالب تدريبًا ضمن مجال خبرة يُعيَّن له محاضر مرشدًا. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-17-model_conceptueel_oefening6_oplossing_afb08.webp" alt="الحل للتمرين Conceptual.6.8"></p>
<h4>الخطوة 9</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويختار الطالب تدريبًا ضمن مجال خبرة يُعيَّن له محاضر مرشدًا. وينبغي أن يطابق مجال خبرة التدريب مجال خبرة المرشد. (هل من الممكن إضافة قيود إلى مخطط الكيانات والعلاقات؟) ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p>لا يمكن إضافة شروط إلى مخطط الكيانات والعلاقات. وبناءً على ذلك تبقى النتيجة دون تغيير.</p>
<h4>الخطوة 10</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. ويمكن تقديم وحدة مقرر في حرمات جامعية مختلفة. ولكل حرم جامعي اسم وعنوان. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويختار الطالب تدريبًا ضمن مجال خبرة يُعيَّن له محاضر مرشدًا. وينبغي أن يطابق مجال خبرة التدريب مجال خبرة المرشد. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-18-model_conceptueel_oefening6_oplossing_afb010.webp" alt="الحل للتمرين Conceptual.6.10"></p>
<h4>الخطوة 11</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. وتُبنى بعض المقررات على مقررات قائمة، ولا يمكن دراستها إلا إذا درس الطالب ذلك المقرر أولًا. وقد يفتح المقرر الطريق إلى عدة مقررات. وقد يتطلب المقرر أيضًا أن تكون عدة مقررات أخرى قد دُرست سابقًا. ويمكن تقديم وحدة مقرر في حرمات جامعية مختلفة. ولكل حرم جامعي اسم وعنوان. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويختار الطالب تدريبًا ضمن مجال خبرة يُعيَّن له محاضر مرشدًا. وينبغي أن يطابق مجال خبرة التدريب مجال خبرة المرشد. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-19-model_conceptueel_oefening6_oplossing_afb011.webp" alt="الحل للتمرين Conceptual.6.11"></p>
<h4>الخطوة 12</h4>
<p>يمكن للطالب أن يدرس مقررًا واحدًا أو أكثر، ويُنسَّق كل مقرر على يد محاضر واحد لكنه يُدرَّس على يد محاضر واحد أو أكثر. ويُدرّس المحاضرون للطلاب. ونريد أن نكون قادرين على توليد قائمة نحصل فيها على نظرة عامة عن الطلاب الذين يدرّسهم أي المحاضرين. وتُخزَّن للطالب بيانات الاسم والاسم الأول والعنوان والعمر. وتُخزَّن للمحاضر أيضًا بيانات الاسم والاسم الأول ومجالات الخبرة التي يساهم فيها وعدد سنوات الخدمة. ولكل مقرر نخزّن رمز المقرر واسمه. وتُبنى بعض المقررات على مقررات قائمة، ولا يمكن دراستها إلا إذا درس الطالب ذلك المقرر أولًا. وقد يفتح المقرر الطريق إلى عدة مقررات. وقد يتطلب المقرر أيضًا أن تكون عدة مقررات أخرى قد دُرست سابقًا. ويمكن تقديم وحدة مقرر في حرمات جامعية مختلفة. ولكل حرم جامعي اسم وعنوان. ولكل مقرر يدرسه طالب، نتتبّع النقاط التي حصل عليها الطالب في هذا المقرر. ويختار الطالب تدريبًا ضمن مجال خبرة يُعيَّن له محاضر مرشدًا. وينبغي أن يطابق مجال خبرة التدريب مجال خبرة المرشد. ويجب أن نكون قادرين على تقديم نظرة عامة للسنة الدراسية الحالية ولجميع السنوات الدراسية السابقة.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-20-model_conceptueel_oefening6_oplossing_afb012.webp" alt="الحل للتمرين Conceptual.6.12"></p>
<h2 id="تمرين-7-المكتبة">تمرين 7: المكتبة</h2>
<p>في التمارين التالية، سنرسم مخطط كيانات وعلاقات كاملًا على عدد من الخطوات. وتضيف كل خطوة قدرًا من المنطق و/أو التعقيد (النص الأزرق المائل). وصِف الكيانات والخواص والعلاقات بوضوح. ولكل من العلاقات، بيّن بوضوح تعددية كل من أنواع الكيانات المشاركة. وبما أن المهام المختلفة تُبنى على بعضها، يمكنك تكرار علامة تبويب في diagrams.net. ويتيح لك ذلك الاحتفاظ بنظرة عامة على عملك والتمييز بين الخطوات المختلفة.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-21-mechelen_het_predikheren_public_library_be_001.webp" alt=""></p>
<h4>الخطوة 1</h4>
<p>تُعير مكتبة كتبًا. ويُحدَّد كل كتاب برقم ISBN وعنوان ومؤلف واحد أو أكثر. وقد تكون لدينا عدة نسخ من كتاب معين، ولذلك نمنح كل كتاب رقم نسخة. ويتيح لنا الرقم ISBN ورقم النسخة تحديد كل كتاب تحديدًا فريدًا. ولاستعارة كتاب، يجب أن تكون عضوًا في المكتبة. وعندما يستعير عضو كتابًا للمرة الأولى، يحتاج إلى التسجيل. وعند تسجيل العضو، نستلم الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني ورقم الهاتف المحمول. ثم نمنحه أيضًا رقم عضوية. وتريد المكتبة معرفة الكتب المستعارة حاليًا. وعندما لا يُعاد كتاب في الوقت المحدد، تُسجَّل غرامة. ونريد أن نكون قادرين على توليد نظرة عامة على الغرامات المستحقة والمبلغ المتوجب.</p>
<h4>الحل</h4>
<p>يمكننا إضافة 3 علاقات ثنائية بين Member وFine وBook.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-22-conceptual_7_1_a.webp" alt="الحل للتمرين Conceptual.7.1.a"></p>
<p>غير أن ذلك قد يؤدي إلى مواقف غريبة في الواقع. فلنفترض أن مستخدمة تُدعى Emma استعارت الكتاب 1 والكتاب 2. فقد تتلقى حينئذ غرامة على الكتاب 3 رغم أنها لم تستعره. وهذا غير صحيح. وسنستخدم بدلًا من ذلك علاقة ثلاثية، بحيث ترتبط الغرامة بفعل الاستعارة.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-23-conceptual_7_1_b.webp" alt="الحل للتمرين Conceptual.7.1.b"></p>
<h4>الخطوة 2</h4>
<p>تُعير مكتبة كتبًا. غير أن لدينا أيضًا كتبًا أثمن من أن تُعار. فلا يمكن الرجوع إليها إلا داخل المكتبة. ويُحدَّد كل كتاب برقم ISBN وعنوان ومؤلف واحد أو أكثر. وقد تكون لدينا عدة نسخ من كتاب معين، ولذلك نمنح كل كتاب رقم نسخة. ويتيح لنا الرقم ISBN ورقم النسخة تحديد كل كتاب تحديدًا فريدًا. ولاستعارة كتاب، يجب أن تكون عضوًا في المكتبة. وعندما يستعير عضو كتابًا للمرة الأولى، يحتاج إلى التسجيل. وعند تسجيل العضو، نستلم الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني ورقم الهاتف المحمول. ثم نمنحه أيضًا رقم عضوية. وتريد المكتبة معرفة الكتب المستعارة حاليًا. وعندما لا يُعاد كتاب في الوقت المحدد، تُسجَّل غرامة. ونريد أن نكون قادرين على توليد نظرة عامة على الغرامات المستحقة والمبلغ المتوجب.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-24-conceptual_7_2.webp" alt="الحل للتمرين Conceptual.7.2"></p>
<h4>الخطوة 3</h4>
<p>تُعير مكتبة كتبًا. غير أن لدينا أيضًا كتبًا أثمن من أن تُعار. فلا يمكن الرجوع إليها إلا داخل المكتبة. ويُحدَّد كل كتاب برقم ISBN وعنوان ومؤلف واحد أو أكثر. وقد تكون لدينا عدة نسخ من كتاب معين، ولذلك نمنح كل كتاب رقم نسخة. ويتيح لنا الرقم ISBN ورقم النسخة تحديد كل كتاب تحديدًا فريدًا. ولاستعارة كتاب، يجب أن تكون عضوًا في المكتبة. وعندما يستعير عضو كتابًا للمرة الأولى، يحتاج إلى التسجيل. وعند تسجيل العضو، نستلم الاسم والاسم الأول والعنوان وعنوان البريد الإلكتروني ورقم الهاتف المحمول. ثم نمنحه أيضًا رقم عضوية. وتريد المكتبة معرفة الكتب المستعارة حاليًا. وعندما لا يُعاد كتاب في الوقت المحدد، تُسجَّل غرامة. ونريد أن نكون قادرين على توليد نظرة عامة على الغرامات المستحقة والمبلغ المتوجب. ولا يريد أمين المكتبة نظرة عامة على الكتب المستعارة حاليًا فحسب، بل يريد أيضًا معرفة الكتب الأكثر أو الأقل استعارة، والكتب الأكثر أو الأقل مراجعة، والأعضاء الذين يعيدون الكتب متأخرين في أغلب الأحيان.</p>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-25-conceptual_7_3.webp" alt="الحل للتمرين Conceptual.7.3"></p>
<h2 id="تمرين-8-جمعية-ألعاب-الطاولة">تمرين 8: جمعية ألعاب الطاولة</h2>
<p>أنشئ مخطط كيانات وعلاقات للوصف التالي. وبيّن بوضوح تعددية العلاقات وخواص أنواع الكيانات.</p>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-26-IMG_1656.webp" alt=""></p>
<p>تريد جمعية لألعاب الطاولة تطوير تطبيق لدعم جمعيتها. وتنظّم الجمعية دورات لأعضائها المختلفين. وتدور الدورة حول لعبة طاولة محددة. وعادةً ما يمنحون كل دورة اسمًا طريفًا للتواصل بسهولة مع أعضائها. والهدف هو إعلان أحد الأعضاء فائزًا بالدورة. ويسجّل الأعضاء أسماءهم في الدورة. وبناءً على التسجيلات تُنظَّم المباريات. وتُجدول كل مباراة في تاريخ ووقت محددين. وتُقام الدورات في مركز الجمعية. ولكل طاولة رقم. وبالنسبة للمباريات يتتبّعون الطاولة التي تُجدول عليها المباراة. وتُلعب كل مباراة من عدد من أعضاء الجمعية. وفي كل مباراة يتولّى أحد الأعضاء دور قائد اللعبة. وهذا الشخص مسؤول عن تسجيل النقاط الفردية للاعبين. ويُسجَّل الأعضاء في النظام حتى يستطيعوا المشاركة في المباريات وتولّي دور قائد اللعبة. ولكل عضو يريدون الاحتفاظ بالاسم وعنوان البريد الإلكتروني وتاريخ الميلاد. ويمكن للأعضاء تقديم أعضاء آخرين. ولديهم فهرس بالألعاب يستخدمونه لتنظيم الدورات والمسابقات. ولكل لعبة يحتاجون إلى تخزين الاسم وعدد اللاعبين والطبعة. ويمكن أن تكون لعبة الطاولة إما لعبة أساسية وإما توسعة. وإذا كانت توسعة، فيريدون معرفة اللعبة الأساسية التي هي توسعة لها. ولكل لعبة طاولة يريدون قائمة بالأعضاء الذين يستطيعون قيادة مباريات تلك اللعبة. وفي أي وقت، نحتاج إلى أن نكون قادرين على إنشاء نظرة عامة على:</p>
<ul>
<li>جدول الدورات والمباريات</li>
<li>المباريات الملعوبة، وأي الأعضاء شاركوا، والنقاط التي حصل عليها الأعضاء</li>
<li>الفائزين بالدورات المختلفة</li>
<li>فهرس ألعاب الطاولة، مع قادة اللعبة المحتملين</li>
</ul>
<h4>الحل</h4>
<p><img src="/arabic-cs-library/images/database-foundations/model-conceptueel-oefeningen-27-model_conceptueel_oefening8_oplossing_afb01.webp" alt="الحل للتمرين conceptual.8"></p>
`,t={book:e,chapter:n,chapterTitle:a,slug:o,title:i,headings:l,html:p};export{e as book,n as chapter,a as chapterTitle,t as default,l as headings,p as html,o as slug,i as title};
