const i="database-foundations",a="model-drawio",o="رسم المخططات باستخدام draw.io",t="index",d="رسم النماذج باستخدام draw.io",n=[{depth:2,id:"مقدمة-عامة-عن-drawio-diagramsnet",text:"مقدمة عامة عن Draw.io (diagrams.net)"},{depth:2,id:"رسم-نموذج-بيانات-مفاهيمي-باستخدام-drawio",text:"رسم نموذج بيانات مفاهيمي باستخدام draw.io"},{depth:2,id:"رسم-نموذج-بيانات-منطقي-باستخدام-drawio",text:"رسم نموذج بيانات منطقي باستخدام draw.io"},{depth:2,id:"من-المفاهيمي-إلى-المنطقي",text:"من المفاهيمي إلى المنطقي"}],e=`<blockquote>
<p>الرسم يجعلك ترى الأشياء بوضوح أكبر، وأكبر، وأكبر. فالصورة تمر عبرك بشكل فسيولوجي، إلى دماغك، إلى ذاكرتك - حيث تبقى - وتنتقل عبر يديك. —Martin Gayford، A Bigger Message: Conversations with David Hockney</p>
</blockquote>
<h2 id="مقدمة-عامة-عن-drawio-diagramsnet">مقدمة عامة عن Draw.io (diagrams.net)</h2>
<p>توجد أدوات كثيرة لرسم النماذج. وسنستخدم <a href="https://www.drawio.com">draw.io</a> (المعروف أيضًا بـ &quot;diagrams.net&quot;) في هذه الدورة. ويمكنك استخدام draw.io محليًا (بعد التثبيت) وكـتطبيق ويب. ويعطيك الفيديو التالي مقدمة عامة موجزة (غير خاصة بالنمذجة المفاهيمية).</p>
<h2 id="رسم-نموذج-بيانات-مفاهيمي-باستخدام-drawio">رسم نموذج بيانات مفاهيمي باستخدام draw.io</h2>
<p>يوضّح هذا الفيلم القصير كيفية رسم نموذج بيانات مفاهيمي (conceptual data model) في Draw.io. ويُغطّي الموضوعات التالية:</p>
<ul>
<li>أنواع الكيانات والعلاقات والخواص والتعدديات؛</li>
<li>التحديد والنسخ / اللصق والتراجع؛</li>
<li>ربط العناصر؛</li>
<li>التصميم: التخطيط واللون والخطوط والخط الطباعي.</li>
</ul>
<h2 id="رسم-نموذج-بيانات-منطقي-باستخدام-drawio">رسم نموذج بيانات منطقي باستخدام draw.io</h2>
<p>يشرح هذا الفيديو جيدًا كيفية رسم نموذج بيانات منطقي في draw.io. وفي نهايته يصبح الفيديو مفصّلًا أكثر من اللازم قليلًا. فمثلًا، يتحدث في الدقيقة الأخيرة عن &quot;كيان غير محدِّد&quot; (non-defining entity) وهو ما لا نغطّيه في هذه الدورة. لذا احرص على مشاهدة الأجزاء ذات الصلة فقط.</p>
<h2 id="من-المفاهيمي-إلى-المنطقي">من المفاهيمي إلى المنطقي</h2>
<p>فيديو إضافي يبدأ فيه شخص من نموذج بيانات مفاهيمي ويشرح كيف يحوّله إلى نموذج منطقي.</p>
`,r={book:i,chapter:a,chapterTitle:o,slug:t,title:d,headings:n,html:e};export{i as book,a as chapter,o as chapterTitle,r as default,n as headings,e as html,t as slug,d as title};
