const n="crafting-interpreters",t="welcome",e="مرحبًا",c="index",o="ترحيب",s=[],p=`<p>قد تكون هذه بداية مغامرةٍ عظيمة. فاللّغات البرمجية تنصج بمساحةٍ هائلة للاستكشاف والعبث فيها.
فهناك متّسعٌ وفير لإبداعاتك الخاصة كي تشاركها مع الآخرين أو
لتستمتع بها وحدك. لقد قضى علماء الحاسوب المهرة ومهندسو البرمجيات اللّامعون
مسيرتهم كلّها يقطعون هذه الأرض دون أن يبلغوا نهايتها أبداً. فإذا
كان هذا الكتاب أوّل دخولك إلى هذا البلد، فأهلاً بك.</p>
<p>تمنحك صفحات هذا الكتاب جولةً مُرشَدة في بعض عوالم اللّغات.
لكنّنا قبل أن نرتدي أحذية المشي ونخرج، ينبغي أن نتعرّف على
الإقليم. تقدّمك فصول هذا القسم إلى المفاهيم الأساسية التي
تستعملها لغات البرمجة، وإلى كيفية تنظيم تلك المفاهيم.</p>
<p>وسنتعرّف أيضاً على Lox، اللّغة التي سننفّذها طوال بقية
الكتاب (مرّتين).</p>
`,r={book:n,chapter:t,chapterTitle:e,slug:c,title:o,headings:s,html:p};export{n as book,t as chapter,e as chapterTitle,r as default,s as headings,p as html,c as slug,o as title};
