const l="hello-algo",n="chapter_heap",t="الأكوام (Heaps)",i="summary",o="ملخص",e=[{depth:3,id:"مراجعة-النقاط-الرئيسية",text:"مراجعة النقاط الرئيسية"},{depth:3,id:"أسئلة-وأجوبة",text:"أسئلة وأجوبة"}],h=`<h3 id="مراجعة-النقاط-الرئيسية">مراجعة النقاط الرئيسية</h3>
<ul>
<li>الكومة شجرة ثنائية كاملة. ووفقاً للخاصية التي تحققها يمكن تصنيفها إلى كومة عظمى أو كومة صغرى. والعنصر الأعلى في الكومة العظمى (الصغرى) هو العنصر الأكبر (الأصغر).</li>
<li>طابور الأولوية طابور تُسحب عناصره وفق الأولوية، ويُنفَّذ عادةً باستخدام كومة.</li>
<li>تشمل عمليات الكومة الشائعة وتعقيداتها الزمنية المقابلة: إدراج عنصر $O(\\log n)$، وحذف العنصر الأعلى $O(\\log n)$، والوصول إلى العنصر الأعلى $O(1)$.</li>
<li>تُلائم الأشجار الثنائية الكاملة التمثيل بالمصفوفات، لذا نستخدم عادةً المصفوفات لتخزين الأكوام.</li>
<li>تُستخدم عمليات تعديل الكومة للحفاظ على خاصية الكومة، وتُوظَّف في كل من عمليتي إدراج العناصر وحذفها.</li>
<li>يمكن تحسين بناء كومة انطلاقاً من $n$ من عناصر الإدخال ليصبح $O(n)$، وهو أمر عالي الكفاءة.</li>
<li>مسألة أعلى k مسألة خوارزمية كلاسيكية يمكن حلها بكفاءة باستخدام كومة، بتعقيد زمني $O(n \\log k)$.</li>
</ul>
<h3 id="أسئلة-وأجوبة">أسئلة وأجوبة</h3>
<p><strong>س</strong>: هل يعني مصطلح «الكومة» في بنى البيانات الشيء نفسه الذي يعنيه «heap» في إدارة الذاكرة؟</p>
<p>ليسا المفهوم نفسه، وإنما يشتركان في الاسم فقط. ففي أنظمة الحاسوب، الكومة جزء من التخصيص الديناميكي للذاكرة، ويمكن للبرامج استخدامها لتخزين البيانات أثناء التشغيل. ويمكن للبرنامج أن يطلب مقداراً معيناً من ذاكرة الكومة لتخزين بنى معقدة مثل الكائنات والمصفوفات. وعندما لا تعود البيانات لازمة، يجب على البرنامج تحرير تلك الذاكرة لمنع تسرّب الذاكرة. وبالمقارنة بذاكرة المكدس، تتطلب ذاكرة الكومة إدارة واستخداماً أكثر حرصاً؛ وقد يؤدي سوء التعامل معها إلى مشكلات مثل تسرّب الذاكرة والمؤشرات المعلّقة.</p>
`,p={book:l,chapter:n,chapterTitle:t,slug:i,title:o,headings:e,html:h};export{l as book,n as chapter,t as chapterTitle,p as default,e as headings,h as html,i as slug,o as title};
