const e="introtcs",n="lec_08a_restricted_models",$="Restricted Models of Computation",t="index",i="نماذج الحوسبة المقيَّدة { #restrictedchap }",a=[{depth:3,id:"objectives",text:"{ .objectives }"},{depth:2,id:"اكتمال-تورينج-بوصفه-خللا",text:"اكتمال تورينج بوصفه خللًا"},{depth:2,id:"القواعد-النحوية-الخالية-من-السياق-seccfg",text:"القواعد النحوية الخالية من السياق { #seccfg }"},{depth:3,id:"القواعد-النحوية-الخالية-من-السياق-بوصفها-نموذج-حوسبة",text:"القواعد النحوية الخالية من السياق بوصفها نموذج حوسبة"},{depth:3,id:"theorem-titlequotالقواعد-النحوية-الخالية-من-السياق-تتوقف-دائماquot-cfghalt",text:"{.theorem title=&quot;القواعد النحوية الخالية من السياق تتوقف دائمًا&quot; #CFGhalt}"},{depth:3,id:"قوة-القواعد-النحوية-الخالية-من-السياق",text:"قوة القواعد النحوية الخالية من السياق"},{depth:3,id:"theorem-titlequotالقواعد-النحوية-الخالية-من-السياق-والتعبيرات-النمطية-العاديةquot-cfgreg",text:"{.theorem title=&quot;القواعد النحوية الخالية من السياق والتعبيرات النمطية العادية&quot; #CFGreg}"},{depth:3,id:"قيود-القواعد-النحوية-الخالية-من-السياق-اختياري",text:"قيود القواعد النحوية الخالية من السياق (اختياري)"},{depth:3,id:"theorem-titlequotلمة-الضخ-الخالية-من-السياقquot-cfgpumping",text:"{.theorem title=&quot;لمّة الضخّ الخالية من السياق&quot; #cfgpumping}"},{depth:2,id:"الخصائص-الدلالية-للغراتم-الخالية-من-السياق",text:"الخصائص الدلالية للغراتم الخالية من السياق"},{depth:3,id:"theorem-titlequotفراغية-قواعد-cfg-قابلة-لإصدار-القرارquot-cfgemptinessthem",text:"{.theorem title=&quot;فراغية قواعد CFG قابلة لإصدار القرار&quot; #cfgemptinessthem}"},{depth:3,id:"proofidea-data-refquotcfgemptinessthemquot",text:"{.proofidea data-ref=&quot;cfgemptinessthem&quot;}"},{depth:3,id:"عدم-قابلية-حساب-تكافؤ-القواعد-النحوية-الخالية-من-السياق-اختياري",text:"عدم قابلية حساب تكافؤ القواعد النحوية الخالية من السياق (اختياري)"},{depth:3,id:"theorem-titlequotكتمال-قواعد-cfg-غير-قابل-للحسابquot-fullnesscfgdef",text:"{.theorem title=&quot;كتمال قواعد CFG غير قابل للحساب&quot; #fullnesscfgdef}"},{depth:2,id:"ملخص-الخصائص-الدلالية-للتعبيرات-النمطية-العادية-والقواعد-النحوية-الخالية-من-السياق",text:"ملخّص الخصائص الدلالية للتعبيرات النمطية العادية والقواعد النحوية الخالية من السياق"},{depth:3,id:"recap",text:"{ .recap }"},{depth:2,id:"التمارين",text:"التمارين"},{depth:2,id:"ملاحظات-مرجعية",text:"ملاحظات مرجعية"}],o=`<h1>نماذج الحوسبة المقيَّدة { #restrictedchap }</h1>
<blockquote>
<h3 id="objectives">{ .objectives }</h3>
</blockquote>
<ul>
<li>ترى أن اكتمال تورينج ليس دائمًا شيئًا جيدًا.</li>
<li>مثال آخر على صيغة رسمية تتوقف دائمًا: <em>القواعد النحوية الخالية من السياق</em> (context-free grammars) و_حساب لامدا المصنَّف ببساطة_ (simply typed $\\lambda$ calculus).</li>
<li>لمّة الضخّ (pumping lemma) للدوال غير الخالية من السياق.</li>
<li>أمثلة على <em>خصائص دلالية</em> (semantic properties) قابلة للحساب وغير قابلة للحساب، لكل من التعبيرات النمطية العادية والقواعد النحوية الخالية من السياق.</li>
</ul>
<blockquote>
<p><em>&quot;كل الأسر السعيدة متشابهة؛ وكل أسرة تعيسة تعيسة بطريقتها الخاصة&quot;</em>, ليو تولستوي (مطلع كتاب &quot;آنا كارينينا&quot;).</p>
</blockquote>
<p>لقد رأينا أن كثيرًا من نماذج الحوسبة <em>متكافئة بحسب تورينج</em> (Turing equivalent)، بما في ذلك آلات تورينج، وبرامج NAND-TM/NAND-RAM، ولغات البرمجة المعيارية مثل C/Python/Javascript، فضلًا عن نماذج أخرى مثل حساب لامدا وحتى لعبة الحياة.
ووجه الأمر المقابل هو أن نظرية Rice (<a href="/arabic-cs-library/images/introtcs/lec_08a_restricted_models-1.webp">rice-thm</a>{.ref}) تتحقق أيضًا بالنسبة لجميع هذه النماذج، أي أن أي خاصية دلالية لبرامج أي نموذج من هذه النماذج هي <em>غير قابلة للحساب</em>.</p>
<p>إن عدم قابلية الحساب لمسألة التوقف (halting) ولغيرها من مسائل التحديد الدلالي في النماذج المتكافئة بحسب تورينج هو ما يحفّز على صياغة <strong>نماذج حوسبة مقيَّدة</strong> (<strong>restricted computational models</strong>) تكون <strong>(أ)</strong> قوية بما يكفي لالتقاط مجموعة من الدوال المفيدة لتطبيقات معينة، لكنها <strong>(ب)</strong> ضعيفة بما يكفي بحيث ما زالت نستطيع حل مسائل التحديد الدلالي عليها.
في هذا الفصل نناقش عدة أمثلة من هذا النوع.</p>
<p>::: { .bigidea #restrictedmodel}
يمكننا استخدام <em>النماذج الحوسبة المقيَّدة</em> (restricted computational models) لتجاوز قيود مثل عدم قابلية مسألة التوقف (Halting problem) ونظرية Rice للحساب. هذه النماذج تستطيع حساب مجموعة فرعية مقيَّدة من الدوال فحسب، لكنها تتيح لنا الإجابة على بعض الأسئلة الدلالية (<em>semantic questions</em>) حول البرامج على الأقل.
:::</p>
<p><img src="/arabic-cs-library/images/introtcs/lec_08a_restricted_models-1.webp" alt="/images/introtcs/lec_08a_restricted_models-1.webp">{#restrictedmodelsoverviewfig}</p>
<h2 id="اكتمال-تورينج-بوصفه-خللا">اكتمال تورينج بوصفه خللًا</h2>
<p>لقد رأينا أن النماذج أو الأنظمة الحوسبية التي تبدو بسيطة قد يتبيّن أنها كاملة بحسب تورينج (Turing complete).
تسرد <a href="https://goo.gl/xRXq7p">هذه الصفحة</a> عدة أمثلة لصيغ رسمية (formalisms) تبيّن &quot;عرضًا&quot; أنها كاملة بحسب تورينج، بما في ذلك لغات يُفترض أنها محدودة مثل المعالج المسبق للغة C، وCSS، و(أشكال معيّنة من) SQL، وإعدادات sendmail، فضلًا عن ألعاب مثل Minecraft وSuper Mario ولعب البطاقات &quot;Magic: The Gathering&quot;.
وليست اكتمالية تورينج شيئًا جيدًا دائمًا، فهي تعني أن هذه الصيغ الرسمية تستطيع أن تنتج سلوكًا معقّدًا إلى حد غير محدود.
على سبيل المثال، صيغة postscript (سابقة لـ PDF) هي لغة برمجة كاملة بحسب تورينج، الغرض منها وصف مستندات للطباعة.
وتتيح القوة التعبيرية لـ postscript أوصافًا قصيرة لصور شديدة التعقيد، لكنها أيضًا أنتجت بعض المفاجآت السيئة، مثل الهجمات الموصوفة في <a href="http://hacking-printers.net/wiki/index.php/PostScript">هذه الصفحة</a>، والتي تتراوح من استخدام الحلقات اللانهائية هجومًا لحجب الخدمة، إلى الوصول إلى نظام ملفات الطابعة.</p>
<p>::: {.example title=&quot;اختراق The DAO&quot; #ethereum}
نشأ مثال حديث مثير للاهتمام على مخاطر اكتمالية تورينج في سياق العملة الرقمية <a href="https://www.ethereum.org/">Ethereum</a>.
السمة المميِّزة لهذه العملة هي القدرة على تصميم &quot;العقود الذكية&quot; (smart contracts) باستخدام لغة برمجة تعبيرية (وهي على وجه الخصوص كاملة بحسب تورينج).
في اقتصادنا &quot;الذي يشغّله البشر&quot; اليوم، قد يوقّع Alice وBob عقدًا يتفقان فيه على أنه إذا حدث الشرط X فسيستثمران معًا في شركة Charlie.
يسمح Ethereum لـ Alice وBob بإنشاء مشروع مشترك يجمعان فيه أموالهما في حساب واحد تحكمه برنامج ما $P$ يقرّر تحت أي ظروف يصرف الأموال منه.
على سبيل المثال، يمكن تخيّل قطعة شيفرة تتفاعل بين Alice وBob وبين برنامج يعمل في سيارة Bob، وتسمح لـ Alice باستئجار سيارة Bob دون أي تدخل بشري أو أي تكلفة إدارية.</p>
<p>وتستخدم Ethereum تحديدًا لغة البرمجة الكاملة بحسب تورينج <a href="https://solidity.readthedocs.io/en/develop/index.html">solidity</a>، التي صياغتها شبيهة بـ JavaScript.
وكان أبرز ما في Ethereum تجربة عُرفت باسم &quot;المنظمة اللامركزية ذاتية الإدارة&quot; (Decentralized Autonomous Organization) أو <a href="https://goo.gl/NegW77">The DAO</a>.
كانت الفكرة إنشاء عقد ذكي ينشئ صندوق استثمار رأس مال مغامر لامركزيًا يعمل ذاتيًا، بلا مديرين بشريين، حيث يقرر المساهمون فرص الاستثمار.
كانت The DAO في حينه أنجح عملية جمع تمويل جماعي (crowdfunding) في التاريخ. وفي ذروتها كانت The DAO تساوي 150 مليون دولار، أي أكثر من عشرة في المئة من حجم سوق Ethereum الكلي.
والاستثمار في The DAO (أو الدخول في أي &quot;عقد ذكي&quot; آخر) يعني تسليم أموالك لتُدار بواسطة برنامج حاسوبي؛ أي بمعنى آخر &quot;الشيفرة هي القانون&quot;، أو بكلمات The DAO التي وصفت نفسها بها: <em>&quot;The DAO وُلدت من شيفرة حاسوبية غير قابلة للتغيير، ولا يمكن إيقافها، ولا يمكن دحضها&quot;</em>.
للأسف، يتبيّن أنه (كما رأينا في <a href="https://ethereumclassic.github.io/">chapcomputable</a>{.ref}) فهم سلوك برامج الحاسوب أمر صعب حقًا.
تمكّن أحد المخترقين (أو ربما، كما يقول بعضهم، مستثمر ماهر) من صياغة مدخل جعل شيفرة The DAO تدخل في حلقة تكرارية لا نهائية تحوّل فيها الأموال باستمرار إلى حساب المخترق، بحيث <a href="https://www.bloomberg.com/features/2017-the-ether-thief/">سحب من The DAO نحو 60 مليون دولار</a>.
ورغم أن هذه العملية كانت &quot;قانونية&quot; بالمعنى أنها امتثلت لشيفرة العقد الذكي، فإنها لم تكن بوضوح ما قصده البشر الذين كتبوا هذه الشيفرة.
واجه مجتمع Ethereum صعوبة في الاستجابة لهذا الهجوم.
حاول بعضهم نهج &quot;روبن هود&quot; باستخدام الثغرة نفسها لتفريغ أموال The DAO في حساب آمن، لكن ذلك لم يحقق سوى نجاح محدود.
وفي النهاية، قرر مجتمع Ethereum أن الشيفرة يمكن أن تكون قابلة للتغيير، وقابلة للإيقاف، وقابلة للدحض.
وتحديدًا، اتفق مشرفو Ethereum والعُدّناء (miners) على &quot;تشعّب قاسٍ&quot; (hard fork)، ويُعرف أيضًا بـ&quot;الإنقاذ&quot; (bailout)، لإعادة التاريخ إلى ما قبل تنفيذ المخترق لعمليته.
عارض بعض أعضاء المجتمع بشدة هذا القرار، فأنشئت عملة بديلة اسمها <a href="https://ethereumclassic.github.io/">Ethereum Classic</a> تحفظ التاريخ الأصلي.
:::</p>
<h2 id="القواعد-النحوية-الخالية-من-السياق-seccfg">القواعد النحوية الخالية من السياق { #seccfg }</h2>
<p>إذا كنت قد كتبت برنامجًا من قبل، فقد جرّبت <em>خطأً نحويًا</em> (<em>syntax error</em>).
وربما جرّبت أيضًا أن يدخل برنامجك في <em>حلقة لا نهائية</em>.
أما الأقل احتمالًا فهو أن يُدخل المُصرِّف (compiler) أو المُفسِّر (interpreter) نفسه في حلقة لا نهائية وهو يحاول تحديد ما إذا كان برنامجك يحتوي على خطأ نحوي.</p>
<p>عندما يصمّم شخص لغة برمجة، عليه أن يحدّد <em>صيغتها النحوية</em> (<em>syntax</em>).
أي أن المصمّم يقرّر أي السلاسل تقابل برامج صحيحة وأيها لا يقابلها (أي: أي السلاسل تحتوي على خطأ نحوي).
ولضمان أن يتوقف المُصرِّف أو المُفسِّر دائمًا عند الفحص بحثًا عن الأخطاء النحوية، لا يستخدم مصمّمو اللغات عادةً آلية عامة كاملة بحسب تورينج للتعبير عن صيغتها النحوية.
بل يستخدمون بدلًا من ذلك نموذج حوسبة <em>مقيَّد</em>.
ومن أكثر الخيارات شيوعًا لمثل هذه النماذج هي <em>القواعد النحوية الخالية من السياق</em>.</p>
<p>لشرح القواعد النحوية الخالية من السياق، لنبدأ بمثال نموذجي.
لنفكّر في الدالة $ARITH:\\Sigma^* \\rightarrow {0,1}$ التي تأخذ كمدخل سلسلة $x$ فوق الأبجدية $\\Sigma = { (,),+,-,\\times,\\div,0,1,2,3,4,5,6,7,8,9}$ وتُعيد $1$ إذا وفقط إذا كانت السلسلة $x$ تمثّل تعبيرًا حسابيًا صحيحًا.
وبصورة حدسية، نبني التعبيرات بتطبيق عملية مثل $+$,$-$,$\\times$ أو $\\div$ على تعبيرات أصغر، أو بإحاطتها بأقواس، حيث تتطابق &quot;الحالة الأساسية&quot; مع التعبيرات التي هي أرقام فحسب.
وبدقة أكبر، يمكننا تقديم التعريفات التالية:</p>
<ul>
<li>
<p><em>الرقم</em> (<em>digit</em>) هو أحد الرموز $0,1,2,3,4,5,6,7,8,9$.</p>
</li>
<li>
<p><em>العدد</em> (<em>number</em>) هو تسلسل من الأرقام. (وللبساطة نُسقط الشرط القاضي بأن لا يبدأ التسلسل بصفر، وإن كان من غير الصعب تشفيره في قاعدة نحوية خالية من السياق أيضًا.)</p>
</li>
<li>
<p><em>العملية</em> (<em>operation</em>) هي إحدى $+,-,\\times,\\div$</p>
</li>
<li>
<p><em>التعبير</em> (<em>expression</em>) إمّا أن يكون على الشكل &quot;number&quot;، أو على الشكل  &quot;sub-expression1 operation sub-expression2&quot;، أو على الشكل &quot;(sub-expression1)&quot;، حيث يكون &quot;sub-expression1&quot; و&quot;sub-expression2&quot; تعبيرين بدورهما. (لاحظ أن هذا تعريف <em>تعاودي</em> (<em>recursive</em>).)</p>
</li>
</ul>
<p>القاعدة النحوية الخالية من السياق (CFG) هي طريقة رسمية لتحديد مثل هذه الشروط.
وتتألف قاعدة CFG من مجموعة من <em>القواعد</em> التي تخبرنا كيف نولّد السلاسل من مكوّنات أصغر.
وفي المثال أعلاه، إحدى القواعد هي: &quot;إذا كان $exp1$ و$exp2$ تعبيرين صحيحين، فإن $exp1 \\times exp2$ هو أيضًا تعبير صحيح&quot;؛ ويمكننا كذلك كتابة هذه القاعدة بالاختصار $expression ; \\Rightarrow ; expression ; \\times ; expression$.
وكما في المثال أعلاه، فإن قواعد أي قاعدة نحوية خالية من السياق غالبًا ما تكون <em>تعاودية</em>: فالقاعدة $expression ; \\Rightarrow; expression ; \\times ; expression$ تُعرِّف التعبيرات الصحيحة في ضوء نفسها.
لنعرّف الآن القواعد النحوية الخالية من السياق تعريفًا رسميًا:</p>
<p>::: {.definition title=&quot;القاعدة النحوية الخالية من السياق&quot; #defcfg}
لتكن $\\Sigma$ مجموعة ما منتهية.
القاعدة النحوية <em>الخالية من السياق (CFG)</em> فوق $\\Sigma$ هي ثلاثية $(V,R,s)$ بحيث:</p>
<ul>
<li>
<p>$V$، وتُعرف بـ_المتغيّرات_ (<em>variables</em>)، هي مجموعة منفصلة عن $\\Sigma$.</p>
</li>
<li>
<p>$s\\in V$ وتُعرف بـ_المتغيّر الابتدائي_ (<em>initial variable</em>).</p>
</li>
<li>
<p>$R$ هي مجموعة من <em>القواعد</em> (<em>rules</em>). كل قاعدة زوج $(v,z)$ حيث $v\\in V$ و$z\\in (\\Sigma \\cup V)^*$. وكثيرًا ما نكتب القاعدة $(v,z)$ على الصورة  $v \\Rightarrow z$ ونقول إن السلسلة $z$ <em>يمكن اشتقاقها</em> (<em>can be derived</em>) من المتغيّر $v$.
:::</p>
</li>
</ul>
<p>::: {.example title=&quot;قاعدة نحوية خالية من السياق للتعبيرات الحسابية&quot; #cfgarithmeticex}
يمكن صياغة المثال أعلاه لتعبيرات حسابية سليمة رسميًا بالقاعدة النحوية الخالية من السياق التالية:</p>
<ul>
<li>
<p>الأبجدية $\\Sigma$ هي  \${ (,),+,-,\\times,\\div,0,1,2,3,4,5,6,7,8,9}$</p>
</li>
<li>
<p>المتغيّرات هي $V = { expression ;,; number ;,; digit ;,; operation }$.</p>
</li>
<li>
<p>القواعد هي المجموعة $R$ التي تحتوي القواعد الـ$19$ التالية:</p>
<ul>
<li>
<p>القواعد الـ$4$: $operation \\Rightarrow +$، و$operation \\Rightarrow -$،  و$operation \\Rightarrow \\times$،  و$operation \\Rightarrow \\div$.</p>
</li>
<li>
<p>القواعد الـ$10$: $digit \\Rightarrow 0$،$\\ldots$، $digit \\Rightarrow 9$.</p>
</li>
<li>
<p>القاعدة $number \\Rightarrow digit$.</p>
</li>
<li>
<p>القاعدة $number \\Rightarrow digit; number$.</p>
</li>
<li>
<p>القاعدة $expression \\Rightarrow number$.</p>
</li>
<li>
<p>القاعدة $expression \\Rightarrow expression ; operation ; expression$.</p>
</li>
<li>
<p>القاعدة $expression \\Rightarrow (expression)$.</p>
</li>
</ul>
</li>
<li>
<p>المتغيّر الابتدائي هو $expression$
:::</p>
</li>
</ul>
<p>يستعمل الناس اصطلاحات كتابة متعددة مختلفة لكتابة القواعد النحوية الخالية من السياق.
ومن أشيع هذه الاصطلاحات هو <a href="https://goo.gl/R4qZji">صيغة Backus–Naur</a>.
في هذا الاصطلاح نكتب قاعدة من الشكل $v \\Rightarrow a$ (حيث $v$ متغيّر و$a$ سلسلة) على الصورة  <code>&lt;v&gt; := a</code>.
ولو كان لدينا عدة قواعد من الشكل $v \\mapsto a$، و$v \\mapsto b$، و$v \\mapsto c$، فيمكننا ضمّها في <code>&lt;v&gt; := a|b|c</code>.
(وبعبارة أخرى نقول إن $v$ يمكن أن تشتقّ إمّا $a$ أو $b$ أو $c$.)
ولنأخذ مثلًا، وصف Backus-Naur للقاعدة النحوية الخالية من السياق في <a href="https://en.wikipedia.org/wiki/ASCII">cfgarithmeticex</a>{.ref} هو كالآتي (باستخدام مقابلات ASCII للعمليات):</p>
<pre><code class="language-python">operation  := +|-|*|/
digit      := <span class="hljs-number">0</span>|<span class="hljs-number">1</span>|<span class="hljs-number">2</span>|<span class="hljs-number">3</span>|<span class="hljs-number">4</span>|<span class="hljs-number">5</span>|<span class="hljs-number">6</span>|<span class="hljs-number">7</span>|<span class="hljs-number">8</span>|<span class="hljs-number">9</span>
number     := digit|digit number
expression := number|expression operation expression|(expression)
</code></pre>
<p>ومثال آخر على قاعدة نحوية خالية من السياق هو قاعدة &quot;الأقواس المتطابقة&quot; (matching parentheses)، ويمكن تمثيلها بصيغة Backus-Naur كما يلي:</p>
<pre><code class="language-python"><span class="hljs-keyword">match</span>  := <span class="hljs-string">&quot;&quot;</span>|<span class="hljs-keyword">match</span> <span class="hljs-keyword">match</span>|(<span class="hljs-keyword">match</span>)
</code></pre>
<p>يمكن توليد سلسلة فوق الأبجدية \${$ <code>(</code>,<code>)</code> $}$ من هذه القاعدة (حيث <code>match</code> هو التعبير الابتدائي و<code>&quot;&quot;</code> يقابل السلسلة الفارغة) إذا وفقط إذا كانت تتألّف من مجموعة أقواس متطابقة.
وبالمقابل، وطبقًا لـ <a href="https://mdaines.github.io/grammophone/">regexpparn</a>{.ref}، لا يوجد تعبير نمطي عادي يطابق سلسلة $x$ إذا وفقط إذا كانت $x$ تحتوي على تسلسل صحيح من الأقواس المتطابقة.</p>
<h3 id="القواعد-النحوية-الخالية-من-السياق-بوصفها-نموذج-حوسبة">القواعد النحوية الخالية من السياق بوصفها نموذج حوسبة</h3>
<p>يمكننا أن نفكّر في قاعدة نحوية خالية من السياق فوق الأبجدية $\\Sigma$ على أنها تعرّف دالة تُسقط كل سلسلة $x$ في $\\Sigma^*$ إلى $1$ أو $0$ بحسب ما إذا كانت $x$ يمكن توليدها بقواعد هذه القاعدة النحوية أم لا.
لنصوغ الآن هذا التعريف رسميًا.</p>
<p>::: {.definition title=&quot;اشتقاق سلسلة من قاعدة نحوية&quot; #CFGderive}
إذا كانت $G=(V,R,s)$ قاعدة نحوية خالية من السياق فوق $\\Sigma$، فإننا لكل سلسلتين $\\alpha,\\beta \\in (\\Sigma \\cup V)^*$ نقول إن $\\beta$ <em>يمكن اشتقاقها في خطوة واحدة</em> من $\\alpha$، ويُرمز لذلك بـ $\\alpha \\Rightarrow_G \\beta$، إذا أمكننا الحصول على $\\beta$ من $\\alpha$ بتطبيق إحدى قواعد $G$. أي أن $\\beta$ تُحصل من $\\alpha$ باستبدال ظهور واحد للمتغيّر $v$ في $\\alpha$ بالسلسلة $z$، حيث $v \\Rightarrow z$ قاعدة من قواعد $G$.</p>
<p>ونقول إن $\\beta$ <em>يمكن اشتقاقها</em> من $\\alpha$، ويُرمز لذلك بـ $\\alpha \\Rightarrow_G^* \\beta$، إذا أمكن اشتقاقها بعدد محدود $k$ من الخطوات.
أي إذا وُجدت $\\alpha_1,\\ldots,\\alpha_{k-1} \\in (\\Sigma \\cup V)^*$ بحيث $\\alpha \\Rightarrow_G \\alpha_1 \\Rightarrow_G \\alpha_2 \\Rightarrow_G \\cdots \\Rightarrow_G \\alpha_{k-1} \\Rightarrow_G \\beta$.</p>
<p>ونقول إن $x\\in \\Sigma^<em>$ <em>مُطابَقة</em> (<em>matched</em>) بواسطة $G=(V,R,s)$ إذا كان بالإمكان اشتقاق $x$ من المتغيّر الابتدائي $s$ (أي إذا كان $s \\Rightarrow_G^</em> x$).
ونعرّف <em>الدالة المحسوبة بواسطة</em> $(V,R,s)$ بأنها الخريطة $\\Phi_{V,R,s}:\\Sigma^* \\rightarrow {0,1}$ بحيث $\\Phi_{V,R,s}(x)=1$ إذا وفقط إذا كانت $x$ مُطابَقة بواسطة $(V,R,s)$.
وتكون الدالة $F:\\Sigma^* \\rightarrow {0,1}$ <em>خالية من السياق</em> (<em>context free</em>) إذا كان $F = \\Phi_{V,R,s}$ لبعض قاعدة CFG من الشكل $(V,R,s)$.^[وكما في حالة <a href="https://en.wikipedia.org/wiki/Chomsky_hierarchy">matchingregexpdef</a>{.ref}، يمكننا أيضًا استعمال اصطلاح <em>اللغة</em> (<em>language</em>) بدلًا من اصطلاح <em>الدالة</em> (<em>function</em>)، ونقول إن لغة $L \\subseteq \\Sigma^*$ <em>خالية من السياق</em> إذا كانت الدالة $F$ التي تحقق $F(x)=1$ إذا وفقط إذا كان $x\\in L$ خالية من السياق.]
:::</p>
<p>قد لا يكون واضحًا في البداية أن الخريطة $\\Phi_{V,R,s}$ قابلة للحساب، غير أنه يتبيّن أن الأمر كذلك.</p>
<blockquote>
<h3 id="theorem-titlequotالقواعد-النحوية-الخالية-من-السياق-تتوقف-دائماquot-cfghalt">{.theorem title=&quot;القواعد النحوية الخالية من السياق تتوقف دائمًا&quot; #CFGhalt}</h3>
</blockquote>
<p>لكل قاعدة CFG $(V,R,s)$ فوق \${0,1}$، الدالة $\\Phi_{V,R,s}:{0,1}^* \\rightarrow {0,1}$ قابلة للحساب.</p>
<p>وكالمعتاد نقتصر على القواعد النحوية فوق \${0,1}$، وإن كان البرهان يمتد إلى أي أبجدية منتهية $\\Sigma$.</p>
<p>::: {.proof #proofofcfghalt data-ref=&quot;CFGhalt&quot;}
سنكتفي بعرض مخطط البرهان.
نبدأ بملاحظة مفادها أننا نستطيع تحويل كل قاعدة CFG إلى نسخة مكافئة في <em>الصيغة النمطية لتشومسكي</em> (<em>Chomsky normal form</em>)، حيث إمّا أن تكون كل القواعد على الشكل $u \\rightarrow vw$ لمتغيّرات $u,v,w$، أو على الشكل $u \\rightarrow \\sigma$ لمتغيّر $u$ ورمز $\\sigma \\in \\Sigma$، بالإضافة على القاعدة المحتملة $s \\rightarrow &quot;&quot;$ حيث $s$ هو المتغيّر الابتدائي.</p>
<p>والفكرة وراء هذا التحويل هي ببساطة إضافة متغيّرات جديدة عند الحاجة، فمثلًا يمكننا ترجمة قاعدة مثل $v \\rightarrow u\\sigma w$ إلى القواعد الثلاث $v \\rightarrow ur$، و$r \\rightarrow tw$، و$t \\rightarrow \\sigma$.</p>
<p>وباستخدام الصيغة النمطية لتشومسكي نحصل على خوارزمية تعاودية طبيعية لحساب ما إذا كان $s \\Rightarrow_G^* x$، بمعطى قاعدة $G$ وسلسلة $x$.
ونكتفي ببسط تجريب جميع الاحتمالات لقاعدة $s \\rightarrow uv$   الأولى المستخدَمة في مثل هذا الاشتقاق، ثم جميع الطرق الممكنة لتقسيم $x$ على صورة سَلسَلة $x=x'x''$.
وإذا خمّنّا القاعدة والتقسيم على نحو صحيح، فإن الأمر ينحصر في الفحص عمّا إذا كان $u \\Rightarrow_G^* x'$ و$v \\Rightarrow_G^* x''$، وهو أمر يمكن إنجازه تعاوديًا (لأنه يتعلق بسلسلات أقصر).
أما الحالات الأساسية (<em>base cases</em>) فهي عندما تكون $x$ فارغة أو رمزًا مفردًا، ويمكن معالجتها بسهولة.
:::</p>
<p>::: {.remark title=&quot;شجرات التحليل&quot; #parsetreesrem}
بينما نركّز على مهمة <em>إقرير القرار</em> (<em>deciding</em>) بشأن ما إذا كانت قاعدة CFG تطابق سلسلة ما، فإن خوارزمية حساب $\\Phi_{V,R,s}$ تقدّم في الحقيقة معلومات أكثر من ذلك.
أي أنها، عند مدخلها سلسلة $x$، إن كان $\\Phi_{V,R,s}(x)=1$، تُنتج تسلسل القواعد التي يمكن تطبيقها ابتداءً من الرأس $s$ للحصول على السلسلة النهائية $x$.
ويمكننا أن نفكّر في هذه القواعد على أنها تحدّد <em>شجرة</em> يكون $s$ <em>جذرها</em> (<em>root</em>)، وتُقابل المصارف (أو <em>الأوراق</em> (<em>leaves</em>)) بها السلاسل الفرعية من $x$ التي نحصل عليها بالقواعد التي لا متغيّر في عنصرها الثاني.
وتُعرف هذه الشجرة باسم <em>شجرة التحليل</em> (<em>parse tree</em>) الخاصة بـ $x$، وهي غالبًا ما تقدّم معلومات مفيدة جدًا عن بنية $x$ .</p>
<p>وكثيرًا ما تكون الخطوة الأولى في مُصرِّف أو مُفسِّر لغة برمجة هي <em>محلّل</em> (<em>parser</em>) يحوّل الشيفرة المصدرية إلى شجرة التحليل (المعروفة أيضًا بـ<a href="https://en.wikipedia.org/wiki/Abstract_syntax_tree">شجرة الصياغة المجردة</a>).
وهناك أيضًا أدوات تستطيع تحويل وصف لقاعدة نحوية خالية من السياق تلقائيًا إلى خوارزمية تحليل تحسب شجرة التحليل لسلسلة معطاة.
(وفعلًا يمكن استعمال الخوارزمية التعاودية أعلاه لتحقيق ذلك، لكن هناك نسخًا أكثر كفؤًا بكثير، ولا سيما للقواعد التي لها <a href="https://en.wikipedia.org/wiki/LR_parser">أشكال معيّنة</a>، وكثيرًا ما يحرص مصمّمو لغات البرمجة على ضمان أن تكون لغاتهم ذات هذه القواعد الأكثر كفؤًا.)
:::</p>
<h3 id="قوة-القواعد-النحوية-الخالية-من-السياق">قوة القواعد النحوية الخالية من السياق</h3>
<p>القواعد النحوية الخالية من السياق قادرة على التقاط كل تعبير نمطي عادي:</p>
<blockquote>
<h3 id="theorem-titlequotالقواعد-النحوية-الخالية-من-السياق-والتعبيرات-النمطية-العاديةquot-cfgreg">{.theorem title=&quot;القواعد النحوية الخالية من السياق والتعبيرات النمطية العادية&quot; #CFGreg}</h3>
</blockquote>
<p>ليكن $e$ تعبيرًا نمطيًا عاديًا فوق \${0,1}$، عندئذ توجد قاعدة CFG $(V,R,s)$ فوق \${0,1}$ بحيث $\\Phi_{V,R,s}=\\Phi_{e}$.</p>
<p>::: {.proof #proofofCFGreg data-ref=&quot;CFGreg&quot;}
نبرهن على النظرية بالاستقراء على طول $e$.
وإذا كان $e$ تعبيرًا من طول بت واحد، فإن $e=0$ أو $e=1$، وفي هذه الحالة نترك للقارئ أن يتحقق من وجود قاعدة CFG (بديهية) تحسبه.
وإلا فإنا نقع في إحدى الحالات التالية: <strong>الحالة 1:</strong> $e = e'e''$، أو <strong>الحالة 2:</strong> $e = e'|e''$، أو <strong>الحالة 3:</strong> $e=(e')^*$، وفي كل الحالات يكون $e',e''$ تعبيرين نمطيين عاديين أقصر.
وبفرض الاستقراء، يمكننا تعريف قاعدتين نحويتين $(V',R',s')$ و$(V'',R'',s'')$ تحسبان على الترتيب $\\Phi_{e'}$ و$\\Phi_{e''}$. وبإعادة تسمية المتغيّرات، يمكننا أيضًا أن نفترض دون فقدان عموميات أن $V'$ و$V''$ منفصلتان.</p>
<p>في الحالة 1، يمكننا تعريف القاعدة الجديدة كما يلي: نضيف متغيّرًا ابتدائيًا جديدًا $s \\not\\in V \\cup V'$ والقاعدة $s \\mapsto s's''$.
وفي الحالة 2، يمكننا تعريف القاعدة الجديدة كما يلي: نضيف متغيّرًا ابتدائيًا جديدًا $s \\not\\in V \\cup V'$ والقاعدتين $s \\mapsto s'$ و $s \\mapsto s''$.
أما الحالة 3 فهي الحالة الوحيدة التي تستعمل <em>التعاود</em> (<em>recursion</em>).
وكما في السابق نضيف متغيّرًا ابتدائيًا جديدًا $s \\not\\in V \\cup V'$، لكننا نضيف الآن القاعدتين $s \\mapsto &quot;&quot;$ (أي السلسلة الفارغة)، ونضيف أيضًا، لكل قاعدة من الشكل $(s',\\alpha) \\in R'$، القاعدة $s \\mapsto s\\alpha$ إلى $R$.</p>
<p>ونترك للقارئ يتحقق كتمرين (تمرين جيد جدًا!) أن القواعد النحوية التي ننتجها في الحالات الثلاث جميعها تلتقط الدالة نفسها التي يلتقطها التعبير الأصلي.
:::</p>
<p>يتبيّن أن قواعد CFG أقوى secara صارم من التعبيرات النمطية العادية.
وبخاصة، كما رأينا، فإن دالة &quot;الأقواس المتطابقة&quot; $MATCHPAREN$ يمكن حسابها بقاعدة نحوية خالية من السياق، في حين أنه، كما هو مبين في <a href="">regexpparn</a>{.ref}، لا يمكن حسابها بالتعبيرات النمطية العادية.
وهذا مثال آخر:</p>
<p>::: {.solvedexercise title=&quot;قاعدة نحوية خالية من السياق للسلاسل المتناظرة&quot; #reversedstringcfg}
لتكن $PAL:{0,1,;}^* \\rightarrow {0,1}$ الدالة المعرَّفة في <a href="">palindromenotreg</a>{.ref} حيث $PAL(w)=1$ إذا وفقط إذا كان $w$ على الشكل $u;u^R$.
عندئذ يمكن حساب $PAL$ بقاعدة نحوية خالية من السياق
:::</p>
<p>::: {.solution data-ref=&quot;reversedstringcfg&quot;}
يمكن وصف قاعدة بسيطة تحسب $PAL$ باصطلاح Backus–Naur:</p>
<pre><code class="language-python">start      := ; | <span class="hljs-number">0</span> start <span class="hljs-number">0</span> | <span class="hljs-number">1</span> start <span class="hljs-number">1</span>
</code></pre>
<p>ويمكن البرهان بالاستقراء أن هذه القاعدة تولّد بالضبط السلاسل $w$ التي تحقق $PAL(w)=1$.
:::</p>
<p>ومثال أكثر إثارة للاهتمام هو حساب السلاسل من الشكل $u;v$ التي <em>ليست</em> متناظرة:</p>
<p>::: {.solvedexercise title=&quot;غير المتناظرات&quot; #nonpalindrome}
برهن على وجود قاعدة نحوية خالية من السياق تحسب $NPAL:{0,1,;}^* \\rightarrow {0,1}$ حيث $NPAL(w)=1$ إذا كان $w=u;v$ ولكن $v \\neq u^R$.
:::</p>
<p>::: {.solution data-ref=&quot;nonpalindrome&quot;}
باستعمال اصطلاح Backus–Naur يمكننا وصف قاعدة من هذا النوع كما يلي</p>
<pre><code class="language-python">palindrome      := ; | <span class="hljs-number">0</span> palindrome <span class="hljs-number">0</span> | <span class="hljs-number">1</span> palindrome <span class="hljs-number">1</span>
different       := <span class="hljs-number">0</span> palindrome <span class="hljs-number">1</span> | <span class="hljs-number">1</span> palindrome <span class="hljs-number">0</span>
start           := different | <span class="hljs-number">0</span> start | <span class="hljs-number">1</span> start | start <span class="hljs-number">0</span> | start <span class="hljs-number">1</span>
</code></pre>
<p>وبعبارة أخرى، فإن هذا يعني أننا يمكننا تمييز سلسلة $w$ تحقق $NPAL(w)=1$ بأنها على الشكل التالي</p>
<p>$$
w = \\alpha b u ; u^R b' \\beta
$$</p>
<p>حيث $\\alpha,\\beta,u$ سلاسل اعتباطية و$b \\neq b'$.
ومن ثم يمكننا توليد سلسلة من هذا النوع بأن نولّد أولًا سلسلة متناظرة $u; u^R$ (المتغيّر <code>palindrome</code>)، ثم نضيف $0$ على أحد الجانبين و$1$ على الجانب المقابل لنحصل على شيء <em>ليس</em> متناظرًا (المتغيّر <code>different</code>)، ثم يمكننا إضافة عدد اعتباطي من $0$ و$1$ على أي من الطرفين (المتغيّر <code>start</code>).
:::</p>
<h3 id="قيود-القواعد-النحوية-الخالية-من-السياق-اختياري">قيود القواعد النحوية الخالية من السياق (اختياري)</h3>
<p>رغم أن القواعد النحوية الخالية من السياق أقوى من التعبيرات النمطية العادية، فإن هناك بعض اللغات البسيطة التي <em>لا</em> تلتقطها القواعد النحوية الخالية من السياق.
وإحدى الأدوات لإظهار ذلك هي نظيرةُ &quot;لمّة الضخّ&quot; (pumping lemma) بالنسبة للقواعد النحوية الخالية من السياق (<a href="">pumping</a>{.ref}):</p>
<blockquote>
<h3 id="theorem-titlequotلمة-الضخ-الخالية-من-السياقquot-cfgpumping">{.theorem title=&quot;لمّة الضخّ الخالية من السياق&quot; #cfgpumping}</h3>
</blockquote>
<p>لتكن $(V,R,s)$ قاعدة CFG فوق $\\Sigma$، عندئذ يوجد عددان $n_0,n_1 \\in \\N$ بحيث لكل $x \\in \\Sigma^*$ مع $|x|&gt;n_0$، إذا كان $\\Phi_{V,R,s}(x)=1$ فإن $x=abcde$ بحيث $|b|+|c|+|d| \\leq n_1$، و$|b|+|d| \\geq 1$، و$\\Phi_{V,R,s}(ab^kcd^ke)=1$ لكل $k\\in \\N$.</p>
<p>::: { .pause }
إن لمّة الضخّ الخالية من السياق أعقد في صياغتها حتى من نظيرتها العادية، لكن يمكنك تذكّرها على أنها تقول ما يلي: <em>&quot;إذا طابقت قاعدة ما سلسلة طويلة بما يكفي، فلا بد أن يكون هناك متغيّر يتكرّر في الاشتقاق.&quot;</em>
:::</p>
<p>::: {.proof #proofofcfgpumping data-ref=&quot;cfgpumping&quot;}
سنكتفي بعرض مخطط البرهان. الفكرة أنه إذا كان مجموع عدد الرموز في قواعد القاعدة النحوية هو $n_0$، فإن الطريقة الوحيدة للحصول على $|x|&gt;n_0$ مع $\\Phi_{V,R,s}(x)=1$ هي استعمال <em>التعاود</em>.
أي أنه لا بد من وجود متغيّر $v \\in V$ بحيث نستطيع أن نشتقّ من $v$ القيمة $bvd$ لبعض السلسلتين $b,d \\in \\Sigma^<em>$، ثم نشتقّ لاحقًا من $v$ بعض السلسلة $c\\in \\Sigma^</em>$ بحيث تكون $bcd$ سلسلة فرعية من $x$ (بعبارة أخرى، $x=abcde$ لبعض $a,e \\in {0,1}^*$). وإذا أخذنا المتغيّر $v$ الذي يحقق هذا الشرط بأقل عدد من خطوات الاشتقاق، فيمكننا أن نضمن أن $|bcd|$ على الأكثر يساوي ثابتًا ما يعتمد على $n_0$، ويمكننا أن نضع $n_1$ مساويًا لذلك الثابت (ويكفي $n_1=10 \\cdot |R| \\cdot n_0$، لأننا لن نحتاج إلى أكثر من $|R|$ تطبيقًا للقواعد، وكل تطبيق من هذا النوع يمكن أن يزيد السلسلة بما لا يتجاوز $n_0$ من الرموز).</p>
<p>وبالتالي، بحكم تعريف القاعدة النحوية، يمكننا تكرار الاشتقاق لاستبدال السلسلة الفرعية $bcd$ في $x$ بـ $b^kcd^k$ لكل $k\\in \\N$ مع الاحتفاظ بخاصية أن مُخرَج $\\Phi_{V,R,s}$ ما زال يساوي واحدًا. وبما أن $bcd$ سلسلة فرعية من $x$، يمكننا كتابة $x=abcde$، ونكون مضمونين أن $ab^kcd^ke$ مُطابَق بالقاعدة النحوية لكل $k$.
:::</p>
<p>باستعمال <a href="">cfgpumping</a>{.ref} يمكن أن نبيّن أن الدالة البسيطة حتى $F:{0,1}^* \\rightarrow {0,1}$ المعرَّفة كما يلي:
$$F(x) = \\begin{cases}1 &amp; x =ww \\text{ for some } w\\in {0,1}^* \\ 0 &amp; \\text{otherwise} \\end{cases}$$
ليست خالية من السياق.
(وبالمقابل، فإن الدالة $G:{0,1}^* \\rightarrow {0,1}$ المعرَّفة بـ $G(x)=1$ إذا وفقط إذا كان $x=w_0w_1\\cdots w_{n-1}w_{n-1}w_{n-2}\\cdots w_0$ لبعض $w\\in {0,1}^*$ و$n=|w|$ هي دالة خالية من السياق؛ هل ترى لماذا؟)</p>
<p>::: {.solvedexercise title=&quot;المساواة ليست خالية من السياق&quot; #equalisnotcfg}
لتكن $EQ:{0,1,;}^* \\rightarrow {0,1}$ الدالة التي تحقق $EQ(x)=1$ إذا وفقط إذا كان $x=u;u$ لبعض $u\\in {0,1}^*$.
عندئذ $EQ$ ليست خالية من السياق.
:::</p>
<p>::: {.solution data-ref=&quot;equalisnotcfg&quot;}
سنستعمل لمّة الضخّ الخالية من السياق.
ولنفرض، طلبًا للتناقض، أنه توجد قاعدة نحوية $G$ تحسب $EQ$، ولتكن $n_0$ الثابت المستحصل عليه من <a href="">cfgpumping</a>{.ref}.</p>
<p>لنأخذ السلسلة $x= 1^{n_0}0^{n_0};1^{n_0}0^{n_0}$، ونكتبها على الصورة $x=abcde$ وفقًا لـ <a href="">cfgpumping</a>{.ref}، بحيث $|bcd| \\leq n_0$ وبحيث $|b|+|d| \\geq 1$.
وطبقًا لـ <a href="">cfgpumping</a>{.ref}، ينبغي أن يتحقق أن $EQ(ace)=1$.
غير أنه يمكن، بتحليل الحالات، أن نبيّن أن هذا يناقض.</p>
<p>أولًا، ما لم تكن $b$ على يسار الفاصل $;$ و$d$ على يمينه، فإن إسقاط $b$ و$d$ سيجعل الجزءين مختلفين على وجه اليقين.
لكن إذا كان الحال أن $b$ على اليسار و$d$ على اليمين، فمن شرط $|bcd| \\leq n_0$ نعرف أن $b$ سلسلة من الأصفار فقط و$d$ سلسلة من الآحاد فقط.
وإذا أسقطنا $b$ و$d$، فإن أحدهما غير فارغ، ومن ثم نحصل على أن عدد الأصفار على اليسار أقل من عددها على اليمين، أو أن عدد الآحاد على اليمين أقل من عددها على اليسار.
وفي الحالتين نحصل على $EQ(ace)=0$، فنحقق التناقض المطلوب.
:::</p>
<h2 id="الخصائص-الدلالية-للغراتم-الخالية-من-السياق">الخصائص الدلالية للغراتم الخالية من السياق</h2>
<p>وكما في حالة التعبيرات النمطية العادية، فإن قيود القواعد النحوية الخالية من السياق توفّر لنا بعض المزايا.
فمثلًا، مسألة فراغية القواعد النحوية الخالية من السياق قابلة لإصدار القرار:</p>
<blockquote>
<h3 id="theorem-titlequotفراغية-قواعد-cfg-قابلة-لإصدار-القرارquot-cfgemptinessthem">{.theorem title=&quot;فراغية قواعد CFG قابلة لإصدار القرار&quot; #cfgemptinessthem}</h3>
</blockquote>
<p>توجد خوارزمية، تعطى كمدخل قاعدة نحوية خالية من السياق $G$، تُخرج $1$ إذا وفقط إذا كانت $\\Phi_G$ هي دالة الصفر الثابت.</p>
<blockquote>
<h3 id="proofidea-data-refquotcfgemptinessthemquot">{.proofidea data-ref=&quot;cfgemptinessthem&quot;}</h3>
</blockquote>
<p>يصير البرهان أوضح إذا حوّلنا القاعدة النحوية إلى الصيغة النمطية لتشومسكي كما في <a href="">CFGhalt</a>{.ref}. وبمعطى قاعدة $G$، يمكننا أن نعرّف تعاوديًا متغيّرًا غير طرفيًا $v$ بأنه <em>غير فارغ</em> (<em>non-empty</em>) إذا كانت هناك قاعدة من الشكل $v \\Rightarrow \\sigma$، أو كانت هناك قاعدة من الشكل $v \\Rightarrow uw$ حيث كل من $u$ و$w$ غير فارغ.
عندئذ تكون القاعدة النحوية غير فارغة إذا وفقط إذا كان المتغيّر الابتدائي $s$ غير فارغ.</p>
<p>::: {.proof data-ref=&quot;cfgemptinessthem&quot;}
نفترض أن القاعدة النحوية $G$ في الصيغة النمطية لتشومسكي كما في <a href="">CFGhalt</a>{.ref}. وننظر في الإجراء التالي لوسم المتغيّرات بأنها &quot;غير فارغة&quot;:</p>
<ol>
<li>
<p>نبدأ بوسم جميع المتغيّرات $v$ التي تظهر في قاعدة من الشكل $v \\Rightarrow \\sigma$ بأنها غير فارغة.</p>
</li>
<li>
<p>ثم نواصل وسم $v$ بأنه غير فارغ إذا كان يظهر في قاعدة من الشكل $v \\Rightarrow uw$ حيث كل من $u,w$ كان قد وُسم قبل ذلك.</p>
</li>
</ol>
<p>نستمر على هذا النحو حتى لا نستطيع وسم أي متغيّر إضافي.
ثم نُعلن أن القاعدة النحوية فارغة إذا وفقط إذا لم يوسم $s$.
ولكي نرى لماذا هذه خوارزمية صحيحة، لاحظ أن إذا وُسم متغيّر $v$ بأنه &quot;غير فارغ&quot; فهناك بعض السلسلة $\\alpha\\in \\Sigma^*$ التي يمكن اشتقاقها من $v$.
ومن جهة أخرى، إذا لم يوسم $v$، فإن كل تسلسل اشتقاقات من $v$ سيحتوي دائمًا على متغيّر لم يستبدل برموز من الأبجدية.
ومن ثم بخاصة تكون $\\Phi_G$ هي دالة الصفر الكلّي إذا وفقط إذا لم يوسم المتغيّر الابتدائي $s$ بأنه &quot;غير فارغ&quot;.
:::</p>
<h3 id="عدم-قابلية-حساب-تكافؤ-القواعد-النحوية-الخالية-من-السياق-اختياري">عدم قابلية حساب تكافؤ القواعد النحوية الخالية من السياق (اختياري)</h3>
<p>تشبيهًا بالتعبيرات النمطية العادية، ربما كان من أملنا الحصول على خوارزمية لتقرير ما إذا كانت قاعدتان نحويتان خاليتان من السياق معطيتان متكافئتين.
للأسف، لا حظ في ذلك. يتبيّن أن مسألة التكافؤ للقواعد النحوية الخالية من السياق <em>غير قابلة للحساب</em>.
وهذا نتيجة مباشرة للنظرية التالية:</p>
<blockquote>
<h3 id="theorem-titlequotكتمال-قواعد-cfg-غير-قابل-للحسابquot-fullnesscfgdef">{.theorem title=&quot;كتمال قواعد CFG غير قابل للحساب&quot; #fullnesscfgdef}</h3>
</blockquote>
<p>لكل مجموعة $\\Sigma$، لتكن $CFGFULL_\\Sigma$ الدالة التي، مع مدخل قاعدة نحوية خالية من السياق $G$ فوق $\\Sigma$، تُخرج $1$ إذا وفقط إذا كانت $G$ تحسب دالة الواحد الثابتة.
عندئذ توجد أبجدية منتهية $\\Sigma$ ما بحيث $CFGFULL_\\Sigma$ غير قابلة للحساب.</p>
<p><a href="">fullnesscfgdef</a>{.ref} يستلزم فورًا أن التكافؤ للقواعد النحوية الخالية من السياق غير قابل للحساب، لأن حساب &quot;كتمال&quot; قاعدة $G$ فوق أبجدية ما $\\Sigma = {\\sigma_0,\\ldots,\\sigma_{k-1} }$ يقابل الفحص عمّا إذا كانت $G$ تكافئ القاعدة النحوية $s \\Rightarrow &quot;&quot;|s\\sigma_0|\\cdots|s\\sigma_{k-1}$.
ولاحظ أن <a href="">fullnesscfgdef</a>{.ref} و<a href="">cfgemptinessthem</a>{.ref} معًا يستلزمان أن القواعد النحوية الخالية من السياق، بخلاف التعبيرات النمطية العادية، <em>غير مغلقة</em> تحت التكملة. (هل ترى لماذا؟)
ولأننا نستطيع ترميز كل عنصر من $\\Sigma$ باستعمال $\\ceil{\\log |\\Sigma|}$ بت (وهذا الترميز المنتهي يمكن إنجازه بسهولة داخل قاعدة نحوية) فإن <a href="">fullnesscfgdef</a>{.ref} يستلزم أن الكتمال غير قابل للحساب أيضًا بالنسبة للقواعد فوق الأبجدية الثنائية.</p>
<p>::: {.proofidea data-ref=&quot;fullnesscfgdef&quot;}
نبرهن على النظرية بالاختزال من مسألة التوقف (Halting problem).
ولنحقق ذلك نستعمل مفهوم <em>التكوينات</em> (<em>configurations</em>) لبرامج NAND-TM، كما هو معرَّف في <a href="">configtmdef</a>{.ref}.
وتذكّر أن <em>تكوين</em> برنامج $P$ هو سلسلة ثنائية $s$  تُرمِّز كل المعلومات عن البرنامج في التكرار الحالي.</p>
<p>نعرِّف $\\Sigma$ لتكون \${0,1}$ إضافة إلى بعض رموز الفاصل، ونعرِّف $INVALID_P:\\Sigma^* \\rightarrow {0,1}$ لتكون الدالة التي تُسقط كل سلسلة $L\\in \\Sigma^*$ إلى $1$ إذا وفقط إذا كانت $L$ <em>لا</em> تُرمِّز تسلسل تكوينات يطابق تاريخ توقف صحيحًا لحساب $P$ على المدخل الفارغ.</p>
<p>وقلب البرهان هو أن نبيّن أن $INVALID_P$ خالية من السياق. وبمجرد أن نفعل ذلك نرى أن $P$ تتوقف على المدخل الفارغ إذا وفقط إذا كان $INVALID_P(L)=1$ لكل $L$.
ولإثبات ذلك، سنُرمِّز القائمة بطريقة خاصة تجعلها قابلة لإصدار القرار بواسطة قاعدة نحوية خالية من السياق.
وتحديدًا سنعكس كل السلاسل ذات الأرقام الفردية.
:::</p>
<p>::: {.proof data-ref=&quot;fullnesscfgdef&quot;}
سنكتفي بعرض مخطط البرهان.
سنبيّن أنه إذا استطعنا حساب $CFGFULL$ أمكّننا حل مسألة $HALTONZERO$، وقد ثُبت في <a href="">haltonzero-thm</a>{.ref} أنها غير قابلة للحساب.
ولتكن $M$ آلة تورينج مدخل لـ $HALTONZERO$. وسنستعمل مفهوم <em>التكوينات</em> (<em>configurations</em>) لآلة تورينج، كما هو معرَّف في <a href="">configtmdef</a>{.ref}.</p>
<p>وتذكّر أن <em>تكوين</em> آلة تورينج $M$ على المدخل $x$ يلتقط الحالة الكاملة لـ $M$ عند بعض نقاط الحساب.
وتفاصيل التكوينات ليست مهمة إلى هذا الحد، لكن ما عليك تذكّره هو:</p>
<ul>
<li>
<p>يمكن ترميز التكوين بسلسلة ثنائية $\\sigma \\in {0,1}^*$.</p>
</li>
<li>
<p><em>التكوين الابتدائي</em> (<em>initial</em>) لـ $M$ على المدخل $0$ هو سلسلة ثابتة ما.</p>
</li>
<li>
<p>سيحمل <em>تكوين التوقف</em> (<em>halting configuration</em>) القيمة $1$ في حالة معيّنة (يمكن &quot;قراءتها&quot; منه بسهولة).</p>
</li>
<li>
<p>إذا كان $\\sigma$ تكوينًا عند خطوة ما $i$ من الحساب، فإننا نرمّز بـ $NEXT_M(\\sigma)$ التكوين عند الخطوة التالية. و$NEXT_M(\\sigma)$ سلسلة تتفق مع $\\sigma$ في جميع الإحداثيات عدا عدد ثابت منها (تلك التي تُرمِّز الموضع المقابل لموضع الرأس والموضعين المجاورين له). وعلى تلك الإحداثيات يمكن حساب قيمة $NEXT_M(\\sigma)$ بدالة منتهية ما.</p>
</li>
</ul>
<p>سنجعل الأبجدية $\\Sigma = {0,1} \\cup { | , # }$.
و_تاريخ الحساب_ (<em>computation history</em>) لـ $M$ على المدخل $0$ هو سلسلة $L\\in \\Sigma$ تقابل قائمة $| \\sigma_0 # \\sigma_1 | \\sigma_2 # \\sigma_3 \\cdots \\sigma_{t-2} | \\sigma_{t-1} #$ (أي أن $|$ تسبق كتلة ذات رقم زوجي، و$#$ تسبق كتلة ذات رقم فردي) بحيث إذا كان $i$ زوجيًا تكون $\\sigma_i$ هي السلسلة التي تُرمِّز تكوين $P$ على المدخل $0$ في بداية تكراره $i$-th، وإذا كان $i$ فرديًا يكون الأمر كذلك باستثناء أن السلسلة <em>معكوسة</em>.
(أي أن، من أجل $i$ فردي، تُرمِّز $rev(\\sigma_i)$ تكوين $P$ على المدخل $0$ في بداية تكراره $i$-th.)
وعكس الكتل ذات الأرقام الفردية هو حيلة تقنية تضمن أن الدالة $INVALID_M$ التي سنعرّفها أدناه تكون خالية من السياق.</p>
<p>ولنعرّف الآن $INVALID_M:\\Sigma^* \\rightarrow {0,1}$ كما يلي:</p>
<p>$$INVALID_M(L) = \\begin{cases}0 &amp; \\text{$L$ is a valid computation history of $M$ on $0$} \\
1 &amp; \\text{otherwise} \\end{cases}
$$</p>
<p>وسنبيّن الدعوى التالية:</p>
<p><strong>الدعوى:</strong> $INVALID_M$ خالية من السياق.</p>
<p>والدعوى تستلزم النظرية. وبما أن $M$ تتوقف على $0$ إذا وفقط إذا كان هناك تاريخ حساب صحيح، فإن $INVALID_M$ هي دالة الواحد الثابتة إذا وفقط إذا كانت $M$ <em>لا</em> تتوقف على $0$.
وبخاصة، هذا يتيح لنا اختزال تحديد ما إذا كانت $M$ تتوقف على $0$ في تحديد ما إذا كانت القاعدة النحوية $G_M$ المقابلة لـ $INVALID_M$ كاملة.</p>
<p>ولننتقل الآن إلى برهان الدعوى.
لن نبيّن كل التفاصيل، لكن النقطة الأساسية هي أن $INVALID_M(L)=1$ إذا تحققت <em>واحدة على الأقل</em> من الشروط الثلاثة التالية:</p>
<ol>
<li>
<p>$L$ ليست على الصيغة الصحيحة، أي أنها ليست من الشكل $\\langle \\text{binary-string} \\rangle #  \\langle \\text{binary-string} \\rangle | \\langle \\text{binary-string} \\rangle # \\cdots$.</p>
</li>
<li>
<p>تحتوي $L$ على سلسلة فرعية من الشكل $| \\sigma # \\sigma' |$ بحيث $\\sigma' \\neq rev(NEXT_P(\\sigma))$</p>
</li>
<li>
<p>تحتوي $L$ على سلسلة فرعية من الشكل $# \\sigma | \\sigma' #$ بحيث $\\sigma' \\neq NEXT_P(rev(\\sigma))$</p>
</li>
</ol>
<p>وبما أن الدوال الخالية من السياق مغلقة تحت عملية OR، فإن الدعوى تتبع إذا بيّنا أننا نستطيع التحقق من الشروط 1 و2 و3 بواسطة قاعدة نحوية خالية من السياق.</p>
<p>بالنسبة للشرط 1 فالأمر بسيط جدًا: فحص أن $L$ <em>هي</em> على الصيغة الصحيحة يمكن إنجازه باستعمال تعبير نمطي عادي.
وبما أن التعبيرات النمطية العادية مغلقة تحت النفي، فإن هذا يعني أن فحص أن $L$ <em>ليست</em> على هذه الصيغة يمكن أيضًا إنجازه بتعبير نمطي عادي، وبالتالي بقاعدة نحوية خالية من السياق.</p>
<p>أما الشرطان 2 و3 فيتبعان بواسطة استدلال مشابه جدًا للاستدلال الذي يبيّن أن الدالة $F$ التي تحقق $F(u#v)=1$ إذا وفقط إذا كان $u \\neq rev(v)$ خالية من السياق؛ انظر <a href="">nonpalindrome</a>{.ref}.
فبعد كل شيء، فإن دالة $NEXT_M$ لا تعدّل مدخلها إلا في عدد ثابت من المواضع. ونترك استكمال التفاصيل تمرينًا للقارئ.
وبما أن $INVALID_M(L)=1$ إذا وفقط إذا كانت $L$ تحقق أحد الشروط 1 أو 2 أو 3، وبما أنه يمكن اختبار الشروط الثلاثة جميعها بواسطة قاعدة نحوية خالية من السياق، فإن هذا يُكمل برهان الدعوى وبالتالي النظرية.
:::</p>
<h2 id="ملخص-الخصائص-الدلالية-للتعبيرات-النمطية-العادية-والقواعد-النحوية-الخالية-من-السياق">ملخّص الخصائص الدلالية للتعبيرات النمطية العادية والقواعد النحوية الخالية من السياق</h2>
<p>ولتلخيص القول، يمكننا كثيرًا أن نُبدِّل <em>القوة التعبيرية</em> (<em>expressiveness</em>) للنموذج بـ_قابليته للتحليل_ (<em>amenability to analysis</em>).
فإذا أخذنا في الحسبان نماذج حوسبة <em>غير</em> كاملة بحسب تورينج، فإننا نستطيع أحيانًا تجاوز نظرية Rice والإجابة على أسئلة دلالية معينة عن البرامج في مثل هذه النماذج.
وفيما يلي ملخّص لبعض ما هو معروف عن الأسئلة الدلالية بالنسبة للنماذج المختلفة التي رأيناها.</p>
<pre><code class="language-table">---
caption: 'Computability of semantic properties'
alignment: ''
table-width: ''
id: semantictable
---
_Model_, **Halting**, **Emptiness**, **Equivalence**
_Regular expressions_, Computable, Computable,Computable
_Context free grammars_, Computable, Computable, Uncomputable
_Turing-complete models_, Uncomputable, Uncomputable, Uncomputable
</code></pre>
<blockquote>
<h3 id="recap">{ .recap }</h3>
</blockquote>
<ul>
<li>عدم قابلية مسألة التوقف للنماذج العامة للحساب هو ما يحفّز على تعريف نماذج الحوسبة المقيَّدة.</li>
<li>في بعض النماذج المقيَّدة يمكننا الإجابة على أسئلة <em>دلالية</em> (<em>semantic</em>)، مثل: هل ينتهي برنامج معطى؟ وهل يحسب برنامجان الدالة نفسها؟</li>
<li><em>التعبيرات النمطية العادية</em> نموذج حوسبة مقيَّد غالبًا ما يكون مفيدًا في التعبير عن مهام مطابقة السلاسل. يمكننا اختبار ما إذا كان تعبير ما يطابق سلسلة بكفاءة، وكذلك الإجابة عن أسئلة مثل التوقف والتكافؤ.</li>
<li><em>القواعد النحوية الخالية من السياق</em> نموذج حوسبة أقوى، لكنه مع ذلك ليس كاملًا بحسب تورينج. مسألة التوقف للقواعد النحوية الخالية من السياق قابلة للحساب، في حين أن التكافؤ غير قابل للحساب.</li>
</ul>
<div class="exercises"><h2 id="التمارين">التمارين</h2>
<p>::: {.exercise title=&quot;خصائص الإغلاق للدوال الخالية من السياق&quot; #closurecfgex}
لنفترض أن $F,G:{0,1}^* \\rightarrow {0,1}$ خاليتان من السياق. بالنسبة لكل تعريف من تعريفات الدالة $H$ التالية، برهن إما على أن $H$ خالية من السياق دائمًا، أو أعطِ مثالًا مضادًا لدالتين نمطيتين عاديتين $F,G$ يجعلان $H$ ليست خالية من السياق.</p>
<ol>
<li>
<p>$H(x) = F(x) \\vee G(x)$.</p>
</li>
<li>
<p>$H(x) = F(x) \\wedge G(x)$</p>
</li>
<li>
<p>$H(x) = NAND(F(x),G(x))$.</p>
</li>
<li>
<p>$H(x) = F(x^R)$ حيث $x^R$ هو عكس $x$: $x^R = x_{n-1}x_{n-2} \\cdots x_o$ من أجل $n=|x|$.</p>
</li>
<li>
<p>$H(x) = \\begin{cases}1 &amp; x=uv \\text{ s.t. } F(u)=G(v)=1 \\  0 &amp; \\text{otherwise} \\end{cases}$</p>
</li>
<li>
<p>$H(x) = \\begin{cases}1 &amp; x=uu \\text{ s.t. } F(u)=G(u)=1 \\  0 &amp; \\text{otherwise} \\end{cases}$</p>
</li>
<li>
<p>$H(x) = \\begin{cases}1 &amp; x=uu^R \\text{ s.t. } F(u)=G(u)=1 \\  0 &amp; \\text{otherwise} \\end{cases}$
:::</p>
</li>
</ol>
<p>::: {.exercise  #noncontextfreeex}
برهن على أن الدالة $F:{0,1}^* \\rightarrow {0,1}$ التي تحقق $F(x)=1$ إذا وفقط إذا كان $|x|$ قوة للعدد اثنين ليست خالية من السياق.
:::</p>
<p>::: {.exercise title=&quot;صياغة لغات البرمجة&quot; #proglanguagecfgex}
لنفكّر في الصياغة التالية لـ&quot;لغة برمجة&quot; يمكن كتابة شيفرتها المصدرية باستعمال مجموعة محارف <a href="https://en.wikipedia.org/wiki/ASCII">ASCII</a>:</p>
<ul>
<li>
<p>تُحصل <em>المتغيّرات</em> (<em>variables</em>) على تسلسل من الحروف والأرقام والشرطات، لكن لا يمكن أن تبدأ برقم.</p>
</li>
<li>
<p><em>التعبير البرمجي</em> (<em>statement</em>) هو إمّا على الشكل <code>foo = bar;</code> حيث <code>foo</code> و<code>bar</code> متغيّرات، أو على الشكل  <code>IF (foo) BEGIN ... END</code> حيث <code>...</code> هي قائمة تضم عبارة برمجية واحدة أو أكثر، يحتمل أن تفصل بينها أسطر جديدة.</p>
</li>
</ul>
<p>والبرنامج (<em>program</em>) في لغتنا هو ببساطة تسلسل من العبارات البرمجية (قد تفصل بينها أسطر جديدة أو مسافات).</p>
<ol>
<li>
<p>لتكن $VAR:{0,1}^* \\rightarrow {0,1}$ الدالة التي، معطى سلسلة $x\\in {0,1}^*$, تُخرج $1$ إذا وفقط إذا كانت $x$ تقابل ترميز ASCII لمعرّف متغيّر صحيح. برهن على أن $VAR$ نمطية عادية.</p>
</li>
<li>
<p>لتكن $SYN:{0,1}^* \\rightarrow {0,1}$ الدالة التي، معطى سلسلة $s \\in {0,1}^*$, تُخرج $1$ إذا وفقط إذا كانت $s$ هي ترميز ASCII لبرنامج صحيح بلغتنا. برهن على أن $SYN$ خالية من السياق. (لا يلزمك تحديد القاعدة النحوية الرسمية الكاملة لـ $SYN$، لكن عليك أن تُبيّن أن قاعدة من هذا النوع موجودة.)</p>
</li>
<li>
<p>برهن على أن $SYN$ ليست عادية نمطيًا. انظر الحاشية للتلميح^[حاول أن ترى إن كنت تستطيع &quot;تضمين&quot; دالة تشبه $MATCHPAREN$ في $SYN$ لتتمكن من استعمال برهان مشابه. وطبعًا، لكي تكون الدالة غير عادية نمطيًا، ليس عليها أن تستعمل رموز أقواس حرفية بالضرورة.]
:::</p>
</li>
</ol>
<h2 id="ملاحظات-مرجعية">ملاحظات مرجعية</h2>
<p>وكما في حالة التعبيرات النمطية العادية، تتوفر موارد كثيرة تتناول القواعد النحوية الخالية من السياق بتفصيل كبير.
فالفصل 2 من [@SipserBook] يحتوي على أمثلة كثيرة للقواعد النحوية الخالية من السياق وخصائصها.
وهناك أيضًا مواقع مثل <a href="https://mdaines.github.io/grammophone/">Grammophone</a> حيث يمكنك إدخال قواعد نحوية ومعرفة السلاسل التي تولّدها، فضلًا عن بعض الخصائص التي تحقّقها.</p>
<p>وتُستعمل صفة &quot;الخلية من السياق&quot; للقواعد النحوية الخالية من السياق لأن قاعدة من الشكل $v \\mapsto a$ تعني أننا نستطيع <em>دائمًا</em> استبدال $v$ بالسلسلة $a$، بغضّ النظر عن <em>السياق</em> (<em>context</em>) الذي تظهر فيه $v$.
وبشكل أعم، ربما أردنا النظر في الحالات التي تعتمد فيها قواعد الاستبدال على السياق.
وهذا ينشئ مفهوم <em>القواعد العامة (أو &quot;النوع 0&quot;)</em> (<em>general (aka &quot;Type 0&quot;) grammars</em>) التي تسمح بقواعد من الشكل $a \\Rightarrow b$ حيث كل من $a$ و$b$ سلسلتان فوق $(V \\cup \\Sigma)^*$.
والفكرة أنه إذا أردنا مثلًا فرض الشرط بأن لا نطبّق قاعدة مثل $v \\mapsto 0w1$ إلا عندما تكون $v$ محاطة بثلاثة أصفار على كل جانب، فيمكننا فعل ذلك بإضافة قاعدة من الشكل $000v000 \\mapsto 0000w1000$ (ويمكننا بالطبع إضافة شروط أكثر عمومية بكثير).
وللأسف، يأتي هذا العمومية بثمن - فالقواعد العامة كاملة بحسب تورينج، وبالتالي فإن مسألة التوقف الخاصة بها غير قابلة للحساب.
أي أنه لا توجد خوارزمية $A$ تستطيع تحديد، لكل قاعدة عامة $G$ وسلسلة $x$، ما إذا كانت القاعدة $G$ تولّد $x$ أم لا.</p>
<p>و[تسلسل تشومسكي] (<a href="https://en.wikipedia.org/wiki/Chomsky_hierarchy">Chomsky Hierarchy</a>) هو تسلسل هرمي للقواعد النحوية، يبدأ من أقل القواعد تقييدًا (وأقواها) وهي قواعد النوع 0 التي تقابل اللغات <em>المُعدودة تكراريًا</em> (<em>recursively enumerable</em>) (انظر <a href="">recursiveenumerableex</a>{.ref})، وصولًا إلى أكثر القواعد تقييدًا وهي قواعد النوع 3 التي تقابل اللغات النمطية العادية.
وتقابل اللغات الخالية من السياق قواعد النوع 2.
وقواعد النوع 1 هي <em>القواعد النحوية الحسّاسة للسياق</em> (<em>context sensitive grammars</em>).
وهذه أقوى من القواعد النحوية الخالية من السياق لكنها مع ذلك أضعف من آلات تورينج.
وبخاصة، فإن الدوال/اللغات المقابلة للقواعد الحسّاسة للسياق تكون دائمًا قابلة للحساب، بل fact أنها يمكن حسابها بواسطة [آلات محدودة خطيًا] (https://en.wikipedia.org/wiki/Linear_bounded_automaton) وهي خوارزميات غير حتمية تستهلك $O(n)$ من المساحة.
ولهذا السبب فإن صف الدوال/اللغات المقابلة للقواعد الحسّاسة للسياق يُعرف أيضًا بـ $\\mathbf{NSPACE}O(n)$؛ ونناقش التعقيد المقيّد بالمساحة في <a href="">spacechap</a>{.ref}).
وفي حين أن نظرية Rice تستلزم أننا لا نستطيع حساب أي خاصية دلالية غير تافهة لقواعد النوع 0، فإن الوضع أعقد بالنسبة لأنواع القواعد الأخرى: فبعض الخصائص الدلالية يمكن تحديدها وبعضها لا يمكن، بحسب موقع القاعدة في التسلسل الهرمي.</p>
</div>`,s={book:e,chapter:n,chapterTitle:$,slug:t,title:i,headings:a,html:o};export{e as book,n as chapter,$ as chapterTitle,s as default,a as headings,o as html,t as slug,i as title};
