const p="ahastack",e="how-we-got-here",o="كيف وصلنا إلى هنا",t="index",a="كيف وصلنا إلى هنا",n=[],c=`<p>لسنوات وسنوات ونحن نبني تطبيقات الويب (Web Applications) بالاعتماد على HTML القديم الجيّد المُعرض على الخادم (server-rendered HTML)، باستعمال منصّة الويب (Web Platform) كما قُصد لها. روابط للتنقّل إلى صفحات أخرى، ونماذج (forms) لإرسال البيانات إلى الخادم، فيعالج الخادم البيانات ويعيد صفحةً جديدة بالبيانات المحدَّثة.</p>
<p>الويب، الذي وُجد في الأصل وسيلةً لقراءة الأشياء والنقر على الروابط لقراءة أشياء أخرى، وجد نفسه في هذا الموقف الحلو حيث أراد الناس استعماله في أمور أكثر.</p>
<p>احتاج الناس إلى بناء واجهات مستخدم أعقد.</p>
<p>فصنع الناس تقنيات إضافية لجعل ذلك ممكنًا.</p>
<p>إحدى التقنيات التي لقيت رواجًا هي AJAX. فقدّمتها Microsoft مع IE، وأتاحت بناء تطبيقات مثل Gmail و Google Maps، وهي أمور نعدّها اليوم طبيعية، لكنها كانت نقلةً نوعية في زمن إطلاقها.</p>
<p>يعني AJAX أننا نتمكّن من إرسال طلب إلى عنوان URL باستعمال JavaScript والحصول على بعض البيانات في المقابل. وباستعمال JavaScript، استطعنا إضافة هذه البيانات الجديدة إلى الصفحة. رائع. كان الأمر معقّدًا بعض الشيء في البداية، لكن مكتبات مثل jQuery قدّمت واجهات برمجية (APIs) جيّدة مثل <code>$.ajax()</code> أو <code>$.post()</code> للتعامل مع هذا الأسلوب. وأنا الآن أشعر بالحنين إلى تلك الأيام.</p>
<p>لكن في مرحلة ما أصبحت JavaScript قويّةً جدًّا، وأصبحت الحواسيب سريعةً جدًّا، فبدأت فكرة أخرى في الظهور: ماذا لو أنشأنا تطبيق JavaScript يعمل داخل المتصفّح، ومهمّته تصيير HTML يعرضه المتصفّح للمستخدم؟</p>
<p>وهكذا انتهينا إلى أشياء مثل React.</p>
<p>لم تكن React الأولى (ومن أولى ما نتذكّره Backbone و Ember و Knockout..) لكنها في النهاية كانت الأكثر نجاحًا.</p>
<p>إذن لنلخّص، انتقلت تطبيقات الويب من معمارية عميل-خادم (Client-Server) يكون فيها العميل «غبيًّا» ومسؤولًا عن عرض HTML الذي يرسله الخادم فحسب، إلى أن صارت «ذكيّة» وتُشغّل تطبيقات كاملة داخل نافذة.</p>
<p>ما زلت تحتاج خادم ويب (Web Server) مسؤولًا عن إرسال البيانات، عادةً بصيغة JSON، وهي صيغة بيانات مُسلسَلة تشبه JavaScript وحظيت بشعبية هائلة، وعن طريق معالجة الإجراءات وتعديل البيانات، مثلًا بالتواصل مع قاعدة بيانات.</p>
<p>معظم المواقع التي تستعملها هي تطبيقات.</p>
<p>وبعض تلك التطبيقات معقّد جدًّا. فعلى سبيل المثال أفكّر في Figma، وأشياء مثل Photopea و Google Maps التي ذكرناها من قبل، وحتى محرّرات الفيديو مثل Descript، فهي تعمل كليًا داخل المتصفّح.</p>
<p>لن تكون تلك التطبيقات ممكنة من دون كمٍ هائل من شيفرة JavaScript التي تعمل في جهة العميل. إنه شيء لا يُصدّق ما نستطيع فعله.</p>
<p>لكن معظم التطبيقات التي أبنيها، وأنت أيضًا تبنيها، ليست على هذا المستوى.</p>
<p>قد يكون لديك مسار تسجيل دخول (login workflow)، وبعض النماذج، وإدخال بيانات من قِبل المستخدمين، وعرض بيانات، وهكذا وهكذا، لكنها ليست معقّدة بطبيعتها.</p>
<p>إنها مجرّد تطبيقات CRUD.</p>
<p>وأسلوب تطبيقات الصفحة الواحدة (SPA) الحديث أكثر من اللازم بالنسبة إليها.</p>
`,r={book:p,chapter:e,chapterTitle:o,slug:t,title:a,headings:n,html:c};export{p as book,e as chapter,o as chapterTitle,r as default,n as headings,c as html,t as slug,a as title};
