const n="database-foundations",i="sql-pgadmin",a="تثبيت pgAdmin",e="index",t="تثبيت pgAdmin",s=[{depth:2,id:"الاتصال-بخادم-قاعدة-البيانات",text:"الاتصال بخادم قاعدة البيانات"},{depth:2,id:"تثبيت-pgadmin",text:"تثبيت pgAdmin"}],d=`<blockquote>
<p>الرجل لا شيء بدون أدواته. —Kathy Reichs</p>
</blockquote>
<p>في هذا الفصل، ستثبّت pgadmin وتضبط الاتصالات بخادم قاعدة البيانات. ويتضمن ذلك قدرًا لا بأس به من الإعدادات. وكثير من الأمور يمكن أن تسوء (وستسوء)، لكن لا تقلق: نحن هنا للمساعدة.</p>
<h2 id="الاتصال-بخادم-قاعدة-البيانات">الاتصال بخادم قاعدة البيانات</h2>
<p>من الممكن تثبيت برمجيات قواعد البيانات على حاسوبك المحمول. غير أنه بالنسبة للتطبيقات الأكبر، يُستخدم عادةً <em>خادم قاعدة بيانات</em> يشغّل البرمجيات. وكل من يحتاج إلى استخدام قاعدة البيانات المخزّنة على الخادم (سواء كانوا بشرًا أو برمجيات...) يتصل حينئذ بالخادم باستخدام قطعة من البرمجيات. وفي هذه الدورة سنستخدم خادم PostgreSQL. وتتواصل مع الخادم عبر <em>عميل</em>. وهناك عشرات العملاء. وفي هذه الدورة سنستخدم اثنين منهما: pgAdmin وDBSchema. وفي الدروس الأولى سيكون pgAdmin كافيًا.</p>
<p>ويوضح الشكل أدناه كيف لا يتفاعل العميل مباشرة أبدًا مع البيانات نفسها، بل يتفاعل دائمًا عبر خادم قاعدة بيانات (<a href="https://medium.datadriveninvestor.com/artificial-intelligence-series-part-5-data-analysis-using-sql-7e61bee24b85">شكل المصدر</a>).</p>
<p><img src="/arabic-cs-library/images/database-foundations/sql-pgadmin-0-rdbms.webp" alt="العلاقة بين العميل والخادم في قواعد البيانات، المصدر: https://medium.datadriveninvestor.com/artificial-intelligence-series-part-5-data-analysis-using-sql-7e61bee24b85"></p>
<h2 id="تثبيت-pgadmin">تثبيت pgAdmin</h2>
<p>اتبع الخطوات في المستند <a href="https://df.webontwerp.ucll.be/assets/PDF/manual.pdf">&quot;manual.pdf&quot;</a>. ويصف هذا الدليل بالتفصيل كيفية تثبيت pgAdmin وكيفية ضبط ثلاثة اتصالات بخادم قاعدة البيانات داخل pgAdmin. ويعرض الفيديو أدناه خطوات الدليل لسنة دراسية سابقة (لذا تختلف أرقام الاتصالات)، لكن الخطوات تبقى كما هي.</p>
<p>بعد تنفيذ جميع الخطوات، ينبغي أن تكون لديك ثلاثة اتصالات بقاعدة البيانات:</p>
<ul>
<li>الاتصال عبر المنفذ 54321 يبقى كما هو كل عام. وهنا ستجد عددًا من قواعد البيانات الأساسية التي يمكن استخدامها على مدى عدة سنوات دراسية.</li>
<li>والاتصال الثاني، عبر المنفذ 50203، يُحدَّث كل عام. وعبر هذا الاتصال تصل، من بين أمور أخرى، إلى قاعدة بيانات صفك حيث يمكنك إنشاء مخططاتك الجديدة.</li>
<li>وأخيرًا، هناك اتصال ثالث يستخدم التجميع: 60203. ويمنح هذا الاتصال إمكانية الوصول إلى ما يتيحه المنفذ 50203 بالضبط، لكن بطريقة أذكى بحيث لا تنفد اتصالاتك أبدًا. <em>وفي الممارسة العملية، استخدم دائمًا اتصال التجميع هذا.</em></li>
</ul>
`,p={book:n,chapter:i,chapterTitle:a,slug:e,title:t,headings:s,html:d};export{n as book,i as chapter,a as chapterTitle,p as default,s as headings,d as html,e as slug,t as title};
