const t="nand2tetris-1",d="project02",n="المشروع 2: الحساب البولياني",e="index",r="المشروع 2: الحساب البولياني",h=[{depth:2,id:"المشروع-2-الحساب-البولياني",text:"المشروع 2: الحساب البولياني"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"الهدف",text:"الهدف"},{depth:3,id:"الشرائح",text:"الشرائح"},{depth:3,id:"العقد",text:"العقد"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"نصائح",text:"نصائح"}],p=`<h2 id="المشروع-2-الحساب-البولياني">المشروع 2: الحساب البولياني</h2>
<h3 id="خلفية">خلفية</h3>
<p>محور معمارية الحاسوب هو CPU، أو وحدة المعالجة المركزية، ومحور CPU هو ALU، أو الوحدة الحسابية المنطقية. في هذا المشروع ستبني تدريجيًا مجموعة من الشرائح، تتوّج ببناء شريحة ALU لحاسوب Hack. جميع الشرائح المبنية في هذا المشروع قياسية، فيما عدا ALU ذاتها، التي تختلف من معمارية حاسوب إلى أخرى.</p>
<h3 id="الهدف">الهدف</h3>
<p>ابنِ جميع الشرائح الموصوفة في الفصل 2 (انظر القائمة أدناه)، وصولاً إلى وحدة حسابية منطقية - ALU حاسوب Hack. لبنات البناء الوحيدة التي يمكنك استخدامها هي الشرائح الموصوفة في الفصل 1 والشرائح التي ستبنيها تدريجيًا في هذا المشروع.</p>
<h3 id="الشرائح">الشرائح</h3>
<table>
<thead>
<tr>
<th>اسم الشريحة</th>
<th>الوصف</th>
</tr>
</thead>
<tbody>
<tr>
<td>HalfAdder</td>
<td>نصف جامع</td>
</tr>
<tr>
<td>FullAdder</td>
<td>جامع كامل</td>
</tr>
<tr>
<td>Add16</td>
<td>جامع بـ 16 بت</td>
</tr>
<tr>
<td>Inc16</td>
<td>مُزايد بـ 16 بت</td>
</tr>
<tr>
<td>ALU</td>
<td>وحدة حسابية منطقية (دون معالجة مخرجات الحالة)</td>
</tr>
<tr>
<td>ALU</td>
<td>وحدة حسابية منطقية (كاملة)</td>
</tr>
</tbody>
</table>
<table>
<thead>
<tr>
<th>سكربتات الاختبار</th>
<th>ملف المقارنة</th>
</tr>
</thead>
<tbody>
<tr>
<td>HalfAdder.tst</td>
<td>HalfAdder.cmp</td>
</tr>
<tr>
<td>FullAdder.tst</td>
<td>FullAdder.cmp</td>
</tr>
<tr>
<td>Add16.tst</td>
<td>Add16.cmp</td>
</tr>
<tr>
<td>Inc16.tst</td>
<td>Inc16.cmp</td>
</tr>
<tr>
<td>ALU-nostat.tst</td>
<td>ALU-nostat.cmp</td>
</tr>
<tr>
<td>ALU.tst</td>
<td>ALU-nostat.cmp</td>
</tr>
</tbody>
</table>
<h3 id="العقد">العقد</h3>
<p>عند تحميل تصميم شريحتك (برنامج .hdl معدَّل) في محاكي العتاد (Hardware Simulator) المُرفق، واختباره باستخدام سكربت .tst المُرفق، يجب أن يُنتج المخرجات المدرَجة في ملف .cmp المُرفق. إذا لم يكن الأمر كذلك، فسأُبلغك المحاكي بذلك.</p>
<h3 id="الموارد">الموارد</h3>
<p>انظر <a href="https://www.nand2tetris.org/_files/ugd/44046b_89c60703ebfc4bf39acef13bdc050f5d.pdf">الفصل 2</a>، و<a href="https://drive.google.com/file/d/1dPj4XNby9iuAs-47U9k3xtYy9hJ-ET0T/view?usp=sharing">دليل HDL</a> (باستثناء A2.4)، و<a href="https://drive.google.com/file/d/1IsDnH0t7q_Im491LQ7_5_ajV0CokRbwR/view?usp=sharing">مجموعة شرائح Hack</a>.</p>
<p>نوفّر لكل شريحة ملف .hdl هيكلي ينقصه جزء التنفيذ. وبالإضافة إلى ذلك، نوفّر لكل شريحة سكربت .tst يوجّه محاكي العتاد إلى كيفية اختبارها، وملف .cmp (ملف مقارنة) يحتوي على المخرجات الصحيحة التي يجب أن يُنتجها هذا الاختبار. مهمتك هي إكمال ملفات .hdl الهيكلية المُرفقة واختبارها.</p>
<p>الأدوات التي تحتاجها لهذا المشروع هي محاكي العتاد المُرفق والملفات المدرجة أعلاه. إذا كنت قد نزّلت حزمة برامج Nand2Tstris Software Suite، فإن هذه الملفات مخزّنة في مجلد nand2tetris/projects/02 لديك.</p>
<h3 id="نصائح">نصائح</h3>
<p>استخدام الشرائح المدمجة: ستتضمّن برامج HDL لديك على الأرجح أجزاء شريحة بنيتها في المشروع 1. لكنّ القاعدة التي نوصي بها هي استخدام الإصدارات المدمجة من هذه الشرائح بدلًا من ذلك. يضمن استخدام الشرائح المدمجة محاكاة صحيحة وكفء ويمكن التنبؤ بها. وهناك طريقة بسيطة لتحقيق هذا العرف: تأكد من أن مجلد مشروعك يتضمّن ملفات .hdl الخاصة بالشرائح المطوَّرة في المشروع الحالي فقط.</p>
<p>ترتيب التنفيذ: نوصي ببناء الشرائح بالترتيب الذي تظهر به في الفصل 2. لكن، بما أن المحاكي يتضمّن إصدارات مدمجة من هذه الشرائح، فيمكنك استخدام أجزاء الشريحة دون بنائها أولًا: سيستخدم المحاكي تلقائيًا تنفيذاتها المدمجة.</p>
<p>تُنتج ALU الخاصة بحاسوب Hack نوعين من المخرجات: مخرج «رئيسي» بطول 16 بت ينتج عن إجراء العملية على مُدخليْن بطول 16 بت، ومخرجا «حالة» بطول 1 بت يُسمّيان «zr» و«ng». نوصي ببناء هذه الوظيفة في مرحلتين. في المرحلة الأولى، نفّذ ALU تحسب مُخرج 16 بت وتُخرجه فقط، متجاهلةً مخرجَي الحالة المسمّيين أعلاه. وحالما تصحّ هذه التنفيذ (أي حالما تجتاز شيفرة ALU.hdl اختبار ALU-nostat)، وسّع شيفرتك لتتعامل مع مخرجاتَي الحالة أيضًا. وبهذه الطريقة، يمكن عزو أي مشكلات يكتشفها ALU.tst إلى الشيفرة الإضافية التي أضفتها في المرحلة الثانية. ونشكر مارك أرمبروست على اقتراح خطة التنفيذ هذه على مرحلتين، وعلى تزويدنا بملفات الاختبار لدعمها.</p>
`,a={book:t,chapter:d,chapterTitle:n,slug:e,title:r,headings:h,html:p};export{t as book,d as chapter,n as chapterTitle,a as default,h as headings,p as html,e as slug,r as title};
