const n="kinney",e="figma",i="Figma للمطوّرين",t="selecting-and-inspecting",c="التحديد والفحص",o=[{depth:2,id:"تحديد-الكائنات-المتشابهة",text:"تحديد الكائنات المتشابهة"},{depth:2,id:"قياس-المسافة-بين-الطبقات",text:"قياس المسافة بين الطبقات"},{depth:2,id:"تحديد-طبقات-متعددة-وضبطها",text:"تحديد طبقات متعددة وضبطها"}],s=`<p>بعض النصائح القياسية التي اكتسبناها من معظم واجهات المستخدم الرسومية تنطبق على Figma أيضًا:</p>
<ul>
<li>اضغط <code>Shift</code> لتحديد عدة كائنات.</li>
<li>انقر واسحب على لوحة العمل لإنشاء مربّع يمثّل نطاق الكائنات التي تريد تحديدها.</li>
</ul>
<p><img src="/arabic-cs-library/images/kinney/1947a115cbed22ec.gif" alt="تحديد طبقات متعددة"></p>
<p><strong>نصيحة احترافية</strong>: الضغط على مفتاح <code>Command</code> سيتيح لك دائمًا السحب لتحديد منطقة حتى وإن كان من المفترض أن ينتهي بك الأمر بالنقر على إطار فردي.</p>
<h2 id="تحديد-الكائنات-المتشابهة">تحديد الكائنات المتشابهة</h2>
<ul>
<li>اضغط مطوّلًا على مفتاح <code>Command</code> في نظام macOS أو مفتاح <code>Control</code> في Windows لتحديد العنصر نفسه الذي تمرّ عليه بالتحويم.</li>
<li>مع تحديد عنصر، انقر على تبويب Inspect في أعلى الشريط الجانبي الأيمن.</li>
<li>حدّد أحد الأزرار الزرقاء، واذهب إلى قائمة Figma في الزاوية العلوية اليسرى، واختر قائمة Edit، ولاحظ كيف يمكنك تحديد عناصر متشابهة بالخصائص نفسها.</li>
</ul>
<p><img src="/arabic-cs-library/images/kinney/db94da5a811981f4.webp" alt="تحديد المتشابه في Figma"></p>
<blockquote>
<p><strong>ملاحظة</strong></p>
<p>ينبغي الانتباه إلى أن هذا سيحدّد كل الكائنات المطابقة داخل الإطار نفسه و<em>لن</em> يعمل عبر الإطارات أو مع الكائنات غير الموجودة داخل إطار.</p>
</blockquote>
<h2 id="قياس-المسافة-بين-الطبقات">قياس المسافة بين الطبقات</h2>
<p>حدّد عنصرًا على الصفحة واضغط مطوّلًا على مفتاح <code>Alt</code> أو <code>Option</code>. وعندما تحرّك الفأرة حول الصفحة، سترى المسافة النسبية بينه وبين الكائنات الأخرى. وهذا مفيد جدًا عندما نحاول تنفيذ تصميم ما.</p>
<p><img src="/arabic-cs-library/images/kinney/e87775832cb1ac04.gif" alt="اضغط Option لقياس الطبقات"></p>
<h2 id="تحديد-طبقات-متعددة-وضبطها">تحديد طبقات متعددة وضبطها</h2>
<p>رسم الكائنات ومنحها أحجام تعبئة وما شابه أمر واضح ومباشر. لكن، كما في معظم الأمور في مجالنا، يأتي الجزء الصعب عندما تريد إعادة هيكلة الأشياء أو تغييرها على نطاق واسع.</p>
<p>ماذا سيحدث لو أردنا تغيير لون جميع المربّعات الخضراء إلى لون آخر؟ بالتأكيد يمكننا تحديد كل المربّعات بذلك اللون وضبطها — لكن هذا يعمل فقط في الصفحة التي تنظر إليها.</p>
<blockquote>
<p><strong>هناك طرق أفضل لإجراء تغييرات على نطاق واسع</strong></p>
<p>سنتناول لاحقًا <a href="https://stevekinney.com/courses/figma/styles">الأنماط</a> و<a href="https://stevekinney.com/courses/figma/variables">المتغيّرات</a> و<a href="https://stevekinney.com/courses/figma/components">المكوّنات</a>.</p>
</blockquote>
`,a={book:n,chapter:e,chapterTitle:i,slug:t,title:c,headings:o,html:s};export{n as book,e as chapter,i as chapterTitle,a as default,o as headings,s as html,t as slug,c as title};
