const e="sql-mystery",o="walkthrough",t="لغز القتل في SQL: شرح تفصيلي",d="index",c="لغز جريمة SQL: شرح تفصيلي",n=[{depth:2,id:"شرح-تفصيلي-للمبتدئين-في-sql",text:"شرح تفصيلي للمبتدئين في SQL"},{depth:2,id:"بعض-التعريفات",text:"بعض التعريفات"},{depth:3,id:"ما-هي-sql",text:"ما هي SQL؟"},{depth:3,id:"مهلا-ما-هي-قاعدة-البيانات-العلائقية",text:"مهلاً، ما هي قاعدة البيانات العلائقية؟"},{depth:3,id:"ما-هو-erd",text:"ما هو ERD؟"},{depth:2,id:"ما-هو-الاستعلام-query",text:"ما هو الاستعلام (query)؟"},{depth:3,id:"ما-العناصر-التي-يتكون-منها-استعلام-sql",text:"ما العناصر التي يتكوّن منها استعلام SQL؟"},{depth:2,id:"التعمق-أكثر",text:"التعمّق أكثر"},{depth:3,id:"دوال-sql-التجميعية-aggregate-functions",text:"دوال SQL التجميعية (Aggregate Functions)"},{depth:2,id:"إنشاء-الروابط",text:"إنشاء الروابط"},{depth:3,id:"ربط-الجداول",text:"ربط الجداول"},{depth:3,id:"هيا-إلى-العمل",text:"هيّا إلى العمل!"},{depth:3,id:"تحقق-من-حلك",text:"تحقّق من حلّك"},{depth:3,id:"الإسناد",text:"الإسناد"}],p=`<p><img src="/arabic-cs-library/images/sql-mystery/index-0-174092-clue-illustration.webp" alt="رسم توضيحي لمحقّق ينظر إلى لوح أدلة." id="intro"></p>
<p>وقعت جريمة قتل في مدينة SQL! صُمّم لغز جريمة SQL ليكون في الوقت نفسه درسًا ذاتيًا لتعلّم مفاهيم SQL وأوامرها، ولعبة ممتعة لمستخدمي SQL المخضرمين لحلّ جريمة مثيرة.</p>
<h2 id="شرح-تفصيلي-للمبتدئين-في-sql">شرح تفصيلي للمبتدئين في SQL</h2>
<p>إن كنت مرتاحًا مع SQL، فيمكنك <a href="https://mystery.knightlab.com/book/sql-mystery/index/index#experienced">تخطّي هذه الشروح</a> واختبار مهاراتك! نقدّم فيما يلي بعض مفاهيم SQL الأساسية، وقدرًا من التفاصيل يكفي فقط لحلّ جريمة القتل. وإن كنت تريد مقدمة أكمل عن SQL، فجرّب <a href="https://selectstarsql.com/">Select Star SQL.</a></p>
<p>وقعت جريمة، والمحقق يحتاج إلى مساعدتك. أعطاك المحقق تقرير مسرح الجريمة، لكنك فقدته بطريقة ما. وتتذكر بضبابية أن الجريمة كانت <strong>جريمة قتل (murder)</strong> وقعت في وقت ما في <strong>15 يناير 2018</strong> وأنها حدثت في <strong>مدينة SQL</strong>. ابدأ باسترجاع تقرير مسرح الجريمة المقابل من قاعدة بيانات قسم الشرطة.</p>
<p>كل أدلة هذا اللغز مدفونة في قاعدة بيانات ضخمة، وتحتاج إلى استخدام SQL للتنقل عبر هذه الشبكة الواسعة من المعلومات. وخطوتك الأولى لحلّ اللغز هي استرجاع تقرير مسرح الجريمة المقابل من قاعدة بيانات قسم الشرطة. وسنشرح فيما يلي، على مستوى عالٍ، الأوامر التي تحتاج إلى معرفتها؛ ومتى كنت مستعدًا، يمكنك البدء بتكييف الأمثلة لإنشاء أوامر SQL خاصة بك بحثًا عن الأدلة -- ويمكنك تشغيل أي SQL في أي من صناديق الشيفرة، أيًا كان ما كان في الصندوق عند بدئك.</p>
<h2 id="بعض-التعريفات">بعض التعريفات</h2>
<h3 id="ما-هي-sql">ما هي SQL؟</h3>
<p>SQL، وهي اختصار Structured Query Language (لغة الاستعلامات البنيوية)، طريقة للتفاعل مع قواعد البيانات العلائقية والجداول بما يتيح لنا نحن البشر استخلاص معلومات محددة ذات معنى.</p>
<h3 id="مهلا-ما-هي-قاعدة-البيانات-العلائقية">مهلاً، ما هي قاعدة البيانات العلائقية؟</h3>
<p>لا يوجد تعريف واحد لكلمة <em>قاعدة بيانات</em>. وبوجه عام، قواعد البيانات أنظمة لإدارة المعلومات. ويمكن أن تُفرض على البيانات درجات متفاوتة من البنية. وعندما تكون البيانات أكثر بنية، يساعد ذلك الناس والحواسيب على العمل بها بكفاءة أكبر.</p>
<p>قواعد البيانات العلائقية هي على الأرجح النوع الأشهر من قواعد البيانات. وهي تتكوّن في جوهرها من <em>جداول</em> تشبه إلى حد كبير جداول البيانات. ولكل عمود (column) في الجدول اسم ونوع بيانات (نص، رقم، إلخ)، وكل صف (row) في الجدول حالة محددة لما &quot;يدور حوله&quot; الجدول. أما الجزء &quot;العلائقي&quot; فيأتي بقواعد محددة لكيفية ربط البيانات بين الجداول المختلفة.</p>
<h3 id="ما-هو-erd">ما هو ERD؟</h3>
<p>ERD، وهي اختصار Entity Relationship Diagram (مخطط الكيانات والعلاقات)، تمثيل بصري للعلاقات بين كل الجداول ذات الصلة داخل قاعدة البيانات. وستجد أدناه مخطط ERD لقاعدة بيانات لغز جريمة SQL. ويوضح المخطط أن لكل جدول اسمًا (في أعلى المربع، بخط عريض)، وقائمة بأسماء الأعمدة (على اليسار) وأنواع بياناتها المقابلة (على اليمين، بأحرف كبيرة كلها). وهناك أيضًا بعض رموز المفاتيح الذهبية، ورموز الأسهم الزرقاء، والأسهم الرمادية في مخطط ERD. ويشير المفتاح الذهبي إلى أن العمود هو المفتاح الأساسي (primary key) للجدول المقابل، ويشير السهم الأزرق إلى أن العمود هو المفتاح الأجنبي (foreign key) للجدول المقابل. المفتاح الأساسي: معرّف فريد لكل صف في الجدول. المفتاح الأجنبي: يُستخدم للإشارة إلى بيانات في جدول من جدول آخر. وإذا كان جدولان مترابطين، فإن العمودين المتطابقين، أي المعرّفين المشتركين في الجدولين، يتصلان بسهم رمادي في المخطط.</p>
<p>وهذا هو مخطط ERD لقاعدة بياناتنا:</p>
<p><img src="/arabic-cs-library/images/sql-mystery/index-1-schema.webp" alt=""></p>
<h2 id="ما-هو-الاستعلام-query">ما هو الاستعلام (query)؟</h2>
<p>لو نظرت إلى البيانات في قاعدة البيانات هذه، لرأيت أن الجداول ضخمة! وهناك نقاط بيانات كثيرة جدًا؛ فليس من الممكن ببساطة المرور على الجداول صفًا صفًا للعثور على المعلومات التي نحتاجها. فماذا عسانا نفعل؟</p>
<p>هنا يأتي دور الاستعلامات. فالاستعلامات عبارات ننشئها للحصول على بيانات من قاعدة البيانات. والاستعلامات تُقرأ مثل الإنجليزية الطبيعية (في معظمها). لنجرّب بضعة استعلامات على قاعدة بياناتنا. وفي كل صندوق من الصناديق أدناه، انقر &quot;run&quot; لـ&quot;تنفيذ&quot; الاستعلام الموجود في الصندوق. ويمكنك تعديل الاستعلامات هنا في الصفحة نفسها لاستكشاف المزيد. (لاحظ أن أوامر SQL ليست حساسة لحالة الأحرف، لكن من المألوف كتابتها بأحرف كبيرة لتحسين القراءة. ويمكنك أيضًا استخدام أسطر جديدة ومسافات بيضاء كما تشاء لتنسيق الأمر للقراءة. وتطلب معظم أنظمة قواعد البيانات إنهاء الاستعلام بفاصلة منقوطة (';')، وإن كان النظام المستخدم لتشغيلها في صفحة الويب هذه أكثر تسامحًا.)</p>
<h3 id="ما-العناصر-التي-يتكون-منها-استعلام-sql">ما العناصر التي يتكوّن منها استعلام SQL؟</h3>
<p>قد يحتوي استعلام SQL على: كلمات SQL المفتاحية (مثل <code>SELECT</code> و<code>FROM</code> أعلاه) أسماء الأعمدة (مثل العمود <code>name</code> أعلاه) أسماء الجداول (مثل الجدول <code>person</code> أعلاه) محارف بديلة (مثل <code>%</code>) دوال معايير تصفية محددة إلخ</p>
<h4>كلمات SQL المفتاحية</h4>
<p>تُستخدم كلمات SQL المفتاحية لتحديد الإجراءات في استعلاماتك. وهي ليست حساسة لحالة الأحرف، لكننا نقترح كتابتها كلها بأحرف كبيرة ليسهل تمييزها عن بقية الاستعلام. ومن الكلمات المفتاحية الشائعة:</p>
<h4>SELECT</h4>
<p>يتيح لنا <code>SELECT</code> جلب بيانات أعمدة محددة من قاعدة البيانات:</p>
<ul>
<li>النجمة <code>*</code> (asterisk): تُستخدم بعد <code>SELECT</code> لجلب كل الأعمدة من الجدول؛</li>
<li><code>column_name(s)</code>: لتحديد أعمدة معيّنة، ضع أسماء الأعمدة بعد <code>SELECT</code> وافصل بينها بفواصل.</li>
</ul>
<h4>FROM</h4>
<p>يتيح لنا <code>FROM</code> تحديد الجدول أو الجداول التي تهمنا؛ ولاختيار عدة جداول، اذكر أسماء الجداول وافصل بينها بفواصل. (لكن قبل أن تتعلم الكلمة المفتاحية <code>JOIN</code>، قد يفاجئك ما سيحدث. وسيأتي ذلك لاحقًا.)</p>
<h4>WHERE</h4>
<p>تُستخدم عبارة <code>WHERE</code> في الاستعلام لتصفية النتائج وفق معايير محددة.</p>
<p>لنجرّب بعض هذه الأشياء.</p>
<p>تُستخدم الكلمة المفتاحية <code>AND</code> لربط عدة معايير تصفية معًا بحيث تحقق النتائج المصفّاة كل معيار من المعايير. (وهناك أيضًا الكلمة المفتاحية <code>OR</code>، التي تُعيد الصفوف التي تطابق أيًّا من المعايير.)</p>
<p>إن لم تكن قد وجدت تقرير مسرح الجريمة الصحيح بعد، فانقر &quot;show solution&quot; أعلاه، واستبدل محتوى الصندوق بالأمر الظاهر وحده. (واترك <code>/*</code> في البداية.) وإن كنت قد اكتشفت الاستعلام الذي يعرض تقرير مسرح الجريمة الواحد بدلًا من بضعة تقارير للمدينة والنوع نفسهما، فتهانينا وتجاهل كلمة &quot;incorrect&quot;. وستعرف إن كنت قد أصبت!</p>
<h4>المحارف البديلة (Wildcards) ودوال أخرى للمطابقات الجزئية</h4>
<p>أحيانًا لا تعرف إلا جزءًا من المعلومات التي تحتاجها. وتستطيع SQL التعامل مع ذلك. فالرموز الخاصة التي تمثّل محارف مجهولة تسمى &quot;محارف بديلة&quot; (wildcards)، وتدعم SQL اثنين منها. وأكثرها شيوعًا المحرف البديل <code>%</code>.</p>
<p>عندما تضع محرفًا بديلًا <code>%</code> في نص استعلام، سيُعيد نظام SQL نتائج تطابق بقية النص مطابقة تامة، ويكون فيها أي شيء (أو لا شيء) في موضع المحرف البديل. على سبيل المثال، <code>'Ca%a'</code> تطابق <code>Canada</code> و<code>California</code>.</p>
<p>والمحرف البديل الآخر، الأقل استخدامًا، هو <code>_</code>. وهو يعني &quot;طابِق بقية النص، بشرط وجود محرف واحد بالضبط في موضع <code>_</code> نفسه، أيًّا كان. لذا فإن <code>'B_b'</code> ستطابق <code>'Bob'</code> و<code>'Bub'</code> لكن ليس <code>'Babe'</code> ولا <code>'Bb'</code>.</p>
<p><strong>مهم:</strong> عند استخدام المحارف البديلة، لا تستخدم الرمز <code>=</code>؛ بل تستخدم <code>LIKE</code>.</p>
<p>تدعم SQL أيضًا المقارنات العددية مثل <code>&lt;</code> (أصغر من) و<code>&gt;</code> (أكبر من). ويمكنك أيضًا استخدام الكلمتين المفتاحيتين <code>BETWEEN</code> و<code>AND</code> -- وكلها تعمل مع الكلمات كما تعمل مع الأرقام.</p>
<p>ذكرنا أن أوامر SQL ليست حساسة لحالة الأحرف، لكن قيم الاستعلام في <code>WHERE</code> مع <code>=</code> و<code>LIKE</code> حساسة لها. وأحيانًا لا تعرف كيف خُزّن النص في قاعدة البيانات. وتوفّر SQL دالتين يمكنهما تذليل ذلك لك. وهما <code>UPPER()</code> و<code>LOWER()</code>، والأرجح أنك ستدرك ما تفعلانه، خصوصًا إن استكشفت في الصندوق أدناه.</p>
<h2 id="التعمق-أكثر">التعمّق أكثر</h2>
<h3 id="دوال-sql-التجميعية-aggregate-functions">دوال SQL التجميعية (Aggregate Functions)</h3>
<p>أحيانًا لا تكون الأسئلة التي تريد طرحها بالبساطة التي تكتفي بإيجاد صف البيانات الذي يحقق مجموعة معايير. فقد تريد طرح أسئلة أكثر تعقيدًا مثل &quot;من أكبر شخص سنًا؟&quot; أو &quot;من أقصر شخص؟&quot; ويمكن أن تساعدك <em>الدوال التجميعية</em> في الإجابة عن هذه الأسئلة. وفي الحقيقة، تعلمت دالة تجميعية أعلاه، وهي <code>COUNT</code>.</p>
<p>ما عمر أكبر شخص يحمل رخصة قيادة؟ مع قدر صغير من البيانات، قد تستطيع الحكم بالنظر، لكن في جدول <code>drivers_license</code> آلاف السجلات. (جرّب <code>COUNT</code> إن أردت معرفة عددها بالضبط!) ولا يمكنك مجرد إمرار النظر على تلك القائمة لإيجاد الجواب.</p>
<p>وهذه بعض الدوال التجميعية المفيدة التي توفّرها SQL: <code>MAX</code> يجد القيمة العظمى؛ و<code>MIN</code> يجد القيمة الصغرى؛ و<code>SUM</code> يحسب مجموع قيم العمود المحددة؛ و<code>AVG</code> يحسب متوسط قيم العمود المحددة؛ و<code>COUNT</code> يعُدّ عدد قيم العمود المحددة.</p>
<p>وهناك طريقة أخرى لإيجاد القيم الصغرى والعظمى، مع رؤية مزيد من البيانات في الوقت نفسه. يمكنك التحكم في ترتيب النتائج التي تحصل عليها. والأمر بديهي فعلًا: استخدم فقط <code>ORDER BY</code> متبوعة باسم عمود. وقد يكون ذلك صعبًا عندما تكون البيانات كثيرة! (حين يأخذ الناس العمل بـ SQL على محمل الجدية، يستخدمون أدوات أفضل من هذا النظام القائم على الويب.) ويسير <code>ORDER BY</code> افتراضيًا بترتيب &quot;تصاعدي&quot; (من الأصغر إلى الأكبر، أو من A إلى Z)، لكن يمكنك التحديد بـ <code>ASC</code> للترتيب التصاعدي، أو عكسه بـ <code>DESC</code>.</p>
<p>والآن تعرف من SQL ما يكفي لتحديد الشاهدين. جرّب ذلك!</p>
<h2 id="إنشاء-الروابط">إنشاء الروابط</h2>
<h3 id="ربط-الجداول">ربط الجداول</h3>
<p>حتى الآن، كنا نطرح أسئلة يمكن الإجابة عنها بالنظر في بيانات جدول واحد فقط. لكن ماذا لو احتجنا إلى طرح أسئلة أكثر تعقيدًا تتطلب في الوقت نفسه بيانات من جدولين مختلفين؟ هنا يأتي دور <code>JOIN</code>.</p>
<p>يستخدم المخضرمون في SQL بضعة أنواع مختلفة من <code>JOIN</code> -- وقد تسمع عن الربط INNER وOUTER وLEFT وRIGHT. وهنا سنتحدث فقط عن أكثر أنواع <code>JOIN</code> شيوعًا، وهو <code>INNER JOIN</code>. ولأنه شائع، يمكنك حذف <code>INNER</code> في أوامر SQL.</p>
<p>وأكثر طرق ربط الجداول شيوعًا استخدام أعمدة المفتاح الأساسي والمفتاح الأجنبي. عُد إلى مخطط الكيانات والعلاقات (ERD) أعلاه إن لم تتذكر ما هما، أو لترى علاقات المفاتيح بين الجداول في قاعدة بياناتنا. ويمكنك إجراء عمليات الربط على أي أعمدة، لكن أعمدة المفاتيح مُحسّنة للحصول على نتائج سريعة. والأرجح أن عرض كيفية عمل الربط في نظام SQL التفاعلي أسهل من كتابته.</p>
<p>وأحيانًا تريد ربط أكثر من جدول واحد. وتتيح لك SQL ربط أي عدد تريده من الجداول في الاستعلام.</p>
<p>والآن وقد عرفت كيف تربط الجداول، ينبغي أن تستطيع إيجاد نصوص المقابلات مع الشاهدين الذين حددتهما سابقًا. جرّب ذلك!</p>
<h3 id="هيا-إلى-العمل">هيّا إلى العمل!</h3>
<p>الآن تعرف من SQL ما يكفي لحلّ اللغز. وستحتاج إلى قراءة مخطط ERD ووضع بعض الافتراضات المعقولة، لكنك لا تحتاج إلى أي صياغة أخرى!</p>
<h3 id="تحقق-من-حلك">تحقّق من حلّك</h3>
<h3 id="الإسناد">الإسناد</h3>
<p>أنشأ لغز جريمة SQL كل من <a href="https://twitter.com/joonparkmusic">Joon Park</a> و<a href="https://twitter.com/Cathy_MeiyingHe">Cathy He</a> عندما كانا زميلين في Knight Lab. راجع <a href="https://github.com/NUKnightLab/sql-mysteries">مستودع GitHub</a> لمزيد من المعلومات.</p>
<p>تكفّل <a href="https://twitter.com/joegermuska">Joe Germuska</a> بتكييفه وإنتاجه للويب.</p>
<p>استُلهم هذا اللغز من <a href="https://github.com/veltman/clmystery">جريمة في مدينة Terminal المجاورة.</a></p>
<p>يعمل SQL في المتصفح بفضل <a href="https://github.com/sql-js/sql.js/">SQL.js</a></p>
<p>أنشأ مكوّنات الويب المخصّصة لاستعلامات SQL وأتاحها للملكية العامة Zi Chong Kao، مبتكر <a href="https://selectstarsql.com/">Select Star SQL.</a></p>
<p>رسم المحقق مقدَّم من <a href="https://www.vecteezy.com/">Vectors by Vecteezy</a></p>
<p>الشيفرة الأصلية لهذا المشروع منشورة تحت <a href="https://github.com/NUKnightLab/sql-mysteries/blob/master/LICENSE">رخصة MIT</a></p>
<p>النص الأصلي والمحتوى الآخر لهذا المشروع منشوران تحت <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons CC BY-SA 4.0</a></p>
`,s={book:e,chapter:o,chapterTitle:t,slug:d,title:c,headings:n,html:p};export{e as book,o as chapter,t as chapterTitle,s as default,n as headings,p as html,d as slug,c as title};
