const e="crafting-interpreters",n="a-tree-walk-interpreter",t="A Tree-Walk Interpreter",r="index",a="مفسّر يتجوّل على الشجرة",c=[],p=`<p>بهذا الجزء، نبدأ jlox، وهو أول مفسّرينا اثنين. لغات البرمجة موضوعٌ هائل يحتوي كمًّا
هائلًا من المفاهيم والمصطلحات التي يجب أن تحشرها في ذهنك دفعةً واحدة. ونظريّة لغات
البرمجة تتطلّب درجةً من الصرامة الذهنية لم تحتج إلى استدعائها على الأرجح منذ امتحان
التكامل اللانهائي (calculus) الأخير. (ولحسن الحظ، ليس في هذا الكتاب نظريّة
كثيرة.)</p>
<p>يتطلّب تنفيذ مفسّر بعض الحيل المعمارية وأنماط التصميم التي ليست شائعة في أنواع
التطبيقات الأخرى، لذا سنعتاد أيضًا على الجانب الهندسي من الأمور. ومع كل ذلك، سنُبقي
الشيفرة التي نضطر لكتابتها بسيطة قدر الإمكان.</p>
<p>في أقل من ألفَي سطر من شيفرة Java نظيفة، سنبني مفسّرًا كاملًا لـ Lox ينفّذ كل ميزة من
ميزات اللغة، تمامًا كما حدّدناها. تعمل الفصول الأولى من الأمام إلى الخلف عبر مراحل
المفسّر -- [المسح الضوئي][]، و[التحليل][]، و[تقييم الشيفرة][]. وبعد ذلك، نضيف ميزات
اللغة واحدةً تلو الأخرى، فنحوّل آلة حاسبة بسيطة إلى لغة برمجة نصّية مكتملة.</p>
`,s={book:e,chapter:n,chapterTitle:t,slug:r,title:a,headings:c,html:p};export{e as book,n as chapter,t as chapterTitle,s as default,c as headings,p as html,r as slug,a as title};
