const n="mooc",t="auxiliary",i="صفحات مساعدة",l="grading-and-exams",d="التقييم والاختبارات",s=[{depth:3,id:"الاختبارات-القادمة",text:"الاختبارات القادمة"},{depth:2,id:"أداء-اختبار-البرمجة",text:"أداء اختبار البرمجة"},{depth:2,id:"معلومات-حول-ترتيبات-الاختبار",text:"معلومات حول ترتيبات الاختبار"},{depth:2,id:"نقاط-التمارين",text:"نقاط التمارين"},{depth:2,id:"إرشادات-التقييم",text:"إرشادات التقييم"},{depth:3,id:"مقياس-التقييم",text:"مقياس التقييم"}],h=`<p>للنجاح في دورات MOOC الخاصة ببرمجة Python، من المتوقع أن تُكمل التمارين وأن تشارك في اختبار.</p>
<h3 id="الاختبارات-القادمة">الاختبارات القادمة</h3>
<h4>مقدمة في البرمجة</h4>
<ul>
<li><s>السبت 07.03.2026</s></li>
<li><s>السبت 02.05.2026</s></li>
<li><s>السبت 06.06.2026</s></li>
<li><s>السبت 18.07.2026</s></li>
<li>السبت 05.09.2026</li>
<li>الثلاثاء 27.10.2026</li>
<li>السبت 5.12.2026</li>
<li>السبت 16.1.2027</li>
</ul>
<h4>الدورة المتقدمة في البرمجة</h4>
<ul>
<li><s>السبت 14.03.2026</s></li>
<li><s>السبت 09.05.2026</s></li>
<li><s>السبت 13.06.2026</s></li>
<li><s>السبت 15.08.2026</s></li>
<li>الثلاثاء 20.10.2026</li>
<li>الثلاثاء 15.12.2026</li>
<li>السبت 23.01.2027</li>
<li>السبت 27.02.2027</li>
</ul>
<h2 id="أداء-اختبار-البرمجة">أداء اختبار البرمجة</h2>
<p>بمجرد أن تُكمل العدد المطلوب من التمارين في إحدى الدورتين، يمكنك أداء اختبار الدورة المعنية في أي من الأوقات المذكورة أعلاه. وتحديدًا، يجب أن تكون قد حصلت على 25 % على الأقل من نقاط التمارين في كل جزء من الأجزاء السبعة للدورة بحلول الساعة 8 صباحًا صباح يوم الاختبار. إذا كنت ستؤدي اختبار الدورة المتقدمة، فيجب أن يكون الجزء 14 مكتملًا بالكامل. إذا لم يبلغ أي من مجاميع النقاط السبعة هذا الحد، فلن تُقيَّم إجاباتك في الاختبار.</p>
<p>تُقيَّم الإجابات بشكل منفصل لدورة مقدمة في البرمجة (الأجزاء 1-7) وللدورة المتقدمة في البرمجة (الأجزاء 8-14).</p>
<p>يمكنك المشاركة في أي عدد من الاختبارات المذكورة أعلاه. وأعلى تقدير تحصل عليه سيكون تقديرك النهائي.</p>
<h2 id="معلومات-حول-ترتيبات-الاختبار">معلومات حول ترتيبات الاختبار</h2>
<blockquote>
<p><strong>ملاحظة:</strong> كل الأوقات هي بالتوقيت المحلي في هلسنكي، فنلندا</p>
</blockquote>
<ul>
<li>لا تحتاج إلى التسجيل في الاختبار.</li>
<li>يمكن أداء اختبار الدورة في تاريخ الاختبار <strong>بين الساعة 10:00 صباحًا والساعة 10:00 مساءً</strong>.</li>
<li>ينتهي الاختبار في الساعة 10:00 مساءً على أبعد تقدير. إذا أردت أن تتمكن من قضاء أقصى وقت مسموح في الاختبار، فيجب أن <strong>تبدأ في الساعة 6:00 مساءً على أبعد تقدير</strong>.</li>
<li>سيكون لديك <strong>أربع ساعات</strong> لإكمال الاختبار. إذا مُنحت وقتًا إضافيًا بموجب ترتيبات خاصة، فسيكون لديك خمس ساعات لإكمال الاختبار، ويجب أن تبدأ في الساعة 5:00 مساءً على أبعد تقدير.</li>
<li>تُقدَّم حلولك لمهام البرمجة في الاختبار بالطريقة نفسها التي تقدّم بها حلولك لتمارين البرمجة في الدورة.</li>
</ul>
<p>ستُنشر تعليمات أكثر تفصيلاً على هذه الصفحات قبل تاريخ الاختبار.</p>
<div class="exercises"><h2 id="نقاط-التمارين">نقاط التمارين</h2>
<p>كل تمرين برمجة وكل اختبار قصير في كل جزء يستحق عددًا من نقاط التمارين. يمكنك العثور على قائمة بجميع التمارين في جزء معين بالضغط على قائمة &quot;قائمة التمارين في هذا الجزء&quot; في صفحة فهرس ذلك الجزء. يمكنك الاطلاع على مجموع نقاط تمارينك الحالي بالضغط على الكرة الزرقاء في الزاوية السفلية اليمنى من أي صفحة في مادة الدورة. النسبة المئوية في قسم &quot;مجموع النقاط&quot; لكل جزء هي النسبة الحاسمة للنجاح في الدورة.</p>
<h2 id="إرشادات-التقييم">إرشادات التقييم</h2>
<h3 id="مقياس-التقييم">مقياس التقييم</h3>
<p>تنقسم MOOC إلى دورتين: مقدمة في البرمجة (الأجزاء 1 إلى 7) والدورة المتقدمة في البرمجة (الأجزاء 8 إلى 14). ويُقيَّم كلا الدورتين على المقياس التالي:</p>
<table>
    <thead>
    <tr>
        <th>مجموع النقاط</th>
        <th>التقدير النهائي</th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <td>90 % أو أكثر</td>
        <td>5 (ممتاز)</td>
    </tr>
    <tr>
        <td>80 % أو أكثر وأقل من 90 %</td>
        <td>4 (جيد جدًا)</td>
    </tr>
    <tr>
        <td>70 % أو أكثر وأقل من 80 %</td>
        <td>3 (جيد)</td>
    </tr>
    <tr>
        <td>60 % أو أكثر وأقل من 70 %</td>
        <td>2 (مقبول)</td>
    </tr>
    <tr>
        <td>50 % أو أكثر وأقل من 60 %</td>
        <td>1 (كافٍ)</td>
    </tr>
    <tr>
        <td>أقل من 50 %</td>
        <td>راسب</td>
    </tr>
    </tbody>
</table>
<p>يُحسب التقدير النهائي بناءً على عدد نقاط التمارين التي حصلت عليها خلال الدورة (50 % من التقدير النهائي) والنقاط التي حصلت عليها في الاختبار (50 % من التقدير النهائي). وتساوي نسبتك المئوية من نقاط التمارين <code>([مجموع نقاط التمارين المستلمة] / [عدد نقاط التمارين المتاحة في الدورة]) * 100</code>. ونعمل على إدراج هذه النسبة المئوية في العرض المرئي في الزاوية السفلية اليمنى من كل صفحة.</p>
<p>فعلى سبيل المثال، إذا كانت نسبتك المئوية الإجمالية للتمارين على مستوى الدورة كاملة 42 %، وحصلت على 79 % من نقاط الاختبار، فإن نسبتك المئوية النهائية للنقاط ستكون (42 % + 79 %) / 2 = 60.5 %، وهو ما يساوي التقدير 2 (مقبول).</p>
<p>للنجاح في الدورة، يجب أن تكون قد حصلت على 25 % على الأقل من نقاط التمارين في كل جزء من أجزاء الدورة، بصرف النظر عن الحساب أعلاه.</p>
<h4>الحد الأدنى لنقاط الاختبار</h4>
<p>للنجاح في الدورة، يجب أن تحصل على 50 % على الأقل من مجموع النقاط المتاحة في الاختبار.</p>
<h4>الاشتباه في الغش</h4>
<p>إذا كان هناك سبب للاشتباه في الغش، بناءً على إجابات الاختبار أو إجابات MOOC، أثناء فحص أوراق الاختبار، فستُرسل إلى متقدّم الاختبار طلب للرد. إذا كان الرد مقبولًا، فسيُرتَّب اجتماع عن بُعد قصير، يشرح خلاله متقدّم الاختبار حلوله للمهام التي أسندها إليه المعلّم. إذا كان هناك سبب للاعتقاد بأن الحلول أُنجزت باستقلالية، فسيحصل الطالب على تقدير عادي للدورة، ولن يُسجَّل أي اشتباه في أي مكان. إذا لم يتمكن الطالب من تقديم تفسير مقبول أو من شرح حلوله بصورة مقبولة، فستُرفض نتيجة الاختبار وأداء الدورة، وتُحال القضية للنظر فيها وفقًا لقواعد الغش في الاختبارات المطبقة في جامعة هلسنكي.</p>
</div>`,o={book:n,chapter:t,chapterTitle:i,slug:l,title:d,headings:s,html:h};export{n as book,t as chapter,i as chapterTitle,o as default,s as headings,h as html,l as slug,d as title};
