const t="nand2tetris-1",e="project05",d="المشروع 5: معمارية الحاسوب",n="index",r="المشروع 5: معمارية الحاسوب",p=[{depth:2,id:"المشروع-5-معمارية-الحاسوب",text:"المشروع 5: معمارية الحاسوب"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"الهدف",text:"الهدف"},{depth:3,id:"الشرائح",text:"الشرائح"},{depth:3,id:"العقد",text:"العقد"},{depth:3,id:"الاختبار",text:"الاختبار"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"نصائح",text:"نصائح"},{depth:3,id:"الأدوات",text:"الأدوات"}],a=`<h2 id="المشروع-5-معمارية-الحاسوب">المشروع 5: معمارية الحاسوب</h2>
<h3 id="خلفية">خلفية</h3>
<p>في المشاريع السابقة بنينا أجهزة المعالجة والتخزين الأساسية للحاسوب (ALU وRAM، على الترتيب). وفي هذا المشروع سنجمع كل شيء معًا، فنحصل على منصة Hack Hardware Platform كاملة. وستكون النتيجة حاسوبًا متعدد الأغراض قادرًا على تشغيل البرامج المكتوبة بلغة آلة Hack.</p>
<h3 id="الهدف">الهدف</h3>
<p>أكمل بناء CPU Hack ومنصة Hack Hardware Platform، وصولاً إلى شريحة Computer الأعلى مستوىً.</p>
<h3 id="الشرائح">الشرائح</h3>
<table>
<thead>
<tr>
<th>اسم الشريحة</th>
<th>الوصف</th>
<th>الاختبار</th>
</tr>
</thead>
<tbody>
<tr>
<td>Memory.hdl</td>
<td>نطاق عناوين RAM بالكامل</td>
<td>اختبر شريحتك باستخدام ملفي Memory.tst وMemory.cmp المرفقَين.</td>
</tr>
<tr>
<td>CPU.hdl</td>
<td>CPU Hack</td>
<td>اختبر شريحتك باستخدام ملفي CPU.tst وCPU.cmp المرفقَين. وتتوفر أيضًا ملفات اختبار بديلة (أقل شمولاً لكنها لا تتطلب استخدام DRegister المدمج) في CPU-external.tst وCPU-external.cmp.</td>
</tr>
<tr>
<td>Computer.hdl</td>
<td>شريحة المنصة الأعلى مستوىً</td>
<td>اختبر الشريحة بتشغيل بعض برامج Hack عليها. راجع المزيد من التعليمات أدناه.</td>
</tr>
</tbody>
</table>
<h3 id="العقد">العقد</h3>
<p>يجب أن تكون منصة الحاسوب التي تبنيها قادرة على تنفيذ البرامج المكتوبة بلغة آلة Hack، كما هي محدّدة في الفصل 4. وأظهر هذه القدرة بجعل شريحة Computer خاصتك تشغّل برامج الاختبار الثلاثة الواردة أدناه.</p>
<h3 id="الاختبار">الاختبار</h3>
<p>اختبار شريحتي Memory وCPU: من المهم اختبار هاتين الشريحتين على حدة قبل الانتقال إلى بناء شريحة Computer الكلية. استخدم سكربتات الاختبار وملفات المقارنة المذكورة أعلاه.</p>
<p>اختبار شريحة Computer: إنّ طريقة طبيعية لاختبار تنفيذ شريحة Computer الكلية هي جعلها تنفّذ بعض البرامج النموذجية المكتوبة بلغة آلة Hack. ولإجراء مثل هذا الاختبار، يمكن كتابة سكربت اختبار يقوم (i) بتحميل وصف شريحة Computer.hdl إلى محاكي العتاد المرفق، (ii) بتحميل برنامج بلغة الآلة من ملف .hack خارجي إلى جزء ROM من شريحة Computer.hdl المحمّلة، ثم (iii) بتشغيل الساعة عددًا كافيًا من الدورات لتنفيذ التعليمات المحمّلة. ونحن نرفق كل الملفات اللازمة لإجراء ثلاثة اختبارات من هذا القبيل، وهي كالآتي:</p>
<table>
<thead>
<tr>
<th>البرنامج</th>
<th>التعليقات</th>
</tr>
</thead>
<tbody>
<tr>
<td>Add.hack</td>
<td>يجمع ثابتَي 2 و3 ويكتب الناتج في RAM[0]. الاختبار الموصى به: ComputerAdd.tst وComputerAdd.cmp. اختبار بديل (أقل شمولاً لكنه يتطلب استخدام RAM16K المدمجة فقط): ComputerAdd-external.tst وComputerAdd-external.cmp.</td>
</tr>
<tr>
<td>Max.hack</td>
<td>يحسب أكبر قيمة بين RAM[0] وRAM[1] ويكتب الناتج في RAM[2]. الاختبار الموصى به: ComputerMax.tst وComputerMax.cmp. اختبار بديل (أقل شمولاً لكنه يتطلب استخدام RAM16K المدمجة فقط): ComputerMax-external.tst وComputerMax-external.cmp.</td>
</tr>
<tr>
<td>Rect.hack</td>
<td>يرسم مستطيلًا عرضه 16 بكسل وطوله RAM[0] في أعلى يسار الشاشة. الاختبارات الموصى بها: testComputerRect.tst وComputerRect.cmp. اختبار بديل (أقل شمولاً لكنه لا يتطلب استخدام أي من الشرائح المدمجة): ComputerRect-external.tst وComputerRect-external.cmp.</td>
</tr>
</tbody>
</table>
<p>قبل اختبار شريحة Computer خاصتك على أيٍّ من البرامج أعلاه، اقرأ ملف .tst ذا الصلة وتأكد من فهمك للتعليمات المُعطاة إلى المحاكي. وقد يكون <a href="https://drive.google.com/file/d/1VZSQV-7NcmG0q6v46OUIypfiTrnoi1Ss/view?usp=sharing">دليل TDL</a> مرجعًا مفيدًا هنا.</p>
<h3 id="الموارد">الموارد</h3>
<p>انظر <a href="https://www.nand2tetris.org/_files/ugd/44046b_552ed0898d5d491aabafd8a768a87c6f.pdf">الفصل 5</a>، و<a href="https://drive.google.com/file/d/1dPj4XNby9iuAs-47U9k3xtYy9hJ-ET0T/view?usp=sharing">دليل HDL</a>، و<a href="https://drive.google.com/file/d/1VZSQV-7NcmG0q6v46OUIypfiTrnoi1Ss/view?usp=sharing">دليل TDL</a>، (للاطلاع)، و<a href="https://drive.google.com/file/d/1IsDnH0t7q_Im491LQ7_5_ajV0CokRbwR/view?usp=sharing">مجموعة شرائح Hack</a>.</p>
<p>الأدوات التي تحتاجها لهذا المشروع هي محاكي العتاد المرفق والملفات المذكورة أعلاه. وإذا كنت قد حمّلت حزمة برامج Nand2Tetris Software Suite، فإن هذه الملفات مخزّنة في مجلد projects/05 خاصتك.</p>
<h3 id="نصائح">نصائح</h3>
<p>أكمل بناء الحاسوب بالترتيب التالي:</p>
<p>Memory: تتضمّن هذه الشريحة ثلاثة أجزاء: RAM16K، وScreen، وKeyboard. أما Screen وKeyboard فمتاحان كشريحتين مدمجتين، فلا حاجة إلى تنفيذهما. وعلى الرغم من بناء شريحة RAM16K في المشروع 3، فإننا نوصي باستخدام نسختها المدمجة، لأنها توفر واجهة رسومية ملائمة للتنقيح.</p>
<p>CPU: يمكن بناء هذه الشريحة وفقًا لتنفيذ CPU المقترح الوارد في الشكل 5.9 من الفصل 5، باستخدام شريحتي ALU والمسجّل المبنيتين في المشروعين 2 و3 على الترتيب. غير أننا نوصي باستخدام أجزاء مدمجة بدلًا منهما، وتحديدًا ARegister وDRegister. فالنسخ المدمجة من هاتين الشريحتين لها نفس الواجهة ونفس الوظائف تمامًا مثل شريحة Register المحدّدة في الفصل 3؛ لكنها تتميز بآثار جانبية على الواجهة الرسومية تأتي في متناول اليد لأغراض الاختبار.</p>
<p>من حيث المبدأ، قد يتضمّن تنفيذ CPU خاصتك شرائح داخلية من مواصفاتك الخاصة، أي شرائح غير مذكورة في الشكل 5.9 من الفصل 5. لكن هذا غير مستحسن، وسيؤدي على الأرجح إلى تصميم CPU أقل كفاءة. فإن اخترت إنشاء شرائح جديدة غير مذكورة في الكتاب، فتأكد من توثيقها واختبارها على حدة بعناية قبل وصلها في المعمارية.</p>
<p>ذاكرة التعليمات: استخدم شريحة ROM32K المدمجة.</p>
<p>Computer: يمكن بناء شريحة Computer الأعلى مستوىً وفقًا للتنفيذ المقترح الموضّح في الشكل 5.10 من الفصل 5.</p>
<h3 id="الأدوات">الأدوات</h3>
<p>يمكن تنفيذ واختبار جميع الشرائح المذكورة في هذا المشروع، بما فيها شريحة Computer الأعلى مستوىً، باستخدام محاكي العتاد المرفق. وهذه لقطة شاشة لاختبار برنامج Rect.hack على تنفيذ لشريحة Computer.</p>
<p><img src="/arabic-cs-library/images/nand2tetris-1/project05-44046b_344d66c34a4247798f9d91810.webp" alt=""></p>
<p>يرسم برنامج Rect الموضّح أعلاه مستطيلًا عرضه 16 بكسل وطوله RAM[0] في أعلى يسار الشاشة. وإليك ملاحظة مثيرة للاهتمام: عادةً، حين تشغّل برنامجًا على حاسوب ما ولا تحصل على النتيجة المرجوة، تستنتج أن البرنامج معطوب. أما في حالتنا هذه، فإن برنامج Rect المرفق خالٍ من العلل. وبذلك، فإن كان تشغيل هذا البرنامج ينتج نتائج غير متوقعة، فهذا يعني أن منصة الحاسوب التي يعمل عليها (Computer.hdl و/أو بعض أجزاء شريحتها من المستوى الأدنى) معطوبة. وإذا كان الأمر كذلك، فعليك تنقيح شرائحك.</p>
`,h={book:t,chapter:e,chapterTitle:d,slug:n,title:r,headings:p,html:a};export{t as book,e as chapter,d as chapterTitle,h as default,p as headings,a as html,n as slug,r as title};
