const l="hello-algo",n="chapter_searching",t="البحث",i="summary",o="ملخص",e=[{depth:3,id:"مراجعة-النقاط-الرئيسية",text:"مراجعة النقاط الرئيسية"}],c=`<h3 id="مراجعة-النقاط-الرئيسية">مراجعة النقاط الرئيسية</h3>
<ul>
<li>يعتمد البحث الثنائي على البيانات المرتبة، ويبحث عبر تنصيف نطاق البحث مراراً وتكراراً. وهو يشترط أن تكون بيانات الإدخال مرتبة، ولا ينطبق إلا على المصفوفات أو بنى البيانات القائمة على المصفوفات.</li>
<li>يحدد البحث بالقوة الغاشمة موضع البيانات عبر اجتياز بنية البيانات. وينطبق البحث الخطي على المصفوفات والقوائم المترابطة، بينما ينطبق البحث بالعرض أولاً والبحث بالعمق أولاً على الرسوم البيانية والأشجار. وهذه الخوارزميات واسعة الانطباق ولا تتطلب أي معالجة مسبقة للبيانات، لكن تعقيدها الزمني مرتفع نسبياً ويبلغ $O(n)$.</li>
<li>البحث بالتجزئة والبحث بالشجرة والبحث الثنائي طرق بحث فعّالة تستطيع تحديد موقع العناصر الهدف بسرعة في بنى بيانات محددة. ولهذه الخوارزميات كفاءة عالية يصل فيها التعقيد الزمني إلى $O(\\log n)$ أو حتى $O(1)$، لكنها تتطلب عادةً بنى بيانات إضافية.</li>
<li>نحتاج عملياً إلى تحليل عوامل مثل حجم البيانات ومتطلبات أداء البحث وتكرار استعلام البيانات وتحديثها لاختيار طريقة البحث المناسبة.</li>
<li>يناسب البحث الخطي مجموعات البيانات الصغيرة أو البيانات التي تُحدَّث بكثرة؛ ويناسب البحث الثنائي مجموعات البيانات المرتبة الكبيرة؛ ويناسب البحث بالتجزئة الحالات التي تُطلب فيها كفاءة استعلام عالية ولا حاجة فيها إلى استعلامات النطاق؛ ويناسب البحث بالشجرة مجموعات البيانات الديناميكية الكبيرة التي يجب الحفاظ على ترتيبها ودعم استعلامات النطاق فيها.</li>
<li>يُعدّ استبدال البحث الخطي بالبحث بالتجزئة استراتيجية شائعة لتحسين زمن التنفيذ، إذ يخفض التعقيد الزمني من $O(n)$ إلى $O(1)$.</li>
</ul>
`,s={book:l,chapter:n,chapterTitle:t,slug:i,title:o,headings:e,html:c};export{l as book,n as chapter,t as chapterTitle,s as default,e as headings,c as html,i as slug,o as title};
