const n="nand2tetris-2",t="project09",p="المشروع 9: لغة عالية المستوى",a="index",e="المشروع 9: لغة عالية المستوى",i=[{depth:2,id:"المشروع-9-البرمجة-بلغة-عالية-المستوى",text:"المشروع 9: البرمجة بلغة عالية المستوى"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"الهدف",text:"الهدف"},{depth:3,id:"نظام-jack-التشغيلي",text:"نظام Jack التشغيلي"},{depth:3,id:"كتابة-وتحرير-برامج-jack",text:"كتابة وتحرير برامج Jack"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"ملاحظة-حول-التسليم",text:"ملاحظة حول التسليم"},{depth:3,id:"برنامج-jack-نموذجي",text:"برنامج Jack نموذجي"},{depth:3,id:"ترجمة-تطبيق-jack-وتشغيله",text:"ترجمة تطبيق Jack وتشغيله"},{depth:3,id:"أنشئ-مجلدا-مثل-myapp",text:"- أنشئ مجلدًا، مثل MyApp."},{depth:3,id:"بعض-النصائح-الإضافية",text:"بعض النصائح الإضافية"},{depth:3,id:"للحصول-على-فكرة-حول-تطبيقك-شاهد-بعض-تطبيقات-nand2tetris-القائمة-يمتاز-قسم-quotcool-stuffquot-من-هذا-الموقع-بتطبيقات-مبهرة-ويمكنك-أن-تجد-المزيد-منها-على-youtube",text:"- للحصول على فكرة حول تطبيقك، شاهد بعض تطبيقات Nand2Tetris القائمة. يمتاز قسم &quot;Cool Stuff&quot; من هذا الموقع بتطبيقات مبهرة، ويمكنك أن تجد المزيد منها على Youtube."}],c=`<h2 id="المشروع-9-البرمجة-بلغة-عالية-المستوى">المشروع 9: البرمجة بلغة عالية المستوى</h2>
<h3 id="خلفية">خلفية</h3>
<p>يقدّم هذا المشروع Jack، وهي لغة برمجة بسيطة شبيهة بـ Java، قائمة على الكائنات. وقبل بناء مصرِّف Jack في المشروعين 10 و11، من المنطقي التعرّف على اللغة نفسها. وهذا هو الغرض الرئيسي من هذا المشروع. وهناك أيضًا متعة كتابة لعبة حاسوب صغيرة بلغة بسيطة رائعة.</p>
<h3 id="الهدف">الهدف</h3>
<p>تبنَّ فكرة تطبيق ما، مثل لعبة حاسوب بسيطة أو بعض البرامج التفاعلية الأخرى. ومن الأمثلة على ذلك Tetris وSnake وHangman وSpace Invaders وSokoban وPong وغيرها. ومهمّتك هي تنفيذ هذا التطبيق بلغة Jack. ولا يلزمك إنشاء تطبيق كامل؛ فيمكنك مثلًا إنشاء نسخة أساسية من لعبة بسيطة ما، أو جزء منها، أو تفاعل بسيط رائع.</p>
<h3 id="نظام-jack-التشغيلي">نظام Jack التشغيلي</h3>
<p>تتطلب كتابة برامج Jack العمل مع نظام Jack التشغيلي، تمامًا مثلما تتطلب كتابة برامج Java العمل مع مكتبة أصناف Java. ويمكن النظر إلى نظام Jack التشغيلي على أنه مجموعة من الخدمات البرمجية التي توسّع قدرات اللغة الأساسية وتسدّ الثغرات بينها وبين العتاد الأساسي. وإليك <a href="https://www.nand2tetris.org/_files/ugd/44046b_a89c06efcef3491cafb42fb76cc95dc0.pdf">واجهة برمجة تطبيقات Jack OS.</a></p>
<p>تتضمّن حزمة برامج Nand2Tetris تنفيذين لنظام Jack التشغيلي: كُتب أحدهما بتلك اللغة ثم تُرجم باستخدام مصرِّفها إلى مجموعة من 8 ملفات أصناف بالامتداد .vm هي Math وScreen وOutput وKeyboard وMemory وString وArray وSys، وتُحفَظ في مجلد فرعي داخل مجلد الأدوات على حاسوبك. أما التنفيذ الآخر فكُتب بجافا، وهو جزء لا يتجزّأ من مُحاكٍ الآلة الافتراضية المرفق، والمتوفر أيضًا في مجلد الأدوات. ونشرح في الفقرات التالية كيفية استخدام كل إصدار منهما.</p>
<h3 id="كتابة-وتحرير-برامج-jack">كتابة وتحرير برامج Jack</h3>
<p>يتألّف تطبيق Jack من ملف .jack واحد أو أكثر. ويمكنك كتابة هذه الملفات وتحريرها في أي محرّر نصوص يتعامل مع الملفات النصية العادية. فمثلًا، إذا أردت استخدام Notepad++، فيمكنك اتّباع الخطوات التالية:</p>
<ul>
<li>
<p>ثبّت أحدث إصدار من Notepad++ على حاسوبك؛</p>
</li>
<li>
<p>انسخ <a href="https://www.nand2tetris.org/_files/ugd/44046b_e17efbe7efc74aad90935febe4730402.pdf">اتفاقيات صياغة Jack</a> هذه إلى الملف \\notepad++\\userDefineLang.xml على حاسوبك.</p>
</li>
</ul>
<p>سيؤدّي هذا الإجراء إلى تخصيص Notepad++ لكتابة برامج Jack على حاسوبك. وبالطبع، يمكنك استخدام أي محرّر نصوص آخر يناسبك. وإذا أردت تخصيص المحرّر للبرمجة بلغة Jack (وهو ليس تعديلًا ضروريًا في الحقيقة)، فسيتعيّن عليك اكتشاف كيفية فعل ذلك بنفسك.</p>
<p>ربما من الجدير بالذكر أننا لا نريد أن نجعل من برمجة Jack مسألة كبيرة. فنحن نستخدم Jack بشكل أساسي كوسيلة لتعلّم كيفية تطوير مصرّفات وأنظمة تشغيل بسيطة، كما سنفعل في المشاريع 10 و11 و12. لذلك، لا حاجة لقضاء وقت طويل في صقل مهاراتك في برمجة Jack.</p>
<h3 id="الموارد">الموارد</h3>
<p>القراءة ذات الصلة بهذا المشروع هي الفصل 9 من الكتاب. وستحتاج إلى ثلاث أدوات: محرّر نصوص لكتابة برامج Jack، ومصرِّف Jack المرفق (JackCompiler) لترجمتها، ومُحاكٍ الآلة الافتراضية المرفق لتنفيذها واختبارها. وقد تكون قائمة <a href="https://www.nand2tetris.org/_files/ugd/44046b_907fb326cbcb4851b93c21f79d515180.pdf">أخطاء Jack OS</a> هذه مفيدة أثناء عملية تطوير برنامجك.</p>
<p>محرّر الصور النقطية: إذا أردت تطوير تطبيق يحتوي على عناصر رسومية، فكّر في استخدام <a href="https://github.com/ErikUmble/JackBitmapEditor">محرّر Bitmap</a> القوي هذا، الذي أنشأه Eric Umble. وإليك عرضًا توضيحيًا للعبة <a href="https://www.youtube.com/watch?v=zXWyuDh928o">Dino Adventure</a> التي طوّرها Eric بهذا المحرّر.</p>
<p>أفكار الألعاب: تحتوي <a href="https://www.youtube.com/c/RetroGameMechanicsExplained">قناة Youtube</a> هذه على نصائح حول برمجة ألعاب الحاسوب &quot;الكلاسيكية&quot;. ويمكنك الرجوع إليها للحصول على بعض الأفكار، وكذلك نصائح تقنية.</p>
<h3 id="ملاحظة-حول-التسليم">ملاحظة حول التسليم</h3>
<p>إذا كنت تأخذ هذه الدورة على Coursera، فيجب عليك تسليم ملف مضغوط، وفقًا لتعليمات التسليم المنشورة على موقع Coursera. ولاحظ أنه بالإضافة إلى ملفات VM المترجمة، يجب أن يتضمّن تسليمك مجلدًا باسم &quot;source&quot;، يحتوي على جميع ملفات Jack المصدريّة لتطبيقك. وسيحكم مراجعو المشروع على تجربة المستخدم وكذلك على جودة شيفرة Jack خاصتك. وتأكّد من أن شيفرة Jack خاصتك قابلة للقراءة وموثّقة.</p>
<h3 id="برنامج-jack-نموذجي">برنامج Jack نموذجي</h3>
<p>Square Dance: يتيح هذا البرنامج التفاعلي البسيط للمستخدم تحريك مربّع رسومي على الشاشة:</p>
<p><img src="/arabic-cs-library/images/nand2tetris-2/project09-44046b_326ccb361f954c818e3038a42.webp" alt=""></p>
<p>ويمكن للمستخدم أيضًا التحكّم في حجم المربّع.</p>
<p>يُوضيّح تعامل البرنامج مع لوحة المفاتيح والشاشة ممارسات برمجية يمكن تطبيقها على تطوير تطبيقات Jack تفاعلية بشكل عام. لذلك، يُنصح باستكشاف شيفرة البرنامج، التي تُعطى أدناه.</p>
<p>وعند بدء تشغيل البرنامج، يظهر مربّع بحجم 30 في 30 بكسل في الزاوية العلوية اليسرى من الشاشة. ثم يستمع البرنامج للأحداث التالية لضغط المفاتيح ويستجيب لها:</p>
<ul>
<li>
<p>السهم الأيمن يحرّك المربّع إلى اليمين؛</p>
</li>
<li>
<p>السهم الأيسر يحرّك المربّع إلى اليسار؛</p>
</li>
<li>
<p>السهم الأعلى يحرّك المربّع إلى الأعلى؛</p>
</li>
<li>
<p>السهم الأسفل يحرّك المربّع إلى الأسفل؛</p>
</li>
<li>
<p>يزيد x حجم المربّع بمقدار 2 بكسل؛</p>
</li>
<li>
<p>ينقص z حجم المربّع بمقدار 2 بكسل؛</p>
</li>
<li>
<p>q يخرج من البرنامج.</p>
</li>
</ul>
<p>سرعة التحريك: يمكن التحكّم فيها بتغيير الثابت delay في الدالّة moveSquare داخل شيفرة مصدر الصنف SquareGame.jack.</p>
<p>شيفرة المصدر الخاصة ببرنامج Jack هذا متوفرة في مجلد nand2tetris/projects/09/Square على حاسوبك.</p>
<h3 id="ترجمة-تطبيق-jack-وتشغيله">ترجمة تطبيق Jack وتشغيله</h3>
<h3 id="أنشئ-مجلدا-مثل-myapp">- أنشئ مجلدًا، مثل MyApp.</h3>
<ul>
<li>
<p>اكتب تطبيقك، أي مجموعة من ملف .jack واحد أو أكثر، واحفظه في المجلد MyApp.</p>
</li>
<li>
<p>إذا أردت استخدام إصدار نظام التشغيل المترجم (مجموعة من 8 ملفات .vm)، فانسخ ملفات .vm هذه من مجلد nand2tetris/tools/os إلى مجلد MyApp خاصتك. أما إذا أردت استخدام إصدار نظام التشغيل المدمج في مُحاكٍ الآلة الافتراضية، فهذه الخطوة غير ضرورية.</p>
</li>
<li>
<p>استخدم مصرِّف Jack المرفق لترجمة المجلد MyApp. وسيترجم المصرِّف جميع أصناف .jack الموجودة في المجلد المعطى إلى ملفات .vm مكافئة. وإذا اشتكى المصرِّف من أخطاء، فصحّح ملف الصنف المعنيّ وأعد ترجمة MyApp حتى لا تبقى أخطاء.</p>
</li>
<li>
<p>لاختبار برنامجك، حمّل المجلد MyApp في مُحاكٍ الآلة الافتراضية المرفق. ثم شغّل البرنامج واختبره. وهناك مشكلات؟ صحّحها وأعد الترجمة.</p>
</li>
</ul>
<p>أي إصدار من نظام التشغيل تريد استخدامه فهو شأنك. والإصدار المدمج أسرع. ولا يهتمّ مُحاكٍ الآلة الافتراضية بالإصدار المستخدم، للسبب التالي: افترض أنك حمّلت مجلدًا في مُحاكٍ الآلة الافتراضية وبدأت تنفيذه. فكلما كشف المُحاكٍ عن نداء لأحدى الدوالّ على الشكل OSclass.function، يتحقّق مما إذا كانت هذه الدالّة متوفرة في قاعدة الشيفرة المحمّلة؛ فإن كانت متوفرة، ينفّذ شيفرة VM الخاصة بها؛ وإلا، فإنه يعود إلى استخدام التنفيذ المدمج لهذه الدالّة في نظام التشغيل. لذلك، يمكنك استخدام جميع ملفات أصناف نظام التشغيل المترجمة، أو بعضها، أو لا شيء منها، كما تراه مناسبًا. وهذه المرونة ستكون مفيدة جدًا حين نطوّر نظام Jack التشغيلي ونختبره وحدةً وحدةً في المشروع 12.</p>
<h3 id="بعض-النصائح-الإضافية">بعض النصائح الإضافية</h3>
<h3 id="للحصول-على-فكرة-حول-تطبيقك-شاهد-بعض-تطبيقات-nand2tetris-القائمة-يمتاز-قسم-quotcool-stuffquot-من-هذا-الموقع-بتطبيقات-مبهرة-ويمكنك-أن-تجد-المزيد-منها-على-youtube">- للحصول على فكرة حول تطبيقك، شاهد بعض تطبيقات Nand2Tetris القائمة. يمتاز قسم &quot;Cool Stuff&quot; من هذا الموقع بتطبيقات مبهرة، ويمكنك أن تجد المزيد منها على Youtube.</h3>
<ul>
<li>
<p>العب ببعض برامج Jack المرفقة في nand2Tetris/projects/09 وفي nand2Tetris/projects/11، وراجع شيفرتها.</p>
</li>
<li>
<p>خطّط لتطبيقك بعناية: صمّم جميع الكائنات الرسومية وتفاعل المستخدم على الورق. ثم فكّر في الأصناف، والدوالّ العضوية، وواجهة برمجة التطبيقات (API)، واستراتيجية الاختبار. ثم ابدأ في التنفيذ والاختبار.</p>
</li>
<li>
<p>التوثيق: استخدم حكمك واتّبع الممارسات القياسية.</p>
</li>
<li>
<p>التحسين: لتسريع سرعة التحريك، استخدم محرّر الصور النقطية المرفق في nand2tetris/projects/09.</p>
</li>
<li>
<p>مهم: استمتع!</p>
</li>
</ul>
`,d={book:n,chapter:t,chapterTitle:p,slug:a,title:e,headings:i,html:c};export{n as book,t as chapter,p as chapterTitle,d as default,i as headings,c as html,a as slug,e as title};
