const $="introtcs",n="lec_26_quantum_computing",e="Quantum Computing",t="index",a="الحساب الكمّي { #quantumchap }",p=[{depth:2,id:"تجربة-الشقين-المزدوجين",text:"تجربة الشقَّين المزدوجين"},{depth:2,id:"سعات-كمية",text:"سعات كمّية"},{depth:2,id:"متباينة-بل-bells-inequality",text:"متباينة بِل (Bell's Inequality)"},{depth:2,id:"غرابة-الكم",text:"غرابة الكمّ"},{depth:2,id:"الحوسبة-الكمية-والحساب-ملخص-تنفيذي",text:"الحوسبة الكمّية والحساب — ملخّص تنفيذي"},{depth:2,id:"الأنظمة-الكمية",text:"الأنظمة الكمّية"},{depth:3,id:"سعات-كمية",text:"سعات كمّية"},{depth:3,id:"ملخص",text:"ملخّص"},{depth:2,id:"تحليل-متباينة-بل-اختياري",text:"تحليل متباينة بِل (اختياري)"},{depth:2,id:"الحوسبة-الكمية",text:"الحوسبة الكمّية"},{depth:3,id:"الدوائر-الكمية",text:"الدوائر الكمّية"},{depth:3,id:"برامج-qnand-circ-اختياري",text:"برامج QNAND-CIRC (اختياري)"},{depth:3,id:"الحساب-المنتظم",text:"الحساب المنتظم"},{depth:2,id:"التحقق-الفيزيائي-من-الحوسبة-الكمية",text:"التحقّق الفيزيائيّ من الحوسبة الكمّية"},{depth:2,id:"خوارزمية-شور-سماع-شكل-العوامل-الأولية",text:"خوارزمية شور: سماع شكل العوامل الأوّليّة"},{depth:3,id:"إيجاد-الدورية",text:"إيجاد الدورية"},{depth:3,id:"خوارزمية-شور-نظرة-من-مرتفع",text:"خوارزمية شور: نظرة من مرتفع"},{depth:2,id:"تحويل-فورييه-الكمي-متقدم-اختياري",text:"تحويل فورييه الكمّي (متقدّم، اختياري)"},{depth:3,id:"تحويل-فورييه-الكمي-فوق-المكعب-البولياني-خوارزمية-سيمون",text:"تحويل فورييه الكمّي فوق المكعّب البولياني: خوارزمية سيمون"},{depth:3,id:"من-فورييه-إلى-إيجاد-الدورية-خوارزمية-سيمون-متقدمة-اختيارية",text:"من فورييه إلى إيجاد الدورية: خوارزمية سيمون (متقدّمة، اختياريّة)"},{depth:3,id:"من-سيمون-إلى-شور-متقدمة-اختيارية",text:"من سيمون إلى شور (متقدّمة، اختياريّة)"},{depth:2,id:"التمارين",text:"التمارين"},{depth:2,id:"ملاحظات-المراجع-quantumbibnotessec",text:"ملاحظات المراجع { #quantumbibnotessec }"},{depth:2,id:"استكشافات-إضافية",text:"استكشافاتٌ إضافية"},{depth:2,id:"شكر-وتقدير",text:"شكر وتقدير"}],o=`<h1>الحساب الكمّي { #quantumchap }</h1>
<blockquote>
<h1>{ .objectives }</h1>
</blockquote>
<ul>
<li>الجوانب الرئيسية التي تختلف فيها الميكانيكا الكمّية عن النظريات الحتمية المحلية \\</li>
<li>نموذج الدوائر الكمّية، أو ما يماثله من برامج QNAND-CIRC \\</li>
<li>صنف التعقيد $\\mathbf{BQP}$ وما نعرفه عن علاقته بالأصناف الأخرى \\</li>
<li>الأفكار الكامنة وراء خوارزمية شور وتحويل فورييه الكمّي</li>
</ul>
<blockquote>
<p><em>&quot;لقد واجهنا على الدوام (سرّ، سرّ، أغلقوا الأبواب!) ... صعوبة بالغة في فهم تصوّر العالم الذي تمثّله الميكانيكا الكمّية ... ولم يتبيّن لي بعد أنّه لا توجد مشكلة حقيقية. ... هل يمكنني أن أتعلّم شيئًا من طرح هذا السؤال عن الحاسوب؟&quot;</em>, ريتشارد فايمان، 1981</p>
</blockquote>
<blockquote>
<p><em>&quot;الفرق الوحيد بين عالم كلاسيكي احتمالي ومعادلات العالم الكمّي هو أنّه، بطريقة أو بأخرى، يبدو وكأنّ الاحتمالات لا بدّ من أن تصبح سالبة&quot;</em>, ريتشارد فايمان، 1981</p>
</blockquote>
<p>كان في اليونان القديمة مدرستان في فلسفة الطبيعة.
آمن <em>أرسطو</em> بأنّ للأشياء <em>جوهرًا</em> يشرح سلوكها، وأنّ نظرية للعالم الطبيعي لا بدّ أن تشير إلى <em>الأسباب</em> (أو &quot;السبب الغائي&quot; بلغة أرسطو) التي تجعل هذه الأشياء تُبدي ظواهر معيّنة.
آمن <em>ديمقريطس</em> بتفسير ميكانيكي بحت للعالم.
وفي رأيه، تألّف الكون في النهاية من جسيمات أوّلية (أو <em>ذَرّات</em>)، وتنشأ الظواهر التي نلاحظها عن تفاعلات هذه الجسيمات بعضها ببعض وفق قواعد محلية ما.
وقد تبنّى العلم الحديث (يمكن القول إنّما بدأ بنيوتن) وجهة نظر ديمقريطس، أي كونيّ ميكانيكي أو &quot;كآلية الساعة&quot; من جسيمات وقوى تعمل عليها.</p>
<p>في حين تطوّر تصنيف الجسيمات والقوى مع الزمن، لم تتغيّر &quot;الصورة الكبرى&quot; إلى حدٍّ بعيد من نيوتن حتى أينشتاين.
وبخاصة، كان يُؤخذ كبدهيّة أنّنا لو عرفنا <em>حالة</em> الكون الحالية (أي الجسيمات وخصائصها كالموقع والسرعة) فحصريًّا، لاستطعنا التنبّؤ بحالته المستقبلية عند أيّ لحظة من الزمن.
ولغة الحوسبة، في كلّ هذه النظريات يمكن تخزين حالة نظام يتكوّن من $n$ جسيمات في مصفوفة من $O(n)$ عدد، ويمكن التنبّؤ بتطوّر النظام بتشغيل حساب حتمي كَفء (مثلًا بزمن $poly(n)$) على هذه المصفوفة.</p>
<h2 id="تجربة-الشقين-المزدوجين">تجربة الشقَّين المزدوجين</h2>
<p>للأسف، في مطلع القرن العشرين، كانت عدّة نتائج تجريبية تُشكّك في نظرية العالم هذه ذات &quot;آلية الساعة&quot; أو &quot;كرات البلياردو&quot;.
وإحدى هذه التجارب هي <a href="https://en.wikipedia.org/wiki/Double-slit_experiment">تجربة الشقَّين المزدوجين</a> الشهيرة.
وهذه إحدى طرائق وصفها.
لنفترض أنّنا اشترينا إحدى آلات رمي كرات البيسبول، ووجّهناها نحو جدارٍ بلاستيكيٍّ لين، لكنّنا وضعنا بين الآلة والجدار البلاستيكي <em>حاجزًا معدنيًّا بشقٍّ واحد</em> (انظر <a href="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-1.webp">doublebaseballfig</a>{.ref}).
فإذا رجمنا كرات البيسبول نحو الجدار البلاستيكي، فإنّ بعضها سيرتدّ عن الحاجز المعدنيّ، بينما سيمرّ بعضها الآخر من الشقّ ويترك أثرًا في الجدار.
وإذا شقّدنا الآن شقًّا إضافيًّا في الحاجز المعدنيّ، ليمرّ عدد أكبر من الكرات، فيصبح الجدار البلاستيكيّ <em>متضرّسًا أكثر</em>.</p>
<p><img src="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-1.webp" alt="/images/introtcs/lec_26_quantum_computing-1.webp">{#doublebaseballfig .margin width=300px height=300px}</p>
<p>إلى هنا، كلّ هذا هو الحسّ السليم المجرّد، وهو بالفعل (حسب علمي) وصفٌ دقيق لما يحدث عندما نرمي كرات البيسبول على جدارٍ بلاستيكيّ.
لكنّ الأمر ليس كذلك عندما نرمي <em>الفوتونات</em>.
وهذا مدهش: إن رجمنا بـ&quot;مدفع فوتونات&quot; (أي ليزر) عبر حاجبٍ ما نحو جدارٍ مزوّد بكاشفات فوتونات، فإنّه (كما هو مبيّن في <a href="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-2.webp">doubleslitfig</a>{.ref}) سنرى في بعض مواضع الجدار عددًا <em>أقلّ</em> من الإصابات عندما يكون الشقّان مفتوحين ممّا يكون عليه عندما يكون أحدهما مفتوحًا فقط.^[يوجد وصفٌ توضيحي جيّد لتجربة الشقَّين المزدوجين في <a href="https://www.youtube.com/watch?v=DfPeprQ7oGc">هذا الفيديو</a>.]
وبخاصة، هناك مواضع في الجدار تصيبها الكرات عندما يكون الشقّ الأوّل مفتوحًا، وتصيبها الكرات عندما يكون الشقّ الثاني مفتوحًا، ولا تُصاب <em>إطلاقًا</em> عندما يكون الشقّان مفتوحين معًا!</p>
<p><img src="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-2.webp" alt="/images/introtcs/lec_26_quantum_computing-2.webp">{#doubleslitfig .margin width=300px height=300px}</p>
<p>يبدو وكأنّ كلّ فوتون يخرج من المدفع واعيًا بالتكوين العامّ للتجربة، ومتصرّفًا بشكلٍ مختلف إذا كان الشقّان مفتوحين عمّا يكون عليه إذا كان أحدهما مفتوحًا فقط.
وإذا حاولنا &quot;الإمساك بالفوتون متلبّسًا&quot; فوضعنا كاشفًا بجوار كلّ شقّ مباشرةً لنرى بالضبط المسار الذي يسلكه كلّ فوتون، فإنّ شيئًا أغرب بكثير يحدث.
فمجرّد أنّنا <em>نقيس</em> المسار يغيّر سلوك الفوتون، ويختفي نمط &quot;التداخل الهدّام&quot; هذا، ويصبح عدد مرّات إصابة الموضع الواحد عندما يكون الشقّان مفتوحين هو مجموع عدد مرّات إصابته عندما يكون كلّ شقّ مفتوحًا بمفرده.</p>
<blockquote>
<h1>{ .pause }</h1>
</blockquote>
<p>ينبغي أن تقرأ الفقرات أعلاه أكثر من مرّة، وتتأكّد من إدراك مدى هول هذه النتائج حقًّا.</p>
<h2 id="سعات-كمية">سعات كمّية</h2>
<p>أجبرت تجربة الشقّين المزدوجين وتجارب أخرى في النهاية العلماءَ على قبول تصوّرٍ شاقٍّ للنقيض من البديهة عن العالم.
وليس الأمر مجرّد أنّ الطبيعة عشوائية، بل إنّ المقصود أنّ الاحتمالات &quot;تصبح سالبة&quot; بمعنىً ما وتلغي بعضها بعضًا!</p>
<p>ولكي نرى ما نعنيه بذلك، لنعد إلى تجربة البيسبول.
لنفترض أنّ احتمال مرور الكرة من الشقّ الأيسر هو $p_L$ وأنّ احتمال مرورها من الشقّ الأيمن هو $p_R$.
عندئذٍ، إن رجمنا $N$ كرة من كلّ مدفع، نتوقّع أن يُصاب الجدار $(p_L+p_R)N$ مرّة.
وفي المقابل، في العالم الكمّي للفوتونات بدلًا من كرات البيسبول، قد يحدث أحيانًا أنّ الجدار يُصاب في كلٍّ من الحالتين الأولى والثانية باحتمالات موجبة $p_L$ و$p_R$ على التوالي، ثمّ بطريقة ما، عندما يكون الشقّان مفتوحين معًا، لا يُصاب الجدار (أو موضعٌ بعينه فيه) إطلاقًا.
وكأنّ الاحتمالات تستطيع &quot;أن تلغي بعضها بعضًا&quot;.</p>
<p>لفهم الطريقة التي نمذج بها هذا في الميكانيكا الكمّية، من المفيد التفكير في المقاربة &quot;الكسولة&quot; (<em>lazy evaluation</em>) للاحتمالات.
ويمكننا التفكير في تجربة احتمالية مثل رمي كرة بيسبول من شقّين بطريقتين:</p>
<ul>
<li>
<p>عند رمي الكرة، ترمي &quot;الطبيعة&quot; قطعة نقد وتقرّر ما إذا كانت الكرة ستمرّ من الشقّ الأيسر (وهذا يحدث باحتمال $p_L$)، أو من الشقّ الأيمن (وهذا يحدث باحتمال $p_R$)، أو ترتدّ عكسيًا. فإذا مرّت الكرة من أحد الشقّين فإنّها ستصيب الجدار. ويمكننا لاحقًا أن ننظر إلى الجدار فنعرف ما إذا كان هذا الحدث قد وقع أم لا، لكنّ وقوع هذا الحدث من عدمه يُقرَّر بمعزلٍ عن النظر في الجدار من عدمه.</p>
</li>
<li>
<p>والزاوية الأخرى أنّ &quot;الطبيعة&quot;، عند رمي الكرة، تحسب الاحتمالات $p_L$ و$p_R$ كما سبق، لكنّها لا &quot;ترمي قطعة النقد&quot; بعد، ولا تحدّد ما الذي حدث.
فقط عندما ننظر فعلًا إلى الجدار، ترمي &quot;الطبيعة&quot; قطعة نقد، وتضمن باحتمال $p_L+p_R$ أن نرى أثرًا. أي إنّ الطبيعة تستخدم &quot;التقييم الكسول&quot;، ولا تحدّد نتيجة التجربة الاحتمالية إلّا حين نقرّر <em>أن نقيسها</em>.</p>
</li>
</ul>
<p>في حين يبدو السيناريو الأوّل أكثر طبيعةً بكثير، فإنّ النتيجة النهائيّة في الحالتين واحدة (يُصاب الجدار باحتمال $p_L+p_R$)، وعليه فإنّ السؤال عمّا إذا كان علينا أن نمذج الطبيعة على أنّها تتبع السيناريو الأوّل أم الثاني يبدو كالسؤال عن الشجرة المثلّة في الغابة التي لا يسمع سقوطها أحد.</p>
<p>لكنّ حين نريد وصف تجربة الشقّين المزدوجين بالفوتونات لا بكرات البيسبول، فإنّ السيناريو الثاني هو الذي يميل إلى التعميم الكمّي أكثر.</p>
<p>تربط الميكانيكا الكمّية بكلّ تجربة احتمالية عددًا $\\alpha$ يُعرف بـ_السعة_ (amplitude).
ويمكن لهذا العدد $\\alpha$ أن يكون <em>سالبًا</em>، بل وحتى <em>معقّدًا</em>.
نحن لا نلاحظ السعات أبدًا بشكلٍ مباشر، ذلك أنّ كلّما <em>قِسنا</em> حدثًا سعته $\\alpha$ ترمي الطبيعة قطعة نقد وتحدّد أنّ الحدث يقع باحتمال $|\\alpha|^2$.
لكنّ إشارة السعات (أو طورها في الحالة المعقّدة) تؤثّر في ما إذا كان بين حدثين مختلفين تداخل <em>بنّاء</em> أم تداخل <em>هدّام</em>.</p>
<p>وبحدّة، لنفكّر في حدثٍ إما أن يقع أو لا يقع (مثل &quot;أن يصيب الكاشف رقم 17 فوتون&quot;).
في الاحتمالات الكلاسيكية، نمذجه بتوزيع احتمالي على ناتجين اثنين: زوجٍ من الأعداد غير السالبة $p$ و$q$ بحيث $p+q=1$، حيث يمثّل $p$ احتمال وقوع الحدث ويمثّل $q$ احتمال عدم وقوعه.
وفي الميكانيكا الكمّية، نمذجه أيضًا بزوجٍ من الأعداد نسمّيهما <em>سعتين</em>.
وهو زوجٌ من الأعداد $\\alpha$ و$\\beta$ (قد تكون سالبة بل معقّدة) بحيث $|\\alpha|^2 + |\\beta|^2 =1$.
احتمال وقوع الحدث هو $|\\alpha|^2$، واحتمال عدم وقوعه هو $|\\beta|^2$.
وبمعزلها، لا يهمّ كثيرًا هذا العدد السالب أو المعقّد، فنحن نربّعها على أيّ حال للحصول على الاحتمالات.
لكنّ تفاعل السعات الموجبة مع السالبة قد ينتج <em>إلغاءات</em> مفاجئة، بحيث ينتج عن دمج سيناريوهين يقع في كلٍّ منهما الحدث باحتمال موجب، سيناريو لا يقع فيه إطلاقًا.</p>
<p>::: { .pause }
إن لم تجد الوصف أعلاه محيّرًا وغير بديهيّ، فالأرجح أنّك لم تفهمه.
تأكّد من إعادة قراءة الفقرات أعلاه إلى أن تختلط عليك الأمور تمامًا.
:::</p>
<p>الميكانيكا الكمّية نظرية رياضية تتيح لنا حساب نتائج تجربة الشقّين المزدوجين وكثير من التجارب الأخرى والتنبّؤ بها.
وإن فكّرت في الميكانيكا الكمّية على أنّها تفسير لما يجري &quot;فعلًا&quot; في العالم، فقد تكون مربكةً إلى حدٍّ ما.
لكنّك إن اكتفت ببساطة بأن &quot;أسكت وأحسب&quot; فإنّها تعمل على نحوٍ مذهل في التنبّؤ بالنتائج التجريبية.
وبخاصة، في تجربة الشقّين المزدوجين، لأيّ موضع في الجدار يمكننا حساب أعداد $\\alpha$ و$\\beta$ بحيث تصيب الفوتونات الصادرة من الشقّ الأوّل والثاني ذلك الموضع باحتمالات $|\\alpha|^2$ و$|\\beta|^2$ على التوالي.
وحين نفتح الشقّين معًا، يكون احتمال إصابة الموضع متناسبًا مع $|\\alpha+\\beta|^2$، وعليه فبخاصة، إن كان $\\alpha=-\\beta$، فإنّ الموضع — رغم أنّه يُصاب عندما يكون الشقّ الأوّل أو الشقّ الثاني مفتوحًا — لا يُصاب <em>إطلاقًا</em> حين يكونان مفتوحين معًا.
وإن كنت محتارًا بسبب الميكانيكا الكمّية فأنت لست وحدك: فقد سعى الناس طوال عقود إلى ابتكار <a href="https://en.wikipedia.org/wiki/Interpretations_of_quantum_mechanics">تفسيرات</a> لـ&quot;الواقع المتجذّر&quot; وراء الميكانيكا الكمّية، منها <a href="https://en.wikipedia.org/wiki/De_Broglie%E2%80%93Bohm_theory">ميكانيكا بوم</a> و<a href="https://en.wikipedia.org/wiki/Many-worlds_interpretation">العوالم المتعدّدة</a> وغيرها.
لكنّ أيًّا من هذه التأويلات لم يحظَ بقبولٍ عامّ، وكلّها (بتصميمها) تعطي التنبّؤات التجريبيّة نفسها.
وعليه، فإنّ كثيرًا من العلماء يفضّلون في هذه المرحلة تجاهل سؤال ما هو &quot;الواقع الحقيقي&quot;، والعودة إلى مجرّد &quot;الإسكات والحساب&quot;.</p>
<p>::: {.remark title=&quot;معقّد مقابل حقيقي، تبسيطات أخرى&quot; #complexrem}
إن كنت (مثل المؤلف) تخشى الأعداد المعقّدة قليلًا، فلا تقلق: يمكنك أن تعتبر كلّ السعات أعدادًا <em>حقيقية</em> (رغم أنها قد تكون <em>سالبة</em>) دون أيّ خسارة في الفهم.
فكلّ &quot;السحر&quot; الخاصّ بالحوسبة الكمّية نشأ أصلًا في هذه الحالة، ولذلك سنكتفي في هذا الفصل في كثير من الأحيان بالسعات الحقيقيّة.</p>
<p>كما أننا لن نتناول سوى ما يُسمّى الحالات الكمّية <em>الخالصة</em> (<em>pure</em>)، لا المفهوم الأكثر عمومية وهو الحالات <em>المختلطة</em> (<em>mixed</em>).
وتبيّن أنّ الحالات الخالصة تكفي لفهم الجوانب الخوارزميّة من الحوسبة الكمّية.</p>
<p>وبشكل أعمّ، هذا الفصل ليس لوصفٍ كامل للميكانيكا الكمّية ولا لنظرية المعلومات الكمّية ولا للحوسبة الكمّية، بل الغرض منه بيان النقاط الرئيسيّة التي تختلف فيها هذه عن الحوسبة الكلاسيكيّة.
:::</p>
<h2 id="متباينة-بل-bells-inequality">متباينة بِل (Bell's Inequality)</h2>
<p>في الميكانيكا الكمّية شيءٌ غريب.
وفي عام 1935، حاول <a href="http://plato.stanford.edu/entries/qt-epr/">آينشتاين وبودولسكي وروزن (EPR)</a> تحديد هذه المسألة عبر إبراز نتيجةٍ لازمة لهذه النظرية لم يُنتبه إليها من قبل.
بيّنوا أنّ الفكرة القائلة إنّ الطبيعة لا تحدّد نتائج التجربة إلّا حين تُقاس، تؤدّي إلى ما يُسمّى &quot;التأثير المرعب عن بُعد&quot;.
أي إنّ إجراء قياسٍ على جسمٍ ما قد يؤثّر فورًا في حالة (أي متّجه سعات) جسمٍ آخر في الطرف المقابل من الكون.</p>
<p>ولأنّ متّجه السعات ليس سوى تجريدٍ رياضي، فإنّ ورقة EPR عُدّت مجرّد تجربةٍ فكرية تشغل الفلاسفة، ولا علاقة لها بالتجارب.
لكنّ هذا تغيّر حين عرض جون بِل عام 1965 تجربةً فعلية لاختبار تنبّؤات EPR، ومن ثمّ واجه الحسّ السليم الحدسيّ بالميكانيكا الكمّية.
وفازت الميكانيكا الكمّية: إذ تبيّن أنّه <em>بالفعل</em> يمكن استخدام القياسات لإنشاء ارتباطات بين حالات أجسامٍ متباعدةٍ جدًّا عن بعضها، لا يستطيع أيّ نظريةٍ سابقة تفسيرها.
لكنّ، ولأنّ نتائج هذه التجارب تبدو &quot;خاطئة&quot; إلى حدٍّ واضح لأيّ شخصٍ جلس يومًا في كرسيٍّ مريح، ما زال هناك عددٌ من <a href="http://www.scottaaronson.com/blog/?p=2464">منكري متباينة بِل</a> يزعمون أنّ هذا لا يمكن أن يكون صحيحًا وأنّ الميكانيكا الكمّية خاطئة.</p>
<p>إذًا، ما هي متباينة بِل هذه؟
لنفترض أنّ أليس وبوب يحاولان إقناعك بأنّ لديهما قدرةً على التنبّؤ الذهنيّ، ويريدان إثبات ذلك عبر التجربة التالية.
سيكون أليس وبوب في غرفٍ مغلقة منفصلة.^[إن كنت شديدة الوسواس باحتمال أن يتواصل أليس وبوب فيما بينهما، يمكنك التنسيق مع مساعدك لإجراء التجربة في اللحظة نفسها تمامًا، والتأكّد من أنّ الغرف متباعدة بما يكفي (مثلًا تقع في قارّتين مختلفتين، أو حتى إحداهما على القمر والأخرى على الأرض) بحيث لا يتمكّن أليس وبوب من التواصل مع بعضهما في الوقت المناسب حتى لو فعلا ذلك بسرعة الضوء.]
أنت ستستجوب أليس، ومساعدك سيستجوب بوب.
تختار أنت بتًّا عشوائيًّا $x\\in{0,1}$، ويختار مساعدك بتًّا عشوائيًّا $y\\in{0,1}$.
ونترك $a$ لتكون إجابة أليس، و$b$ لتكون إجابة بوب.
ونقول إنّ أليس وبوب يفوزان في هذه التجربة إذا تحقّق $a \\oplus b = x \\wedge y$.
بمعنى آخر، يحتاج أليس وبوب إلى إخراج بتّين <em>يتناقضان</em> إذا كان $x=y=1$، و_يتّفقان_ في غير ذلك.^[أثبت هذه الصيغة من لعبة بِل كلوزر وهورن وشيموني وهولت (<a href="https://goo.gl/wvJGZU">Clauser, Horne, Shimony, and Holt</a>).]</p>
<p>الآن، إن لم يكونا أليس وبوب تنبّؤيين ذهنيًّا، فإنّهما يحتاجان إلى الاتفاق مسبقًا على استراتيجية ما.
وليس صعبًا على أليس وبوب أن ينجحا باحتمال $3/4$: يكفي أن يُخرجا دائمًا البتّ نفسها.
علاوةً على ذلك، بإجراء بعض تحليل الحالات، يمكننا أن نبيّن أنّه مهما كانت الاستراتيجية التي يستعملانها، لا يمكن لأليس وبوب أن ينجحا باحتمالٍ أعلى من ذلك:^[<a href="http://theory.cs.princeton.edu/complexity/">bellthm</a>{.ref} أدناه تفترض أنّ أليس وبوب يستعملان استراتيجيتين <em>حتميتين</em> $f$ و$g$ على التوالي. وبشكل أعمّ، يمكن لأليس وبوب أن يستخدما استراتيجية <em>عشوائيّة</em>، أو بما يعادلها، أن يختار كلٌّ منهما $f$ و$g$ من <em>توزيعين</em> $\\mathcal{F}$ و$\\mathcal{G}$ على التوالي. لكنّ <em>مبدأ المتوسّط</em> (<a href="http://theory.cs.princeton.edu/complexity/ab_quantumchap.pdf">averagingprinciplerem</a>{.ref}) يقتضي أنّه إذا كانت كلّ الاستراتيجيات الحتميّة الممكنة تنجح باحتمالٍ لا يتجاوز $3/4$، فإنّ الأمر نفسه ينطبق على كلّ الاستراتيجيات العشوائيّة.]</p>
<blockquote>
<h1>{.theorem title=&quot;متباينة بِل&quot; #bellthm}</h1>
</blockquote>
<p>لكلّ دالتين $f,g:{0,1}\\rightarrow{0,1}$، $\\Pr_{x,y \\in {0,1}}[  f(x) \\oplus g(y) = x \\wedge y] \\leq 3/4$.</p>
<p>::: {.proof data-ref=&quot;bellthm&quot;}
بما أنّ الاحتمال يُؤخذ على اختيارَي $x,y \\in {0,1}$ الأربعة جميعًا، فإنّ الطريقة الوحيدة التي يمكن بها خرقُ هذه النظرية هي أن توجد دالتان $f,g$ تحقق</p>
<p>$$f(x) \\oplus g(y) = x \\wedge y$$</p>
<p>لكلّ الاختيارات الأربعة لـ $x,y \\in {0,1}^2$.
لنُدخِل هذه الاختيارات الأربعة جميعًا ونرى ما الذي نحصل عليه (على النحو التالي نستخدم التساويات $z \\oplus 0 = z$ و$z \\wedge 0=0$ و$z \\wedge 1 = z$):</p>
<p>$$
\\begin{aligned}
f(0) &amp;\\oplus g(0) &amp;= 0;;;; &amp;(\\text{plugging in } x=0,y=0) \\
f(0) &amp;\\oplus g(1) &amp;= 0;;;; &amp;(\\text{plugging in } x=0,y=1) \\
f(1) &amp;\\oplus g(0) &amp;= 0;;;; &amp;(\\text{plugging in } x=1,y=0) \\
f(1) &amp;\\oplus g(1) &amp;= 1;;;; &amp;(\\text{plugging in } x=1,y=1)
\\end{aligned}
$$</p>
<p>إن طبّقنا XOR على التساويين الأوّل والثاني معًا نحصل على $g(0) \\oplus g(1) = 0$، بينما إن طبّقنا XOR على التساويين الثالث والرابع نحصل على $g(0) \\oplus g(1) = 1$، ومن ثمّ نحصل على تناقض.
:::</p>
<p>من الحقائق المذهلة التي <a href="http://arxiv.org/abs/1508.05949">تحقّقت تجريبيًّا</a> أنّ الميكانيكا الكمّية تسمح بـ&quot;التنبّؤ الذهنيّ&quot;.[^telepathy]
وبحدّة، ثبت أنّه باستغلال غرابة الميكانيكا الكمّية، هناك بالفعل استراتيجيةٌ ينجح بها أليس وبوب في هذه اللعبة باحتمالٍ أكبر من $3/4$ (بل إنّهما يمكنهما النجاح باحتمالٍ نحو $0.85$، انظر <a href="http://www.scottaaronson.com/democritus/lec14.html">bellstrategy</a>{.ref}).</p>
<p>[^telepathy]: وبدقّة أكبر، إمّا أن تتخلّى عن نظرية كونٍ من نوع &quot;كرات البلياردو&quot;، أو أن تصدّق التنبّؤ الذهنيّ (سواء صدّقته أم لا، فإنّ بعض العلماء ذهبوا إلى <a href="https://en.wikipedia.org/wiki/Superdeterminism">الخيار الثاني</a>).</p>
<h2 id="غرابة-الكم">غرابة الكمّ</h2>
<p>من بين الخصائص المناقضة الحدس النشئة عن الميكانيكا الكمّية نذكر:</p>
<ul>
<li>
<p><strong>التداخل</strong> (<em>interference</em>) - كما رأينا، يمكن للسعات الكمّية أن &quot;تلغي بعضها بعضًا&quot;.</p>
</li>
<li>
<p><strong>القياس</strong> (<em>measurement</em>) - إنّ الفكرة بأنّ السعات تكون سالبة ما دام &quot;لا أحد ينظر&quot;، ثمّ &quot;تنهار&quot; (بربيعها) إلى احتمالاتٍ موجبة حين تُقاس <em>بـ</em>، هي فكرةٌ مقلقة إلى حدٍّ عميق. بالفعل، كما بيّن EPR وبِل، فإنّ هذا يؤدّي إلى نتائج غريبة متعدّدة مثل &quot;التأثيرات المرعبة عن بُعد&quot;، حيث يمكننا إنشاء ارتباطات بين نتائج قياساتٍ في أماكن متباعدةٍ جدًّا. وللأسف (أو للحسن؟) فإنّ هذه النتائج الغريبة قد تأكّدت تجريبيًّا.</p>
</li>
<li>
<p><strong>التشابك</strong> (<em>entanglement</em>) - إنّ فكرة أنّ جزأين من النظام قد يرتبطان بهذه الطريقة الغريبة التي يكون فيها قياس أحدهما مؤثّرًا في الآخر تُعرف بـ_التشابك الكمّي_.</p>
</li>
</ul>
<p>وكما أنّ هذه المفاهيم مناقضة للحدس إلى حدٍّ كبير، فقد تأكّدت تجريبيًّا، فعلينا فقط أن نتعايش معها.</p>
<blockquote>
<h1>{.remark title=&quot;المزيد عن الكمّ&quot; #quantumsources}</h1>
</blockquote>
<p>مناقشة هذه المحاضرة قصيرةٌ جدًّا وليست سطحيّة تمامًا.
فصل الحوسبة الكمّية في <a href="http://theory.cs.princeton.edu/complexity/">كتابي مع أورورا</a> (انظر <a href="http://theory.cs.princeton.edu/complexity/ab_quantumchap.pdf">المسوّدة هنا</a>) هو مصدرٌ قصيرٌ نسبيًّا يحتوي بشكلٍ أساسي كلّ ما نتناوله هنا وأكثر.
انظر أيضًا <a href="http://www.scottaaronson.com/blog/?p=208">تدوينة سكوت آرونسون</a> هذه للحصول على شرحٍ عالي المستوى لخوارزمية شور، وهي تنتهي بروابط إلى عدة شروحٍ أكثر تفصيلًا.
و<a href="http://www.scottaaronson.com/democritus/lec14.html">هذه المحاضرة</a> لآرونسون تحتوي مناقشةً ممتازة حول جدوى الحوسبة الكمّية (كذلك تُعدّ <a href="http://www.scottaaronson.com/democritus/default.html">ملاحظات محاضرات مساقه</a> و<a href="http://www.amazon.com/Quantum-Computing-since-Democritus-Aaronson/dp/0521199565">الكتاب</a> اللذان أنتجتهما قراءتان رائعتان أيضًا).
وتتضمّن فيديوهات <a href="https://www.youtube.com/playlist?list=PLDAjb_zu5aoFazE31_8yT0OfzsTcmvAVg">مساق إيد إكس لأوميش فازيراني</a> مقدّمةً في متناول اليد وموصى بها إلى الحوسبة الكمّية.
وانظر قسم &quot;ملاحظات المراجع&quot; في نهاية هذا الفصل لمزيد من المصادر.</p>
<h2 id="الحوسبة-الكمية-والحساب-ملخص-تنفيذي">الحوسبة الكمّية والحساب — ملخّص تنفيذي</h2>
<p>من الجوانب الغريبة في التصوّر الكمّي-الميكانيكيّ للعالم أنّه، على خلاف مثال كرات البلياردو، لا توجد خوارزميّةٌ بديهية لمحاكاة تطوّر $n$ جسيمات خلال $t$ حقبة زمنية في $poly(n,t)$ خطوة.
وفي الواقع، فإنّ الطريقة الطبيعيّة لمحاكاة $n$ جسيمًا كمّيًّا ستتطلّب عددًا من الخطوات <em>أسّيًّا</em> في $n$.
وهذا صداعٌ هائل للعلماء الذين يحتاجون فعلًا إلى إجراء هذه الحسابات في الممارسة العمليّة.</p>
<p>وفي عام 1981 اقترح الفيزيائي ريتشارد فايمان أن &quot;يحوّل هذا الليمون إلى عصير الليمون&quot;، عبر الملاحظة شبه البديهية التالية:</p>
<blockquote>
<p>إذا لم يستطع حاسوبٌ محاكاة نظامٍ فيزيائي في $T$ خطوة، فيُعتبر النظام وكأنّه يؤدّي حسابًا يستغرق أكثر من $T$ خطوة.</p>
</blockquote>
<p>وعليه، فقد سأل: هل يمكن تصميم نظامٍ كمّيّ تكون نتيجته $y$ انطلاقًا من الشرط الابتدائي $x$ هي دالّة $y=f(x)$ بحيث <strong>(أ)</strong> لا نعرف كيف نحسبها بكفاءة بأيّ طريقة أخرى، و**(ب)** تكون نافعةً فعلًا في شيءٍ ما.[^Feynman]
وفي عام 1985 اقترح ديفيد دويتش رسميًّا فكرة آلة تورينج الكمّية، وقد طوُّر هذا النموذج منذ ذلك الحين في أعمال دويتش وجوزا وبرنشتاين وفازيراني.
ويُعرف مثل هذا النظام اليوم بأنّه <em>حاسوب كمّي</em>.</p>
<p>[^Feynman]: وكما يوحي عنوانها، كانت <a href="https://www.cs.berkeley.edu/~christos/classics/Feynman.pdf">محاضرة</a> فايمان تركّز فعليًّا على الجانب المقابل لمحاكاة الفيزياء بحاسوب. لكنّه أشار، بوصفه &quot;ملاحظة جانبيّة&quot;، إلى أنّ المرء يمكن أن يتساءل عمّا إذا كان من الممكن محاكاة الفيزياء بحاسوبٍ من نوعٍ جديد — &quot;حاسوب كمّي&quot; لا &quot;[يكون] آلة تورينج، بل آلةً من نوعٍ آخر&quot;. وحسب علمي، لم يقترح فايمان أنّ مثل هذا الحاسوب قد يكون نافعًا لحساباتٍ تقع خارجةً تمامًا عن مجال محاكاة الكمّ. وفي الواقع، كان أكثر اهتمامًا بسؤال ما إذا كانت الميكانيكا الكمّية يمكن محاكاتها بحاسوبٍ كلاسيكيّ.</p>
<p>لمدّة من الوقت بدت هذه الحواسيب الكمّية الافتراضية نافعةً لأحد أمرين.
فالأوّل، لتوفير آليةٍ عامّة الغرض لمحاكاة مجموعةٍ متنوّعة من الأنظمة الكمّية الحقيقيّة التي يهتمّ بها الناس، مثل التفاعلات المختلفة داخل الجزيئات في الكيمياء الكمّية.
والثاني، كتبرٍّ لـ_فرضية كنيسة-تورينج الموسَّعة_ التي تقول إنّ كلّ جهاز حساب قابل للتحقيق فيزيائيًّا يمكن نمذجته (حتى تكلفة متعدّدة الحدود) بواسطة آلات تورينج (أو بما يعادلها، برامج NAND-TM / NAND-RAM).</p>
<p>الكيمياء الكمّية مهمّة (وفهمها بالتحديد قد يكون عنق زجاجة في تصميم موادّ جديدة وأدوية وغيرها)، لكنّها ما زالت مجالًا ضيّقًا نوعًا ما ضمن السياق الأوسع لتطبيقات الحوسبة (وحتى الحوسبة العلميّة).
وعليه، فلفترة من الوقت ظنّ معظم الباحثين (إلى الحدّ الذي كانوا واعين له) أنّ الحواسيب الكمّية فضولٌ نظريّ لا صلة له تقريبًا بالممارسة، إذ بدا أنّ هذه &quot;القوّة الإضافية&quot; النظرية لا تقدّم ميزةً تُذكر في أغلب المسائل التي يريد الناس حلّها في مجالات مثل التحسين التوافقيّ والتعلّم الآليّ وبنى البيانات وغيرها.</p>
<p>إلى حدٍّ ما، لا يزال هذا صحيحًا اليوم. وحسب علمي، لن توفّر الحواسيب الكمّية — إن بُنيت — تسريعًا أسّيًّا لـ 95% من تطبيقات الحوسبة.[^overhead]
وبخاصة، وحسب علمي، لن تساعدنا الحواسيب الكمّية على حلّ مسائل $\\mathbf{NP}$ الكاملة في زمن متعدّد الحدود أو حتى تحت-أسّيّ، وإنّما <em>خوارزمية غروفير</em> (<a href="https://en.wikipedia.org/wiki/Unitary_matrix">quantumnp</a>{.ref}) تمنح ميزةً تربيعيّة في حالاتٍ عديّة.</p>
<p>لكنّ هناك استثناءً واحدًا بحجم علم التعمية:
في عام 1994 أثبت بيتر شور أنّ الحواسيب الكمّية تستطيع حلّ مشكلتَي تحليل الأعداد الصحيحة إلى عواملها واللوغاريتم المتقطّع في زمن متعدّد الحدود.
وقد استأثرت هذه النتيجة خيال عددٍ كبيرٍ جدًّا من الناس، وأشعلت البحث في الحوسبة الكمّية بطاقةٍ كاملة.
وذلك لأمرين: لأنّ صعوبة هذه المسائل بعينها تشكّل الأسس لتأمين جزءٍ هائل من اتصالاتنا (وفي هذه الأيام، اقتصادنا)، ولأنّه كان عرضًا قويًّا على أنّ الحواسيب الكمّية قد تنفع في مسائل تبدو، في الظاهر، لا علاقة لها إطلاقًا بالفيزياء الكمّية.</p>
<p>وسنناقش هذا لاحقًا، فإنّ هناك في الوقت الحالي عدّة جهودٍ كثيفة لبناء حواسيب كمّية واسعة النطاق.
ويبدو من الآمن القول، حسب علمي، إنّه خلال السنوات الخمس ة أو نحوها لن يوجد حاسوب كمّي كبير بما يكفي لتحليل، مثلًا، عددٍ بـ $1024$ بتّ إلى عوامله.
ومن الجهة الأخرى، يبدو مرجّحًا جدًّا أنّه في المستقبل القريب جدًّا ستكون هناك حواسيب كمّية تؤدّي <em>بعضَ</em> المهمة بسرعةٍ أسّيّة أكبر بكثير من أفضل طريقةٍ معروفة لتأدية المهمة نفسها بحاسوبٍ كلاسيكيّ.
أمّا متى تُبنى، وإذَا بُنيت، حاسوبٌ كمّيّ قويّ بما يكفي لكسر المعاملات المعقولة في ديفي-هيلمان وRSA وتعمية المنحنيات الإهليلجية، فلا أحد يعرف.
وقد يكون الأمر أيضًا &quot;نبوءةً مدمِّرة لنفسها&quot;، حيث إنّ وجود حاسوب كمّيّ صغير النطاق يدفع الجميع إلى الانتقال إلى التعمية المبنيّة على الشبكات البلّورية، وهو ما سيُضعف بدوره الدافع لاستثمار الموارد الهائلة اللازمة لبناء حاسوب كمّيّ واسع النطاق.[^legacy]</p>
<p>[^legacy]: وبالطبع، بما أنّنا <a href="http://blog.cryptographyengineering.com/2016/03/attack-of-week-drown.html">لا نزال نسمع</a> عن هجماتٍ تستغلّ تعميةً &quot;بمستوى التصدير&quot; كان المفترض أن تختفي في تسعينيات القرن الماضي، فأنا أتوقّع أنّنا سنظلّ نملك منتجاتٍ تعمل بتشفير RSA بطول 1024 بتّ حين يمتلك الجميع حاسوبًا كمّيًّا محمولًا.</p>
<p>[^overhead]: إنّ &quot;نسبة الـ 95%&quot; هذه صورةٌ بلاغيّة، لكنّها ليست كذلك تمامًا. فعند كتابة هذا النص، يُقدَّر أنّ استهلاك الكهرباء في تعدين العملات المشفّرة يستهلك <a href="https://digiconomist.net/bitcoin-energy-consumption">70 تيراواط ساعيًّا، أي 0.3% من إنتاج العالم</a>، وهو ما يعادل نحو <a href="http://www.mdpi.com/2078-1547/6/1/117/html">2 إلى 5%</a> من إجمالي استهلاك الطاقة في قطاع الحوسبة. وستكسر الحواسيب الكمّية جميع العملات المشفّرة الحالية. كذلك، بالنسبة لكثيرٍ من خوادم الويب، فإنّ بروتوكول TLS (وهو مبنيٌّ على أنظمة اليوم غير القائمة على الشبكات البلّورية، وستكسره الحوسبة الكمّية تمامًا) مسؤول <a href="https://goo.gl/mHpYpm">عن نحو 1% من استهلاك المعالج</a>.</p>
<p>::: {.remark title=&quot;الحوسبة الكمّية و$\\mathbf{NP}$&quot; #quantumnp}
على الرغم من الروايات الشائعة عن الحواسيب الكمّية بأنّ لها متغيّراتٍ يمكن أن تأخذ &quot;صفرًا وواحدًا في الوقت ذاته&quot;، وبالتالي &quot;تستكشف عددًا أسّيًّا من الاحتمالات في آنٍ واحد&quot;، فإنّ قوتها الحقيقيّة أدقّ إلى حدٍّ بعيد.
وبخاصة، وحسب علمي، لا تمكّننا الحواسيب الكمّية من حلّ مسائل $\\mathbf{NP}$ الكاملة مثل 3SAT في زمن متعدّد الحدود أو حتى تحت-أسّيّ.
لكنّ <a href="https://goo.gl/NQVLLF">خوارزمية بحث غروفير</a> تمنح فعلًا ميزةً أكثر تحفّظًا (أي تربيعيّة) للحواسيب الكمّية على نظيراتها الكلاسيكيّة في مسائل $\\mathbf{NP}$.
وبخاصة، بفضل خوارزمية بحث غروفير، نعرف أنّ مسألة $k$-SAT في $n$ متغيّرًا يمكن حلّها في زمن $O(2^{n/2}poly(n))$ على حاسوب كمّي لكلّ $k$.
وفي المقابل، أفضل الخوارزميات المعروفة لمسألة $k$-SAT على حاسوبٍ كلاسيكيّ تستغرق نحو $2^{(1-\\tfrac{1}{k})n}$ خطوة.
:::</p>
<h2 id="الأنظمة-الكمية">الأنظمة الكمّية</h2>
<p>قبل أن نتحدّث عن الحوسبة <em>الكمّية</em>، لنُراجع كيف نحقّق فيزيائيًّا الحوسبة &quot;العاديّة&quot; أي <em>الكلاسيكيّة</em>.
ننمذج <em>البتّ المنطقيّ</em> الذي يمكن أن يساوي $0$ أو $1$ بواسطة نظامٍ فيزيائيّ يكون في إحدى حالتين.
على سبيل المثال، قد يكون سلكًا بجهدٍ عالٍ أو منخفض، أو مكثّفًا مشحونًا أو غير مشحون، أو حتى (كما رأينا) أنبوبًا يجري فيه الماء أو لا يجري، أو وجود جندي متمركز أو غيابه.
يتكوّن النظام <em>الكلاسيكيّ</em> المكوّن من $n$ بتًّا من $n$ من هذه &quot;الأنظمة الأساسيّة&quot;، كلٌّ منها يمكن أن يكون في حالة &quot;صفر&quot; أو &quot;واحد&quot;.
ويمكننا نمذجة حالة مثل هذا النظام بسلسلةٍ $s \\in {0,1}^n$.
فإذا نفّذنا عمليةً مثل كتابة NAND للبتّين الثالث والخامس في البتّ السابع عشر، فإنّ ذلك يقابل تطبيق دالّة <em>موضعيّة</em> على $s$ مثل ضبط $s_{17} = 1 - s_3\\cdot s_5$.</p>
<p>في إطار <em>الاحتماليّ</em>، سننمذج حالة النظام بـ_توزيع_.
أمّا البتّ الفرديّ فيمكننا نمذجته بزوجٍ من الأعداد غير السالبة $\\alpha,\\beta$ بحيث $\\alpha+\\beta=1$، حيث $\\alpha$ هو احتمال أن يكون البتّ صفرًا و$\\beta$ هو احتمال أن يكون البتّ واحدًا.
على سبيل المثال، تطبيق عملية <em>النفي</em> (أي NOT) على هذا البتّ يقابل تحويل الزوج $(\\alpha,\\beta)$ إلى $(\\beta,\\alpha)$، لأنّ احتمال أن يساوي $NOT(\\sigma)$ العددَ $1$ هو نفسه احتمال أن يساوي $\\sigma$ العددَ $0$.
وهذا يعني أنّه يمكننا اعتبار دالّة NOT الخريطة الخطّية $N:\\R^2 \\rightarrow \\R^2$ بحيث $N \\begin{pmatrix} \\alpha \\ \\beta \\end{pmatrix} = \\begin{pmatrix} \\beta \\ \\alpha \\end{pmatrix}$، أو بما يعادلها المصفوفة $\\begin{pmatrix} 0 &amp; 1 \\ 1 &amp; 0 \\end{pmatrix}$.</p>
<p>فإذا نظرنا إلى نظام الـ $n$ بتًّا ككلّ، فبما أنّ الـ $n$ بتًّا يمكن أن تأخذ إحدى $2^n$ قيمةٍ محتملة، فإنّنا ننمذج حالة النظام كمتجّه $p$ من $2^n$ احتمال.
لكلّ $s\\in {0,1}^n$، نرمز بالمتجّه $e_s$ المتّجهَ ذي البعد $2^n$ الذي له $1$ في الإحداثيّ الموافقة لـ $s$ (بعد مطابقته إلى عددٍ في $[2^n]$)، هكذا يمكننا كتابة $p$ على أنّها $\\sum_{s\\in {0,1}^n} p_s e_s$ حيث $p_s$ هو احتمال أن يكون النظام في الحالة $s$.</p>
<p>وتطبيق عملية الضبط السابقة، أي جعل البتّ $17$ مساويًا لـ NAND للبتّين الثالث والخامس، يقابل تحويل المتّجه $p$ إلى المتّجه $Fp$ حيث $F:\\R^{2^n} \\rightarrow \\R^{2^n}$ هي الخريطة الخطّية التي ترسل $e_s$ إلى $e_{s_0\\cdots s_{16}(1-s_3\\cdot s_5)s_{18}\\cdots s_{n-1}}$.^[بما أنّ \${ e_s }_{s\\in {0,1}^n}$ هو <em>أساسٌ</em> لـ $R^{2^n}$، فيكفي تعريف الخريطة $F$ على المتّهات من هذا الشكل.]</p>
<p>::: { .pause }
تأكّد من فهمك لسبب أنّ تنفيذ هذه العملية ينقل نظامًا في الحالة $p$ إلى نظام في الحالة $Fp$.
فهم تطوّر الأنظمة الاحتماليّة شرطٌ سابق لفهم تطوّر الأنظمة الكمّية.
وإن كانت معلوماتك في الجبر الخطّي قد صدئة قليلًا، فحان وقتٌ مناسب لمراجعتها، وبخاصة تأكّد من اطّلاعك على مفاهيم <em>المصفوفات</em> و_المتّجهات_ و_الأسس_ (المتعامدة والمتعامدة القياسيّة) و_المعايير_.
:::</p>
<h3 id="سعات-كمية">سعات كمّية</h3>
<p>في الإطار الكمّي، تُنمذج حالة البتّ الفرديّ (أو &quot;الكيوبِت&quot; (<em>qubit</em>) بلغة الكمّ) بزوجٍ من الأعداد $(\\alpha,\\beta)$ بحيث $|\\alpha|^2 + |\\beta|^2 = 1$.
في حين أنّ هذه الأعداد قد تكون <em>معقّدة</em> على العموم، سنفترض في بقية هذا الفصل غالبًا أنّها <em>حقيقية</em> (رغم أنها قد تكون سالبة)، ولذلك نُسقط مشغّل القيمة المطلقة في مواضعٍ كثيرة.
(وهذا لا يؤثّر كثيرًا على القدرة التفسيرية.)
وكما سبق، نفكّر في $\\alpha^2$ على أنّها احتمال أن يساوي البتّ العددَ $0$، وفي $\\beta^2$ على أنّها احتمال أن يساوي البتّ العددَ $1$.
وكما فعلنا من قبل، يمكننا نمذجة عملية NOT بالخريطة $N:\\R^2 \\rightarrow \\R^2$ حيث $N(\\alpha,\\beta)=(\\beta,\\alpha)$.</p>
<p>وإلّا اتّباعًا للتقليد الكمّي، بدلًا من استعمال $e_0$ و$e_1$ كما فعلنا أعلاه، سنرمز من الآن فصاعدًا للمتجّه $(1,0)$ بالرمز $|0\\rangle$، و$(0,1)$ بالرمز $|1\\rangle$ (وعلاوةً، نفكّر في هذين كمتجّهين أعمّدة).
وتُعرف هذه بترميز ديراك «الكِت» (<em>ket</em>).
وهذا يعني أنّ NOT هي الخريطة الخطّية الوحيدة $N:\\R^2 \\rightarrow \\R^2$ التي تحقّق $N |0\\rangle=|1\\rangle$ و$N |1\\rangle =|0\\rangle$.
بمعنى آخر، في الحالة الكمّية كما في الحالة الاحتمالية، تقابل NOT المصفوفة
$$
N = \\begin{pmatrix} 0 &amp; 1 \\ 1 &amp; 0 \\end{pmatrix} ;.
$$</p>
<p>في الحوسبة الكلاسيكيّة، نميل عادةً إلى الاعتقاد بأنّ عملياتٍ اثنتين فقط يمكن إجراؤهما على بتٍّ واحد: الإبقاء عليه كما هو أو نفيه.
في الإطار الكمّي، تقابل عملية البتّ الواحد أي خريطة خطّية $OP:\\R^2 \\rightarrow \\R^2$ <em>حافِظة للمعيار</em> بالمعنى أنّه لكلّ $\\alpha,\\beta$، إذا طبّقنا $OP$ على المتّجه $\\begin{pmatrix} \\alpha \\ \\beta \\end{pmatrix}$ نحصل على متّجه $\\begin{pmatrix} \\alpha' \\ \\beta' \\end{pmatrix}$ بحيث $\\alpha'^2 + \\beta'^2 = \\alpha^2 + \\beta^2$.
وتقابل خريطةٍ خطّية كهذه $OP$ مصفوفةً <a href="https://en.wikipedia.org/wiki/Unitary_matrix">وحادية</a> 2×2.^[كما ذكرنا، تنمذج الميكانيكا الكمّية في الواقع الحالات كمتجّهاتٍ بإحداثيّاتٍ <em>معقّدة</em>. لكنّ هذا لا يحدث أيّ فرقٍ نوعيّ في مناقشتنا.]
الإبقاء على البتّ كما هو يقابل المصفوفة $I = \\begin{pmatrix} 1&amp;0\\ 0&amp;1 \\end{pmatrix}$، و(كما رأينا) عملية NOT تقابل المصفوفة $N = \\begin{pmatrix} 0&amp;1\\ 1&amp;0 \\end{pmatrix}$.
لكنّ هناك عملياتٍ أخرى يمكننا استعمالها أيضًا.
إحدى هذه العمليات المفيدة هي عملية <em>هادامارد</em> (<em>Hadamard</em>)، وهي تقابل المصفوفة
$$H = \\tfrac{1}{\\sqrt{2}} \\begin{pmatrix} +1 &amp; +1\\ +1 &amp; -1 \\end{pmatrix} ;. $$</p>
<p>وفي الواقع، يتبيّن أنّ هادامارد هو كلّ ما نحتاج إلى إضافته إلى أساسٍ كلاسيكيّ شامل للحصول على كامل قوة الحوسبة الكمّية.</p>
<h3 id="ملخص">ملخّص</h3>
<p>تُنمذج <em>حالة</em> <em>نظامٍ كمّيّ</em> من $n$ كيوبِت بمتجّهٍ ذي البعد $2^n$ هو $\\psi$ ومعياره وحدة (أي أنّ مربّعات كلّ الإحداثيّات مجموعها $1$)، ونكتبه على أنّه $\\psi=\\sum_{x\\in {0,1}^n} \\psi_x |x \\rangle$ حيث $|x\\rangle$ هو متّجه العمود الذي له $0$ في كلّ الإحداثيّات إلّا ذلك المقابل لـ $x$ (بعد مطابقة \${0,1}^n$ مع الأعداد \${0,\\ldots,2^n-1}$).
ونستخدم العُرف بأنّه إذا كانت $a,b$ سلسلتين بطول $k$ و$\\ell$ على التوالي، فيمكننا كتابة المتّجه ذي البعد $2^{k+\\ell}$ الذي له $1$ في الإحداثيّة $ab$ وصفرًا في بقيّة المواضع، ليس على صورة $|ab\\rangle$ فحسب بل أيضًا على صورة $|a\\rangle |b \\rangle$.
وبخاصة، لكلّ $x\\in {0,1}^n$، يمكننا كتابة المتّجه $|x\\rangle$ أيضًا على صورة $|x_0\\rangle |x_1\\rangle \\cdots |x_{n-1} \\rangle$.
وهذا الترميز يحقّق قوانين توزيعيّة جيّدة معيّنة مثل $|a\\rangle(|b\\rangle + |b'\\rangle)|c \\rangle = |abc \\rangle + |ab'c\\rangle$.</p>
<p>وتُنمذج <em>عمليةٌ كمّية</em> على مثل هذا النظام بمصفوفة $2^n \\times 2^n$ <em>وحاديّة</em> $U$ (أي التي تحقّق $UU^\\top = I$ حيث $U^\\top$ هي عملية <em>النقل</em> (<em>transpose</em>)، أو النقل المرافق للمصفوفات المعقّدة).
فإذا كان النظام في الحالة $\\psi$ وطبّقنا عليه العملية $U$، فإنّ الحالة الجديدة للنظام هي $U\\psi$.</p>
<p>وحين <em>نقيس</em> نظامًا من $n$ كيوبِت في حالة $\\psi= \\sum_{x\\in {0,1}^n} \\psi_x |x \\rangle$، نلاحظ القيمة $x\\in {0,1}^n$ باحتمال $|\\psi_x|^2$. وفي هذه الحالة، ينهار النظام <em>منهارًا</em> إلى الحالة $|x \\rangle$.</p>
<h2 id="تحليل-متباينة-بل-اختياري">تحليل متباينة بِل (اختياري)</h2>
<p>الآن وبعد أن استقرّ الترميز، يمكننا عرض استراتيجيةٍ لأليس وبوب تُظهر &quot;التنبّؤ الذهني الكمّي&quot; في لعبة بِل.
وتذكّروا أنّه في الحالة الكلاسيكيّة يمكن لأليس وبوب النجاح في &quot;لعبة بِل&quot; باحتمالٍ لا يتجاوز $3/4 = 0.75$.
وسنبيّن الآن أنّ الميكانيكا الكمّية تسمح لهما بالنجاح باحتمالٍ لا يقلّ عن $0.8$.^[الاستراتيجية التي نعرضها ليست الأفضل. وفي الواقع يمكن لأليس وبوب النجاح باحتمال $\\cos^2(\\pi/8) \\sim 0.854$.]</p>
<blockquote>
<h1>{.lemma #bellstrategy}</h1>
</blockquote>
<p>هناك حالة كمّية من كيوبِتين $\\psi\\in \\mathbb{C}^4$ بحيث إذا كان لأليس وصول إلى كيوبِت $\\psi$ الأوّل، مع القدرة على التلاعب به وقياسه وإخراج $a\\in {0,1}$، وكان لبوب وصول إلى كيوبِت $\\psi$ الثاني، مع القدرة على التلاعب به وقياسه وإخراج $b\\in {0,1}$، فإنّ&quot;
$\\Pr[ a \\oplus b = x \\wedge y ] \\geq 0.8$.</p>
<p>::: {.proof data-ref=&quot;bellstrategy&quot;}
سيبدأ أليس وبوب بتحضير نظامٍ كمّي من كيوبِتين في الحالة</p>
<p>$$\\psi = \\tfrac{1}{\\sqrt{2}}|00\\rangle + \\tfrac{1}{\\sqrt{2}}|11\\rangle$$</p>
<p>(وتُعرف هذه الحالة بـ<a href="https://en.wikipedia.org/wiki/EPR_paradox">زوج EPR</a>).
يأخذ أليس كيوبِت النظام الأوّل إلى غرفته، ويأخذ بوب الكيوبِت الثاني إلى غرفته.
الآن، حين يتلقّى أليس $x$، فإنّ $x=0$ لا يفعل شيئًا، وإنّما إن كان $x=1$ طبّق الخريطةَ الوحاديّة $R_{-\\pi/8}$ على كيوبِته، حيث $R_\\theta = \\begin{pmatrix} cos \\theta &amp; -\\sin \\theta \\ \\sin \\theta &amp; \\cos \\theta \\end{pmatrix}$ هي العملية الوحاديّة الموافقة لدورانٍ في المستوى بزاوية $\\theta$.
وحين يتلقّى بوب $y$، فإنّ $y=0$ لا يفعل شيئًا، وإنّما إن كان $y=1$ طبّق الخريطةَ الوحاديّة $R_{\\pi/8}$ على كيوبِته.
ثمّ يقيس كلٌّ منهم كيوبِته ويرسله بوصفه إجابته.</p>
<p>تذكّروا أنّه لكي يفوزا في اللعبة يريد بوب وأليس أن يكون ناتجاههما أكثر احتمالًا لأن يكونا مختلفَين إذا كان $x=y=1$، وأكثر احتمالًا لأن يكونا متّفقَين في غير ذلك.
سنقسّم التحليل إلى حالةٍ لكلّ واحدةٍ من القيم المحتملة الأربع لـ $x$ و$y$.</p>
<p><strong>الحالة 1: $x=0$ و$y=0$.</strong> إن كان $x=y=0$ فإنّ الحالة لا تتغيّر.
ولأنّ الحالة $\\psi$ متناسبة مع $|00\\rangle + |11\\rangle$، فإنّ قياسي بوب وأليس ستتّفقان دائمًا (إن قاس أليس $0$ فإنّ الحالة تنهار إلى $|00 \\rangle$، ومن ثمّ يقيس بوب $0$ أيضًا، وكذلك الحال مع $1$).
وعليه، في حالة $x=y=0$، يفوز أليس وبوب دائمًا.</p>
<p><strong>الحالة 2: $x=0$ و$y=1$.</strong> إن كان $x=0$ و$y=1$، فإنّه بعد أن يقيس أليس بتّه، إن حصل على $0$ فإنّ النظام ينهار إلى الحالة $|00 \\rangle$، وعندئذٍ بعد أن يُجري بوب دورانه يكون كيوبِته في الحالة $\\cos (\\pi/8)|0\\rangle+\\sin(\\pi/8)|1\\rangle$.
ومن ثمّ، حين يقيس بوب كيوبِته، سيحصل على $0$ (أي سيتّفق مع أليس) باحتمال $\\cos^2 (\\pi/8)  \\geq 0.85$.
وبالمثل، إن حصل أليس على $1$ فإنّ النظام ينهار إلى $|11 \\rangle$، وعندئذٍ بعد الدوران يكون كيوبِت بوب في الحالة $-\\sin (\\pi/8)|0\\rangle+\\cos(\\pi/8)|1\\rangle$، ومن ثمّ يتّفق مع أليس مرّةً أخرى باحتمال $\\cos^2(\\pi/8)$.</p>
<p>التحليل في <strong>الحالة 3</strong>، حيث $x=1$ و$y=0$، مطابق تمامًا للتحليل في الحالة 2. وعليه، سيتّفق أليس وبوب في هذه الحالة أيضًا باحتمال $\\cos^2(\\pi/8)$.^[نستعمل هنا الملاحظة (الليست صعبةً جدًّا) بأنّ نتيجة هذه التجربة واحدة بصرف النظر عن الترتيب الذي يطبّق به أليس وبوب دوراناتهما وقياساتهما.]</p>
<p><strong>الحالة 4: $x=1$ و$y=1$.</strong> في حالة $x=1$ و$y=1$، بعد أن يُجري أليس وبوب دورانيهما، ستكون الحالة متناسبةً مع</p>
<p>$$R_{-\\pi/8}|0\\rangle R_{\\pi/8}|0 \\rangle + R_{-\\pi/8}|1\\rangle R_{\\pi/8}|1 \\rangle ;. \\label{quantumbellcasefoureq}$$</p>
<p>حدسيًّا، بما أنّنا ندوّر إحدى الحالتين بمقدار 45 درجة والأخرى بمقدار -45 درجة، فسيصبحان متعامدَين أحدهما على الآخر، وستتصرّف القياسات كقذفَي نقدٍ مستقلّين يتّفقان باحتمال 1/2.
لكنّ من أجل الاكتمال، سنعرض الآن الحساب الكامل.</p>
<p>وبفكّ المعاملات واستعمال $\\cos(-x)=\\cos(x)$ و$\\sin(-x)=-\\sin(x)$، نرى أنّ <a href="https://lukin.physics.harvard.edu/arrays-cold-atoms">quantumbellcasefoureq</a>{.eqref} متناسبٌ مع</p>
<p>$$
\\begin{aligned}
\\cos^2(\\pi/8)|00 \\rangle &amp;+ \\cos(\\pi/8)\\sin(\\pi/8)|01 \\rangle \\</p>
<ul>
<li>\\sin(\\pi/8)\\cos(\\pi/8)|10\\rangle  &amp;+ \\sin^2(\\pi/8)|11 \\rangle \\</li>
<li>\\sin^2(\\pi/8)|00 \\rangle &amp;+ \\sin(\\pi/8)\\cos(\\pi/8)|01 \\rangle \\</li>
<li>\\cos(\\pi/8)\\sin(\\pi/8)|10\\rangle  &amp;+ \\cos^2(\\pi/8)|11 \\rangle ;.
\\end{aligned}
$$</li>
</ul>
<p>وباستعمال الهويات المثلّثية $2\\sin(\\alpha)\\cos(\\alpha)= \\sin(2\\alpha)$ و$\\cos^(\\alpha) - \\sin^2(\\alpha) = \\cos(2\\alpha)$، نرى أنّ احتمال الحصول على أيّ واحدٍ من $|00\\rangle,|10\\rangle,|01\\rangle,|11\\rangle$ متناسبٌ مع $\\cos(\\pi/4)=\\sin(\\pi/4)=\\tfrac{1}{\\sqrt{2}}$.
وعليه، فإنّ الخيارات الأربعة لـ $(a,b)$ محتملة بالتساوي، أي إنّ $a=b$ في هذه الحالة باحتمال $0.5$.</p>
<p>وجمع الحالات الأربع معًا، فإنّ احتمال الفوز الكليّ في اللعبة لا يقلّ عن $\\tfrac{1}{4}\\cdot 1 + \\tfrac{1}{2}\\cdot 0.85 + \\tfrac{1}{4} \\cdot 0.5 =0.8$.
:::</p>
<blockquote>
<h1>{.remark title=&quot;استراتيجيات كمّية مقابل احتماليّة&quot; #quantumprob}</h1>
</blockquote>
<p>من المفيد فهم ما في الميكانيكا الكمّية الذي أتاح هذه المكسب في متباينة بِل. لنفكّر في الاستراتيجية الاحتماليّة المشابهة التالية لأليس وبوب. يتّفقان على أنّ كلًّا منهما يُخرج $0$ إذا حصل على $0$ كمدخل، ويُخرج $1$ باحتمال $p$ إذا حصل على $1$ كمدخل. في هذه الحالة يمكن رؤية أنّ احتمال نجاحهما سيكون $\\tfrac{1}{4}\\cdot 1 + \\tfrac{1}{2}(1-p)+\\tfrac{1}{4}[2p(1-p)]=0.75 -0.5p^2 \\leq 0.75$. ويمكن التفكير في الاستراتيجيّة الكمّية التي وصفناها أعلاه بوصفها تنويعةً للاستراتيجية الاحتماليّة مع ضبط الوسيط $p$ على $\\sin^2 (\\pi/8)=0.15$. لكنّه في حالة $x=y=1$، بدلًا من الاختلاف باحتمال $2p(1-p)=1/4$ فحسب، يمكننا استعمال الاحتمالات السالبة في العالم الكمّي ودوران الحالة في اتجاهين متعاكسين. ومن ثمّ ينتهي احتمال الاختلاف إلى $\\sin^2 (\\pi/4)=0.5$.</p>
<h2 id="الحوسبة-الكمية">الحوسبة الكمّية</h2>
<p>تذكّروا أنّنا في الإطار الكلاسيكيّ نمذجنا الحساب بأنّه يُحصَل عليه عبر تسلسلٍ من <em>عملياتٍ أساسيّة</em>.
وقد كان لدينا نوعان من النماذج الحوسبية:</p>
<ul>
<li>
<p><em>نماذج حسابٍ غير منتظمة</em> مثل الدوائر البوليانية وبرامج NAND-CIRC، حيث تكون الدالّة المنتهية $f:{0,1}^n \\rightarrow {0,1}$ قابلةً للحساب بحجم $T$ إذا أمكن التعبير عنها كتركيبٍ من $T$ عمليةً أساسيّة (بوّاباتٍ في دائرة أو أسطرٍ في برنامج NAND-CIRC)</p>
</li>
<li>
<p><em>نماذج حسابٍ منتظمة</em> مثل آلات تورينج وبرامج NAND-TM، حيث تكون الدالّة اللانهائية $F:{0,1}^* \\rightarrow {0,1}$ قابلةً للحساب في زمن $T(n)$ إذا كانت هناك خوارزميّةٌ واحدة تُعطى مدخلًا $x\\in {0,1}^n$ فتُقيّم $F(x)$ باستعمال $T(n)$ خطوةً أساسيّةً على الأكثر.</p>
</li>
</ul>
<p>وحين كنا نتناول <em>الحساب الكَفء</em>، عرّفنا الصنف $\\mathbf{P}$ على أنّه يتكوّن من كلّ الدوالّ اللانهائية $F:{0,1}^* \\rightarrow {0,1}$ التي يمكن حسابها بآلة تورينج أو ببرنامج NAND-TM في زمن $p(n)$ لمتعدّد حدودٍ ما $p(\\cdot)$.
وعرّفنا الصنف $\\mathbf{P_{/poly}}$ على أنّه يتكوّن من كلّ الدوالّ اللانهائية $F:{0,1}^* \\rightarrow {0,1}$ بحيث لكلّ $n$، يمكن حساب تقييد $F$ على \${0,1}^n$، وهو $F_{\\upharpoonright n}$، بدائرةٍ بوليانية أو ببرنامج NAND-CIRC حجمها لا يتجاوز $p(n)$ لمتعدّد حدودٍ ما $p(\\cdot)$.</p>
<p>وسنفعل الشيء نفسه للحوسبة <em>الكمّية</em>، مع التركيز في الغالب على الإطار <em>غير المنتظم</em> للدوائر الكمّية، لأنّه الأبسط، ويوضّح أصلًا الفروق المهمّة مع الحوسبة الكلاسيكيّة.</p>
<h3 id="الدوائر-الكمية">الدوائر الكمّية</h3>
<p><em>الدائرة الكمّية</em> شبيهةٌ بالدائرة البوليانية، ويمكن وصفها بأنّها رسمٌ بيانيّ موجّهٌ بلا دورات.
ومن الفروق الجوهرية أنّ <em>درجة الخروج</em> (<em>out degree</em>) لكلّ رأسٍ في دائرةٍ كمّية لا تتجاوز واحدًا.
ويعود ذلك إلى أنّنا لا نستطيع &quot;إعادة استعمال&quot; الحالات الكمّية من غير <em>قياسها</em> (وأنّ القياس يُنهار &quot;احتمالاتها&quot;).
وعليه، لا يمكننا استعمال كيوبِت واحدٍ كمدخلٍ لبوّابتين مختلفتين.^[تُعرف هذه بـ<a href="https://goo.gl/jCVtEY">نظرية عدم الاستنساخ</a>.]
ومن الفروق الأخرى الأكثر تقنيّة أنّه، حتى نعبّر عن عملياتنا كمصفوفاتٍ وحاديّة، سنحتاج إلى التأكّد من أنّ كلّ بوّاباتنا <em>قابلة للعكس</em>.
وهذا ليس صعبًا الضمان.
على سبيل المثال، في السياق الكمّي، بدلًا من التفكير في $NAND$ كخريطةٍ (غير قابلة للعكس) من \${0,1}^2$ إلى \${0,1}$، سنفكّر فيها كخريطةٍ قابلة للعكس على <em>ثلاثة</em> كيوبِتات ترسل $a,b,c$ إلى $a,b,c\\oplus NAND(a,b)$ (أي تنقلب البتّ الأخيرة إذا كانت $NAND$ للبتّين الأوّلَين تساوي $1$).
وبما يعادله، تقابل عملية NAND المصفوفةَ الوحاديّة $8\\times 8$ المسمّاة $U_{NAND}$ بحيث (بعد مطابقة \${0,1}^3$ مع $[8]$) لكلّ $a,b,c \\in {0,1}$، إذا كان $|abc\\rangle$ هو عنصر الأساس الذي له $1$ في الإحداثيّة $abc$ وصفرًا في غيرها، فإنّ $U_{NAND} |abc\\rangle =|ab(c \\oplus NAND(a,b))\\rangle$.^[على القرّاء الملمّين بالحوسبة الكمّية أن ينتبهوا إلى أنّ $U_{NAND}$ صيغةٌ قريبةٌ جدًّا من <a href="https://goo.gl/BE7aVG">بوّابة توفولي</a> المعروفة، بحيث تقابل برامج QNAND-CIRC دوائرَ كمّية ببوّابي هادامارد وتوفولي.]
وإذا رتّبنا الصفوف والأعمدة بالترتيب $000,001,010,\\ldots,111$، فإنّ $U_{NAND}$ يمكن كتابتها على صورة المصفوفة التالية:</p>
<p>$$
U_{NAND}  = \\begin{pmatrix} 0 &amp; 1 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 \\
1 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 \\
0 &amp; 0 &amp; 0 &amp; 1 &amp; 0 &amp; 0 &amp; 0 &amp; 0 \\
0 &amp; 0 &amp; 1 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 \\
0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 1 &amp; 0 &amp; 0 \\
0 &amp; 0 &amp; 0 &amp; 0 &amp; 1 &amp; 0 &amp; 0 &amp; 0 \\
0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 1 &amp; 0 \\
0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 0 &amp; 1
\\end{pmatrix}
$$</p>
<p>فلن كان لدينا نظامٌ من $n$ كيوبِت، فإنّه لكلّ $i,j,k \\in [n]$ سنرمز بـ $U_{NAND}^{i,j,k}$ إلى المصفوفة الوحاديّة $2^n \\times 2^n$ الموافقة لتطبيق $U_{NAND}$ على البتّات $i$ و$j$ و$k$، مع ترك البقيّة كما هي.
أي أنّه لكلّ $v = \\sum_{x\\in {0,1}^n} v_x |x \\rangle$،
$U_{NAND}^{i,j,k}v = \\sum_{x\\in {0,1}^n}v_x |x_0 \\cdots x_{k-1}(x_k \\oplus NAND(x_i,x_j))x_{k+1} \\cdots x_{n-1} \\rangle$.</p>
<p>وكما ذكرنا أعلاه، سنستعمل أيضًا عملية <em>هادامارد</em> أو $HAD$.
وتُنشأ <em>الدائرة الكمّية</em> بتطبيق تسلسلٍ من بوّابات $U_{NAND}$ و$HAD$، وهي تقابل المصفوفة
$$H = \\tfrac{1}{\\sqrt{2}} \\begin{pmatrix} +1 &amp; +1\\ +1 &amp; -1 \\end{pmatrix} ;. $$
وتوجد طريقةٌ أخرى لتعريف $H$ وهي أنّه لكلّ $b \\in {0,1}$، $H |b\\rangle = \\tfrac{1}{\\sqrt{2}}|0\\rangle + \\tfrac{1}{\\sqrt{2}} (-1)^b |1\\rangle$.
ونعرّف $HAD^i$ على أنّها المصفوفة الوحاديّة $2^n \\times 2^n$ التي تطبّق $HAD$ على الكيوبِت $i$ وتترك البقيّة كما هي.
وباستعمال ترميز الكِت، يمكننا كتابة هذا على الصورة
$$
HAD^i ; \\sum_{x\\in {0,1}^n} v_x |x \\rangle  ;=; \\tfrac{1}{\\sqrt{2}}\\sum_{x\\in {0,1}^n}|x_0 \\cdots x_{i-1}\\rangle \\left(|0\\rangle + (-1)^{x_i}|1\\rangle\\right)|x_i \\cdots x_{n-1} \\rangle ;.
$$</p>
<p>وتُنشأ <em>دائرةٌ كمّية</em> بترطيب هذه العمليات الأساسيّة على $m$ كيوبِتٍ ما.
فإذا كان $m \\geq n$، فإنّنا نستعمل دائرةً لحساب دالّة $f:{0,1}^n \\rightarrow {0,1}$:</p>
<ul>
<li>
<p>على المدخل $x$، نهيّئ النظام ليحتوي $x_0,\\ldots,x_{n-1}$ في كيوبِتات $n$ الأولى، ونهيّئ بقية الكيوبِتات الـ $m-n$ كلها إلى الصفر.</p>
</li>
<li>
<p>ننفّذ كلّ عمليةٍ أوّليّة واحدةً تلو الأخرى.</p>
</li>
<li>
<p>في نهاية الحساب، <em>نقيس</em> النظام، ونُخرج نتيجة الكيوبِت الأخير (أي الكيوبِت في الموضع $m-1$).^[للبساطة نقتصر على الدوالّ ذات البتّ الواحد للناتج، وإنّما تعريف الدوائر الكمّية يمتدّ طبيعيًّا إلى الدوائر ذات النواتج المتعدّدة.]</p>
</li>
<li>
<p>ونقول إنّ الدائرة <em>تحسب</em> $f$ إذا كان احتمال أن يساوي هذا الناتج $f(x)$ لا يقلّ عن $2/3$. ولاحظ أنّ هذا الاحتمال يُحصَل عليه بجمع مربّعات سعات كلّ الإحداثيّات في الحالة النهائيّة للنظام الموافقة للمتجّهات $|y \\rangle$ حيث $y_{m-1}=f(x)$.</p>
</li>
</ul>
<p>رسميًّا، يُعرَّف هذا على النحو التالي:</p>
<p>::: {.definition title=&quot;الدائرة الكمّية&quot; #quantumcircuitdef}
<em>دائرةٌ كمّية بـ$m$ مدخلات و$s$ بوّابات</em> على الأساس \${ U_{NAND}, HAD }$ هي تسلسلٌ من $s$ مصفوفةً وحاديّة $2^n \\times 2^n$ المسمّاة $U_0,\\ldots,U_{s-1}$ بحيث كلّ مصفوفة $U_\\ell$ إمّا من الشكل $NAND^{i,j,k}$ لـ $i,j,k\\in [n]$ أو $HAD^i$ لـ $i\\in [n]$.</p>
<p>وتُقال إنّ الدائرة الكمّية <em>تحسب</em> دالّةً $f:{0,1}^n \\rightarrow {0,1}$ إذا كان ما يلي صحيحًا لكلّ $x\\in {0,1}^n$:</p>
<p>دعِ $v$ يكون المتّجه
$$v ;=; U_{s-1}U_{s-2}\\cdots U_1 U_0 |x0^{m-n} \\rangle$$
واكتب $v$ على صورة $\\sum_{y\\in {0,1}^m} v_y |y \\rangle$.
عندئذٍ
$$
\\sum_{y \\in {0,1}^m \\text{ s.t. } y_{m-1}=f(x)} |v_y|^2 \\geq \\frac{2}{3} ;.
$$
:::</p>
<p>::: { .pause }
أرجوك توقّف هنا وتحقّق من أنّ هذا التعريف يبدو منطقيًّا لك.
:::</p>
<p>وبما أنّ لدينا الآن فكرة الدوائر الكمّية، يمكننا تعريف نظير $\\mathbf{P_{/poly}}$ الكمّي (أي تعريف صنف الدوالّ القابلة للحساب بدوائرَ كمّية <em>بحجم متعدّد الحدود</em>) على النحو التالي:</p>
<blockquote>
<h1>{.definition title=&quot;$\\mathbf{BQP_{/poly}}$&quot; #QBPpoly}</h1>
</blockquote>
<p>ليكن $F:{0,1}^* \\rightarrow {0,1}$.
ونقول إنّ $F\\in \\mathbf{BQP_{/poly}}$ إذا كان هناك متعدّد حدودٍ ما $p:\\N \\rightarrow \\N$ بحيث لكلّ $n\\in \\N$، إذا كان $F_{\\upharpoonright n}$ هو تقييد $F$ على المداخل ذات الطول $n$، فإنّ هناك دائرةً كمّية حجمها لا يتجاوز $p(n)$ تحسب $F_{\\upharpoonright n}$.</p>
<p>::: {.remark title=&quot;مغالطة الأُسّيّة الواضحة&quot; #exponential}
قد يبدو &quot;واضحًا&quot; في البديهة أنّ الحوسبة الكمّية قويّةٌ أسّيّة، ذلك أنّه لتنفيذ حسابٍ كمّي على $n$ بتًّا نحتاج إلى الاحتفاظ بمتجّه الحالة ذي البعد $2^n$ وتطبيق مصفوفات $2^n\\times 2^n$ عليه.
وبالفعل، فإنّ الأوصاف الشائعة للحوسبة الكمّية تقول غالبًا ما مفاده أنّ الفرق بين الحاسوب الكمّي والحاسوب الكلاسيكيّ هو أنّ البتّ الكلاسيكيّ إمّا أن يكون صفرًا أو واحدًا بينما يمكن للكيوبِت أن يكون في الحالتين معًا، ومن ثمّ في كيوبِتاتٍ كثيرة يستطيع الحاسوب الكمّي تنفيذ عددٍ أسّيٍّ من الحسابات في آنٍ واحد.</p>
<p>وبحسب الطريقة التي تفسّر بها هذا الوصف، فإنّه إمّا باطل أو ينطبق بالمثل على <em>الحساب الاحتماليّ</em>، رغم أنّنا رأينا أصلًا أنّ كلّ خوارزميّةٍ عشوائيّة يمكن محاكاتها بدائرةٍ ذات حجمٍ مماثل، بل إنّنا نفترض أنّ $\\mathbf{BPP}=\\mathbf{P}$.</p>
<p>علاوةً على ذلك، فإنّ هذه المقاربة &quot;الواضحة&quot; لمحاكاة حسابٍ كمّي تستغرق ليس فقط زمنًا أسّيًّا بل <em>مساحةً أسّيّة</em> أيضًا، في حين يمكن إثبات أنّه باستعمال صيغةٍ عوديةٍ بسيطة يمكن حساب الحالة الكمّية النهائيّة باستعمال <em>مساحة متعدّدة الحدود</em> (وفي الفيزياء يُعرف هذا بـ&quot;تكاملات مسار فايمان&quot;).
إذًا، فإنّ وصف المتّجه الطويل الأُسّي بحدّ ذاته لا يستلزم أنّ الحواسيب الكمّية قويّةٌ أسّيّة.
وبالفعل، لا نستطيع <em>إثبات</em> أنّها كذلك (أي أنّه حسب علمي يمكن محاكاة كلّ برنامج QNAND-CIRC ببرنامج NAND-CIRC بتكلفة متعدّدة الحدود)، لكنّ لدينا بعض المسائل (وتُبرز مسألة تحليل الأعداد الصحيحة إلى عواملها) التي توفّر فيها فعلًا تسريعًا أسّيًّا مقارنةً بأفضل الخوارزميات الكلاسيكيّة (الحتميّة أو الاحتماليّة) المعروفة <em>حاليًّا</em>.
:::</p>
<h3 id="برامج-qnand-circ-اختياري">برامج QNAND-CIRC (اختياري)</h3>
<p>كما في الحالة الكلاسيكيّة بالضبط، هناك تكافؤٌ بين الدوائر وبرامج السطور المتتابعة، ولذلك يمكننا تعريف لغة البرمجة QNAND التي هي النظير الكمّي للغة NAND-CIRC البرمجيّة لدينا.
ولللعمل على ذلك، نضيف عمليةً واحدةً فقط: <code>HAD(foo)</code> التي تطبّق العملية أحادية البتّ $H$ على المتغيّر <code>foo</code>.
ونستعمل أيضًا التفسير التالي لجعل <code>NAND</code> قابلة للعكس: <code>foo = NAND(bar,blah)</code> تعني أنّنا نعدّل <code>foo</code> ليصبح XOR لقيمته الأصليّة مع NAND لـ <code>bar</code> و<code>blah</code>.
(بمعنى آخر، طبّق التحويلَ الوحاديّ $8$ في $8$ المعرّف أعلاه $U_{NAND}$ على الكيوبِتات الثلاثة الموافقة لـ <code>foo</code> و<code>bar</code> و<code>blah</code>.)
وإذا كان <code>foo</code> مهيّأً إلى الصفر فإنّ هذا لا يحدث أيّ فرق.</p>
<p>فإذا كان $P$ برنامج QNAND-CIRC فيه $n$ متغيّرَات مدخلات، و$\\ell$ متغيّرَات مساحة عمل، و$m$ متغيّرَات مخرجات، فإنّ تشغيله على المدخل $x\\in {0,1}^n$ يقابل إنشاء نظامٍ من $n+m+\\ell$ كيوبِت وأداء العملية التالية:</p>
<ol>
<li>
<p>نهيّئ متغيّرات المدخلات <code>X[</code>$0$<code>]</code> $\\ldots$ <code>X[</code>$n-1$<code>]</code> على $x_0,\\ldots,x_{n-1}$، ونضع جميع المتغيّرات الأخرى على $0$.</p>
</li>
<li>
<p>ننفّذ البرنامج سطرًا سطرًا، مطبّقًا العملية الفيزيائيّة المناظرة $H$ أو $U_{NAND}$ على الكيوبِتات التي يشير إليها السطر.</p>
</li>
<li>
<p><em>نقيس</em> متغيّرات المخرجات <code>Y[</code>$0$<code>]</code>, $\\ldots$, <code>Y[</code>$m-1$<code>]</code> ونُخرج النتيجة (وإذا كان هناك أكثر من ناتج فإنّنا نقيس متغيّراتٍ أكثر).</p>
</li>
</ol>
<h3 id="الحساب-المنتظم">الحساب المنتظم</h3>
<p>كما في الحالة الكلاسيكيّة بالضبط، يمكننا تعريف نماذج حسابٍ <em>منتظمة</em>.
على سبيل المثال، يمكننا تعريف <em>لغة البرمجة QNAND-TM</em> بوصفها QNAND مضافًا إليها الحلقات والمصفوفات، كما يُحصَّل NAND-TM من NAND.
وباستعمال هذا يمكننا تعريف الصنف $\\mathbf{BQP}$، وهو النظير المنتظم لـ $\\mathbf{BQP_{/poly}}$.
وكما في الإطار الكلاسيكيّ حيث $\\mathbf{BPP} \\subseteq \\mathbf{P_{/poly}}$، يمكن في الإطار الكمّي إثبات أنّ $\\mathbf{BQP} \\subseteq \\mathbf{BQP_{/poly}}$.
وكما في الحالة الكلاسيكيّة، يمكننا أيضًا استعمال <a href="https://en.wikipedia.org/wiki/Quantum_Turing_machine">آلات تورينج الكمّية</a> بدلًا من QNAND-TM لتعريف $\\mathbf{BQP}$.</p>
<p>وتوجد طريقةٌ أخرى لتعريف $\\mathbf{BQP}$ وهي التالية: الدالّة $F:{0,1}^* \\rightarrow {0,1}$ تنتمي إلى $\\mathbf{BQP}$ إذا <strong>(1)</strong> كان $F\\in \\mathbf{BQP_{/poly}}$ و <strong>(2)</strong> علاوةً على ذلك، لكلّ $n$، أمكن توليد الدائرة الكمّية التي تتحقّق من ذلك بواسطة <em>برنامج NAND-TM كلاسيكيّ بزمن متعدّد الحدود</em> (أو بما يعادله، آلة تورينج بزمن متعدّد الحدود).^[وهذا يشبه التوصيف البديل لـ $\\mathbf{P}$ الوارد في <a href="https://en.wikipedia.org/wiki/Topological_quantum_computer">Palternativeex</a>{.ref}.]
ونستعمل هذا التعريف هنا، وإنّما يمكن صياغة تعريفٍ مكافئ باستعمال QNAND-TM أو آلات تورينج الكمّية:</p>
<blockquote>
<h1>{.definition title=&quot;الصنف $\\mathbf{BQP}$&quot; #BQPdef}</h1>
</blockquote>
<p>ليكن $F:{0,1}^* \\rightarrow {0,1}$.
ونقول إنّ $F\\in \\mathbf{BQP}$ إذا كان هناك برنامج NAND-TM بزمن متعدّد الحدود $P$ بحيث لكلّ $n$، يكون $P(1^n)$ هو وصف دائرةٍ كمّية $C_n$ تحسب تقييد $F$ على \${0,1}^n$.</p>
<blockquote>
<h1>{ .pause }</h1>
</blockquote>
<p>إحدى طرائق التحقّق من أنّك فهمتَ هذه التعريفات هي أن ترى أنّه يمكنك إثبات <strong>(1)</strong> $\\mathbf{P} \\subseteq \\mathbf{BQP}$ بل وإنّ العبارة الأقوى $\\mathbf{BPP} \\subseteq \\mathbf{BQP}$، و <strong>(2)</strong> $\\mathbf{BQP} \\subseteq \\mathbf{EXP}$، و <strong>(3)</strong> لكلّ دالّةٍ $\\mathbf{NP}$-كاملة $F$، إذا كان $F\\in \\mathbf{BQP}$ فإنّ $\\mathbf{NP} \\subseteq \\mathbf{BQP}$. و <a href="https://arxiv.org/abs/1801.00862">BQPcontainements</a>{.ref} يطلب منك اشتقاق هذه النتائج.</p>
<p>العلاقة بين $\\mathbf{NP}$ و$\\mathbf{BQP}$ غير معروفة (وانظر أيضًا <a href="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-3.webp">quantumnp</a>{.ref}).
ويُعتقد على نطاقٍ واسع أنّ $\\mathbf{NP} \\not\\subseteq \\mathbf{BQP}$، لكن لا يوجد إجماعٌ على ما إذا كان $\\mathbf{BQP} \\subseteq \\mathbf{NP}$ أم لا.
ومن <a href="https://eccc.weizmann.ac.il/report/2018/107/">المحتمل جدًّا</a> أن يكون الصنفان <em>غير قابلين للمقارنة</em>، بمعنى أنّ $\\mathbf{NP} \\nsubseteq \\mathbf{BQP}$ (وبخاصة لا تنتمي أيّ دالّةٍ $\\mathbf{NP}$-كاملة إلى $\\mathbf{BQP}$)، لكن أيضًا $\\mathbf{BQP} \\nsubseteq \\mathbf{NP}$ (وهناك بعض المرشّحين الواعدين لمثل هذه المسائل).</p>
<p>ويمكن إثبات أنّ $QNANDEVAL$ (تقييم دائرة كمّية على مدخلٍ ما) قابلٌ للحساب ببرنامج QNAND-CIRC بحجم متعدّد الحدود، وعلاوةً على ذلك يمكن حتى توليد هذا البرنامج <em>بشكلٍ منتظم</em>، ومن ثمّ فإنّ $QNANDEVAL$ في $\\mathbf{BQP}$.
وهذا يتيح لنا &quot;نقل&quot; كثيرٍ من نتائج التعقيد الحوسبّي الكلاسيكيّ إلى عالم الكمّ أيضًا.</p>
<p>::: {.remark title=&quot;الاقتصار على الدوائر&quot; #quantumnonuniformrem}
ولأنّ النموذج غير المنتظم أنظف قليلًا في العمل، فإنّنا في بقية هذا الفصل نقتصر في الغالب على هذا النموذج، وإنّما كلّ الخوارزميّات التي نتناولها يمكن تنفيذها في الحساب المنتظم أيضًا.
:::</p>
<h2 id="التحقق-الفيزيائي-من-الحوسبة-الكمية">التحقّق الفيزيائيّ من الحوسبة الكمّية</h2>
<p>ولتحقيق الحوسبة الكمّية فيزيائيًّا، يحتاج المرء إلى إنشاء نظامٍ فيه $n$ حالة ثنائيّة مستقلّة (أي &quot;كيوبِتات&quot;)، وإلى القدرة على التلاعب بمجموعاتٍ صغيرة من اثنين أو ثلاثةٍ من هذه الكيوبِتات لتغيير حالتها.
في حين إنّ الطريقة التي عرّفنا بها العمليات أعلاه قد توحي بأنّ المرء يحتاج إلى القدرة على تنفيذ عملياتٍ وحاديّةٍ اعتباطيّة على هذين الكيوبِتَين أو الثلاثة، يتبيّن أنّ هناك عدّة خيارات لـ_مجموعاتٍ شاملة_ — أي عددٍ ثابتٍ صغيرٍ من البوّابات تولّد كلّ البوّابات الأخرى.
أكبر تحدٍّ هو كيفية منع النظام من أن يُقاس وينهار <em>منهارًا</em> إلى تركيبةٍ كلاسيكيّةٍ واحدة من الحالات.
وتُعرف هذه أحيانًا بـ_زمن التماسك_ (<em>coherence time</em>) للنظام.
وتقول <a href="https://courses.cs.washington.edu/courses/cse599d/06wi/lecturenotes19.pdf">نظرية العتبة</a> إنّ هناك مستوى أخطاءٍ ثابتًا مطلقًا $\\tau$ بحيث إذا تكوّنت الأخطاء عند كلّ بوّابة بمعدّلٍ أصغر من $\\tau$ أمكننا التعافي منها وتنفيذ حساباتٍ عشوائية الطول. (وبالطبع هناك طرائقٌ مختلفة لنمذجة الأخطاء، ولذلك توجد فعليًّا عدةُ نظرياتِ <em>عتبةٍ</em> موافقةً لنماذج ضجيجٍ مختلفة).</p>
<p>هناك عدّة مقترحات لبناء حواسيب كمّية:</p>
<ul>
<li>
<p>تستعمل <a href="https://arxiv.org/abs/1905.13641">الحواسيب الكمّية فائقة التوصيل</a> دوائرَ كهربائيّة فائقة التوصيل لإجراء الحوسبة الكمّية. وهذه حاليًّا هي الأجهزة ذات أكبر عددٍ من الكيوبِتات القابلة للتحكّم بالكامل.</p>
</li>
<li>
<p>في هارفارد، تستخدم مجموعة لوكين <a href="https://lukin.physics.harvard.edu/arrays-cold-atoms">الذرّات الباردة</a> لتنفيذ حواسيب كمّية.</p>
</li>
<li>
<p>تستعمل <a href="https://en.wikipedia.org/wiki/Trapped_ion_quantum_computer">الحواسيب الكمّية ذات الأيونات المحتجَسة</a> حالات أيونٍ ما لمحاكاة كيوبِت. وأجرى الناس بعض <a href="http://iontrap.umd.edu/wp-content/uploads/2016/02/1602.02840v1.pdf">التقدّمات الحديثة</a> على هذه الحواسيب أيضًا. على سبيل المثال، استُخدم حاسوبُ احتجاس أيونات في <a href="http://arxiv.org/abs/1507.08852">تنفيذ خوارزمية شور لتحليل العدد 15</a>. (ويُبيَّن أنّ $15=3\\times 5$ :) )</p>
</li>
<li>
<p>تستعمل <a href="https://en.wikipedia.org/wiki/Topological_quantum_computer">الحواسيب الكمّية الطوبولوجيّة</a> تقنيةً مختلفة، وهي أكثر ثباتًا بالتصميم، لكنّ التلاعب بها لإنشاء حواسيب كمّية أصعب على الأرجح.</p>
</li>
</ul>
<p>هذه المقاربات ليست متعارضةً فيما بينها، وقد يكون الأمر في النهاية أنّ الحواسيب الكمّية تُبنى بالجمع بينها جميعًا.
في الوقت الحالي، لدينا أجهزةٌ فيها نحو $100$ كيوبِت، ونسبة خطأ نحو $1%$ لكلّ بوّابة.
وتُسمّى هذه الأجهزة المقيَّدة أحيانًا &quot;الحواسيب الكمّية المتوسّطة ضوضاء&quot; أو &quot;NISQ&quot;.
وانظر <a href="https://arxiv.org/abs/1801.00862">هذا المقال لجون بريسكيل</a> لتطّلع على بعض التقدّم والتطبيقات لهذه الأجهزة الأكثر تقييدًا.
وإذا زاد عددُ الكيوبِتات وانخفض الخطأ بمقدار رتبةٍ أو رتبتين عشريّتين، لأمكننا أن نبدأ برؤية مزيدٍ من التطبيقات.</p>
<p><img src="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-3.webp" alt="/images/introtcs/lec_26_quantum_computing-3.webp">{#googlequantumfig .margin width=300px height=300px}</p>
<h2 id="خوارزمية-شور-سماع-شكل-العوامل-الأولية">خوارزمية شور: سماع شكل العوامل الأوّليّة</h2>
<p>متباينة بِل عرضٌ قويّ يدلّ على أنّ ثمة أمرًا غريبًا جدًّا يجري في الميكانيكا الكمّية.
لكنّ هل يمكن لهذه &quot;الغريبة&quot; أن تنفع في حلّ مسائلَ حوسبيةٍ لا صلة لها مباشرةً بالأنظمة الكمّية؟
في البديهة، يمكن للمرء أن يخمن بأنّ الجواب <em>لا</em>.
وفي عام 1994 أثبت بيتر شور أنّ واحدًا يكون مخطئًا في ذلك:</p>
<p>::: {.theorem title=&quot;خوارزمية شور&quot; #shorthm}
هناك خوارزميّة كمّية بزمن متعدّد الحدود، تأخذ كمدخل عددًا صحيحًا $M$ (ممثَّلًا بالأساس الثنائي)، وتُخرج التحليلَ الأوّليّ لـ $M$.
:::</p>
<p>وتوجد طريقةٌ أخرى لصياغة <a href="https://www.youtube.com/watch?v=Y9pYHDSxc7g">shorthm</a>{.ref} وهي أنّه إذا عرّفنا $FACTORING:{0,1}^* \\rightarrow {0,1}$ لتكون الدالّة التي تأخذ كمدخل زوجَين من الأعداد $(M,X)$ وتُخرج $1$ إذا وفقط إذا كان لـ $M$ عاملٌ $P$ بحيث $2 \\leq P \\leq X$، فإنّ $FACTORING$ في $\\mathbf{BQP}$.
وهذا تحسّنٌ أسّيّ مقارنةً بأفضل الخوارزميات الكلاسيكيّة المعروفة، التي تستغرق نحو $2^{\\tilde{O}(n^{1/3})}$ من الزمن، حيث يخفي ترميز $\\tilde{O}$ عواملَ متعدّدة اللوغاريتم في $n$.
ولن نُثبت <a href="https://www.youtube.com/watch?v=i_0DXxNeaQ0">shorthm</a>{.ref} في هذا الفصل، لكنّنا سنرسم بعض الأفكار الكامنة وراء الإثبات.</p>
<h3 id="إيجاد-الدورية">إيجاد الدورية</h3>
<p>في قلب نظرية شور تكمن خوارزميّة كمّية كَفئة لإيجاد <em>دوريّات</em> دالّةٍ معطاة.
على سبيل المثال، الدالّة $f:\\R \\rightarrow \\R$ تكون <em>دوريّة</em> إذا كان هناك $h&gt;0$ بحيث $f(x+h)=f(x)$ لكلّ $x$ (انظر مثلًا <a href="https://www.youtube.com/watch?v=BM429cOogYc">periodicfig</a>{.ref}).</p>
<p><img src="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-4.webp" alt="/images/introtcs/lec_26_quantum_computing-4.webp">{#periodicfig .margin width=300px height=300px}</p>
<p><em>النوتات الموسيقية</em> تعطي نوعًا من الدوالّ الدوريّة.
فحين تشدّ وترًا في آلةٍ موسيقية، فإنّه يهتزّ بنمطٍ متكرّر.
ومن ثمّ، إن رسمنا سرعة الوتر (وعليه أيضًا سرعة الهواء حوله) بدالّةٍ للزمن، فإنّها ستقابل دالّةً <em>دوريّةً ما</em>.
وطول الدورة يُعرف بـ_الطول الموجيّ_ (<em>wave length</em>) للنوتة.
و_التردّد_ (<em>frequency</em>) هو عدد المرّات التي تتكرّر فيها الدالّة نفسها خلال وحدةٍ من الزمن.
على سبيل المثال، نوتة &quot;-do&quot; الوسطى (&quot;Middle C&quot;) تردّدها $261.63$ هرتز، ما يعني أنّ دورتها $1/(261.63)$ ثانية.
وإذا عزفنا <em>وترًا</em> (<em>chord</em>) بالعزف على عدّة نوتاتٍ في آنٍ واحد، نحصل على دالّةٍ دوريّةٍ أعقد، تُنشأ بالجمع بين دوالّ النوتات المنفردة (انظر <a href="https://www.math.ias.edu/avi/book">timefreqfig</a>{.ref}).
تحتوي الأذن البشريّة على شعيراتٍ صغيرةٍ كثيرة، كلُّ منها حسّاسٌ لنطاقٍ ضيّقٍ من التردّددات.
ومن ثمّ، حين نسمع الصوت المقابل لوترٍ ما، فإنّ شعيرات أذُنينا تفصله في الواقع إلى مكوّناته الموافقة لكلّ تردّد.</p>
<p><img src="https://inst.eecs.berkeley.edu/~cs191/" alt="Left: The air-pressure when playing a &quot;C Major&quot; chord as a function of time. Right: The coefficients of the Fourier transform of the same function, we can see that it is the sum of three freuencies corresponding to the C, E and G notes (261.63, 329.63 and 392 Hertz respectively). Credit: Bjarke Mønsted's Quora answer. ">{#timefreqfig .margin width=300px height=300px}</p>
<p>يتبيّن أنّ (في جوهرها) <em>كلّ</em> دالّةٍ دوريّة $f:\\R \\rightarrow \\R$ يمكن تفكيكها إلى مجموع دوالّ <em>موجيّة</em> بسيطة (أي دوالّ من الشكل $x \\mapsto \\sin(\\theta x)$ أو $x \\mapsto \\cos(\\theta x)$).
ويُعرف هذا بـ<a href="https://en.wikipedia.org/wiki/Fourier_transform">تحويل فورييه</a> (انظر <a href="https://cs.uwaterloo.ca/~watrous/LectureNotes.html">qfourierfig</a>{.ref}).
ويجعل تحويل فورييه حسابَ دورة دالّةٍ معطاة أمرًا يسيرًا: فهي ببساطة المضاعف المشترك الأدنى لدوريات الموجات المكوّنة لها.</p>
<p><img src="/arabic-cs-library/images/introtcs/lec_26_quantum_computing-6.webp" alt="/images/introtcs/lec_26_quantum_computing-6.webp">{#qfourierfig .margin width=300px height=300px}</p>
<h3 id="خوارزمية-شور-نظرة-من-مرتفع">خوارزمية شور: نظرة من مرتفع</h3>
<p>تأخذ خوارزمية شور كمدخل عددًا صحيحًا $M$، وتُخرج التحليلَ الأوّليّ لـ $M$ في زمنٍ متعدّد الحدود في $\\log M$.
والخطوات الرئيسيّة في الخوارزميّة هي:</p>
<p><strong>الخطوة 1: الاختزال إلى إيجاد الدورية.</strong> تتمثّل الخطوة الأولى في الخوارزميّة في اختيار $A\\in {0,1\\ldots,M-1}$ عشوائيًّا وتعريف الدالّة $F_A:{0,1}^m \\rightarrow {0,1}^m$ على أنّها $F_A(x)= A^x (\\mod M)$، حيث نطابق السلسلةَ $x \\in {0,1}^m$ مع عددٍ صحيحٍ باستخدام التمثيل الثنائي، ومثلًا نمثّل العددَ $A^x (\\mod M)$ كسلسلة. (سنختار $m$ لتكون متعدّدةَ الحدود في $m$، ومن ثمّ فبخاصة \${0,1}^m$ مجموعةٌ كبيرةٌ بما يكفي لتمثيل كلّ الأعداد في \${0,1,\\ldots, M-1 }$).</p>
<p>تُظهر حساباتٌ ليست صعبةً جدًّا (لكنّها تقنيةٌ إلى حدٍّ ما) أنّ: <strong>(1)</strong> الدالّة $F_A$ <em>دوريّة</em> (أي أنّه هناك عددٌ صحيح $p_A$ بحيث $F_A(x+p_A)=F_A(x)$ لكلّ $x$ تقريبًا^[سنُهمل هذا القيد &quot;تقريبًا&quot; في المناقشة أدناه. وهو يسبّب بعض المسائل التقنية المزعجة، القابلة للإدارة في النهاية، في الخوارزميّة الكاملة.])، والأهمّ <strong>(2)</strong> إذا استطعنا استرجاع الدورة $p_A$ لـ $F_A$ بالنسبة إلى عدّة قيمَ $A$ مختارةٍ عشوائيًّا، استطعنا عندئذٍ استرجاع تحليل $M$ إلى عوامله.
وعليه، فإنّ تحليل $M$ إلى عوامله يختزل في معرفة دورة الدالّة $F_A$.
و <a href="https://www.youtube.com/watch?v=xM3GOXaci7w">dlogfromorder</a>{.ref} يطلب منك تنفيذ ذلك على المهمة المرتبطة بحساب <em>اللوغاريتم المتقطّع</em> (الذي يقوم عليه أمن تبادل المفاتيح في ديفي-هيلمان وتعمية المنحنيات الإهليلجية).</p>
<p><strong>الخطوة 2: إيجاد الدورية عبر تحويل فورييه الكمّي.</strong>
باستعمال حيلةٍ بسيطة تُعرف بـ&quot;التربيع المتكرّر&quot;، من الممكن حسابُ الخريطة $x \\mapsto F_A(x)$ في زمنٍ متعدّد الحدود في $m$، ما يعني أنّه يمكننا أيضًا حساب هذه الخريطة باستعمال عددٍ متعدّد الحدود من بوّابات NAND، ومن ثمّ فبخاصة يمكننا في زمنٍ كمّيّ متعدّد الحدود توليد حالةٍ كمّية $\\rho$ تساوي (حتى التطبيع)</p>
<p>$$
\\sum_{x\\in {0,1}^m} |x\\rangle |F_A(x) \\rangle ;;.
$$</p>
<p>وبخاصة، إن قِسنا الحالة $\\rho$ فإنّنا سنحصل على زوجٍ عشوائيٍّ من الشكل $(x,y)$ حيث $y= F_A(x)$.
إلى هنا، لا يوجد شيء مُبهر إطلاقًا. فبعد كلّ شيء، لم نكن بحاجة إلى قوّة الحوسبة الكمّية لتوليد أزواجٍ كهذه: يمكننا ببساطة توليد $x$ عشوائيّ ثمّ حساب $F_A(x)$.</p>
<p>وتوجد طريقةٌ أخرى لوصف الحالة $\\rho$ وهي أنّ معامل $|x \\rangle |y \\rangle$ في $\\rho$ متناسبٌ مع $f_{A,y}(x)$ حيث $f_{A,y} : {0,1}^m \\rightarrow \\R$ هي الدالّة التي
$$f_{A,y}(x) = \\begin{cases} 1 &amp; y = A^x (\\mod M) \\ 0 &amp; \\text{otherwise} \\end{cases} ;.$$</p>
<p>يأتي سحر خوارزمية شور من إجراءٍ يُعرف بـ<a href="https://en.wikipedia.org/wiki/Quantum_Fourier_transform"><em>تحويل فورييه الكمّي</em></a>. وهو يسمح بتغيير الحالة $\\rho$ إلى الحالة $\\hat{\\rho}$ حيث يكون معامل $|x\\rangle|y \\rangle$ متناسبًا الآن مع <em>معامل فورييه رقم $x$</em> لـ $f_{A,y}$.
بمعنى آخر، إن قِسنا الحالة $\\hat{\\rho}$، فسنحصل على زوجٍ $(x,y)$ بحيث احتمال اختيار $x$ متناسبٌ مع مربّع وزن <em>التردّد</em> $x$ في تمثيل الدالّة $f_{A,y}$.
وبما أنّ الدالّة $f_{A,y}$ لكلّ $y$ لها الدورة $p_A$، فيمكن إثبات أنّ التردد $x$ سيكون (تقريبًا^[يظهر قيد &quot;تقريبًا&quot; مرّةً أخرى لأنّ الدالّة الأصليّة كانت &quot;تقريبًا&quot; دوريّة، لكنّه يتبيّن أنّه يمكن معالجة ذلك باستعمال خوارزميّة &quot;أكبر قاسم مشترك تقريبيّ&quot; بدلًا من القاسم المشترك العاديّ أدناه. ويمكن الحصول على الأخير باستعمال أداةٍ تُعرف بالتمثيل بالكسور المستمرةّ لعددٍ ما.]) مضاعفًا لـ $p_A$.
فإذا أخذنا عدّة عيناتٍ كهذه $y_0,\\ldots,y_k$ وحصلنا على التردّدات $x_1,\\ldots,x_k$، فإنّ الدورة الحقيقيّة $p_A$ تقسم جميعها، ويمكن إثبات أنّها ستكون في الواقع <em>أكبر القواسم المشتركة</em> (<em>g.c.d.</em>) لكلّ هذه التردّدات: قيمةٌ يمكن حسابها في زمن متعدّد الحدود.
وكما ذكرنا أعلاه، يمكننا استرجاع تحليل $M$ إلى عوامله من دورات $F_{A_0},\\ldots,F_{A_t}$ لبعض $A_0,\\ldots,A_t$ المختارة عشوائيًّا في \${0,\\ldots, M-1}$، و$t$ متعدّدةِ الحدود في $\\log M$.</p>
<p>ويمكن وصف الخوارزميّة الناتجة على مستوى عالٍ (إلى حدٍّ ما غير دقيق) كالتالي:</p>
<p>::: {.quote}
<strong>خوارزمية شور:</strong> <em>(مخطّط)</em></p>
<p><strong>المدخل:</strong> العدد $M\\in \\N$</p>
<p><strong>الناتج:</strong> التحليل الأوّليّ للعدد $M$</p>
<p><strong>العمليات:</strong></p>
<ol>
<li>
<p>كرّر ما يلي $k=poly(\\log M)$ مرّة:</p>
<p>أ. اختر $A \\in {0,\\ldots,M-1}$ عشوائيًّا، ودع $f_A:\\Z_M \\rightarrow \\Z_M$ تكون الخريطة $x \\mapsto A^x \\mod M$.</p>
<p>ب. من أجل $t=poly(\\log M)$، كرّر الخطوة التالية $t$ مرّات: <em>تحويل فورييه الكمّي</em> لإنشاء حالةٍ كمّية $| \\psi \\rangle$ على $poly(\\log(m))$ كيوبِت، بحيث إن قِسنا $| \\psi \\rangle$ نحصل على زوجٍ من السلاسل $(j,y)$ باحتمالٍ متناسبٍ مع مربّع المعامل المقابل لدالّة الموجة $x \\mapsto \\cos(x \\pi j/M)$ أو $x \\mapsto \\sin(x \\pi j/M)$ في تحويل فورييه للدالّة $f_{A,y}:\\Z_m \\rightarrow {0,1}$ المعرّفة بأنّ $f_{A,y}(x)=1$ إذا وفقط إذا كان $f_A(x)=y$.</p>
<p>ج. إذا كانت $j_1,\\ldots,j_t$ هي المعاملات التي حصّلناها في الخطوة السابقة، فإنّ المضاعف المشترك الأدنى لـ $M/j_1,\\ldots,M/j_t$ على الأرجح هو <em>دورة</em> الدالّة $f_A$.</p>
</li>
<li>
<p>إذا كان $A_0,\\ldots,A_{k-1}$ و $p_0,\\ldots,p_{k-1}$ هما العددين اللذين اخترناهما في الخطوة السابقة والدورات الموافقة للدوالّ $f_{A_0},\\ldots,f_{A_{k-1}}$، فيمكننا استعمال نتائج كلاسيكيّة في نظرية الأعداد للحصول منهما على عاملٍ أوّليّ غير تامّ $Q$ للعدد $M$ (إن وُجد). ويمكننا عندئذٍ تشغيل الخوارزميّة مرّةً أخرى على المدخل (الأصغر) $M/Q$ للحصول على كلّ العوامل الأخرى.
:::</p>
</li>
</ol>
<p>الاختزال من تحليل الأعداد إلى عواملها إلى إيجاد رتبتها مُرهِق، لكنّه يمكن إنجازه في زمن متعدّد الحدود باستعمال حاسوبٍ كلاسيكيّ. والمكوّن الكمّي الرئيس في خوارزمية شور هو <em>تحويل فورييه الكمّي</em>.</p>
<p>::: {.remark title=&quot;تحويل فورييه الكمّي&quot; #QFT}
على رغم اسمه، فإنّ تحويل فورييه الكمّي <em>لا</em> يعطي فعليًّا طريقةً لحساب تحويل فورييه لدالّة $f:{0,1}^m \\rightarrow \\R$.
وهذا مستحيلٌ في زمنٍ متعدّد الحدود في $m$، إذ إنّ مجرد كتابة تحويل فورييه تتطلّب $2^m$ معاملًا.
بل إنّ تحويل فورييه الكمّي يعطي <em>حالةً كمّية</em> تكون فيها السعة الموافقة لعنصرٍ ما (فكّر: تردّد) $h$ مساويةً لمعامل فورييه المقابل.
وهذا يتيح أخذ عيّنة من توزيعٍ يُسحب منه $h$ باحتمالٍ متناسبٍ مع مربّع معامل فورييه الخاصّ به.
وهذا ليس حسابَ تحويل فورييه، لكنّه يكفي لاسترجاع الدورة.
:::</p>
<h2 id="تحويل-فورييه-الكمي-متقدم-اختياري">تحويل فورييه الكمّي (متقدّم، اختياري)</h2>
<p>الوصف أعلاه لخوارزمية شور قد تجاوز تنفيذ المكوّن الكمّي الرئيس: خوارزمية <em>تحويل فورييه الكمّي</em>.
في هذا القسم سنناقش الأفكار الكامنة وراء هذه الخوارزميّة.
سنكون قصيرين وغير دقيقين إلى حدٍّ ما.
ويحتوي <a href="http://www.feynmanlectures.caltech.edu/I_50.html">quantumsources</a>{.ref} و<a href="http://www.feynmanlectures.caltech.edu/III_toc.html">quantumbibnotessec</a>{.ref} على إشاراتٍ إلى مصادرَ لمعلوماتٍ أكثر حول هذا الموضوع.</p>
<p>لفهم تحويل فورييه الكمّي، نحتاج إلى فهم تحويل فورييه نفسه على نحوٍ أفضل.
وبخاصة، سنحتاج إلى فهم كيف ينطبق ليس فقط على الدوالّ التي مدخلها عددٌ حقيقيّ، بل وعلى الدوالّ التي نطاقها قد يكون أيّ <em>جماعة</em> (<em>group</em>) ابداعيّة مهما كانت.
وعليه، ننتقل الآن في excursiónٍ قصيرة إلى <em>نظرية الزمر</em> (بسطحة جدًّا)، ونعرّف مفهوم الدوالّ الدوريّة على الزمر.</p>
<p>::: {.remark title=&quot;نظرية الزمر&quot; #grouptheorem}
مع أنّنا سنعرّف المفاهيم التي نستعملها، فإنّ بعض الخلفية في نظرية الزمر أو في نظرية الأعداد قد تكون مفيدةً جدًّا لفهم هذا القسم فهمًا كاملًا.</p>
<p>ولن نستعمل سوى الخصائص الأساسيّة للزمر المنتهية الأبليّة (<em>Abelian</em>).
وبحدّة، نستعمل المفاهيم التالية:</p>
<ul>
<li>
<p>يمكن التفكير في <em>جماعة</em> منتهية $\\mathbb{G}$ على أنّها مجرّد مجموعةٍ من العناصر وبعض <em>العملية الثنائيّة</em> $\\star$ على هذه العناصر (أي أنّه إذا كان $g,h \\in \\mathbb{G}$ فإنّ $g \\star h$ عنصرٌ في $\\mathbb{G}$ أيضًا).</p>
</li>
<li>
<p>وتُحقّق العملية $\\star$ نوعَ الخصائص الذي تُحقّقه عمليةُ الضرب، أي إنّها <em>تجميعيّة</em> (أي $(g \\star h)\\star f = g \\star (h \\star f)$)، وهناك عنصرٌ ما $1$ بحيث $g \\star 1 = g$ لكلّ $g$، ولكلّ $g\\in \\mathbb{G}$ يوجد عنصرٌ $g^{-1}$ بحيث $g \\star g^{-1} = 1$.</p>
</li>
<li>
<p>تُسمّى الجماعة <em>تبادليّة</em> (وتُعرف أيضًا بـ_أبليّة_) إذا كان $g \\star h = h \\star g$ لكلّ $g,h \\in \\mathbb{G}$.
:::</p>
</li>
</ul>
<p>تحويل فورييه موضوعٌ عميقٌ وواسع، لن نلمس منه هنا إلّا القليل.
فوق الأعداد الحقيقيّة، يُحصل على تحويل فورييه للدالّة $f$ بالتعبير عن $f$ على الشكل $\\sum \\hat{f}(\\alpha)\\chi_\\alpha$ حيث $\\chi_\\alpha$ هي «دوالّ موجيّة» (مثل sine و cosine).
لكنّ يتبيّن أنّ المفهوم نفسه موجود لكلّ جماعةٍ أبليّة $\\mathbb{G}$.
وبحدّة، لكلّ جماعةٍ من هذا النوع $\\mathbb{G}$، إذا كانت $f$ دالّةً ترسم $\\mathbb{G}$ إلى $\\mathbb{C}$، فيمكننا كتابة $f$ على الصورة</p>
<p>$$f = \\sum_{g \\in \\mathbb{G}} \\hat{f}(g)\\chi_g ;;, \\label{fourierexpansion}$$</p>
<p>حيث $\\chi_g$ هي دوالٌ ترسم $\\mathbb{G}$ إلى $\\mathbb{C}$، وهي نظائر «الدوالّ الموجيّة» للجماعة $\\mathbb{G}$، ولكلّ $g\\in \\mathbb{G}$، يكون $\\hat{f}(g)$ عددًا معقّدًا يُعرف بـ_معامل فورييه المقابل لـ $f$ لـ $g$<em>.^[المعادلة <a href="https://en.wikipedia.org/wiki/Fast_Fourier_transform">fourierexpansion</a>{.eqref} تعني أنّه إذا نظرنا إلى $f$ على أنّها متّجهٌ ذو $|\\mathbb{G}|$ بعدٍ فوق الأعداد المعقّدة، فيمكننا كتابة هذا المتّجه على صورة مجموع (بمعاملاتٍ معيّنة) للمتجّهات \${ \\chi_g }</em>{g\\in \\mathbb{G}}$.]
ويُعرف التمثيل <a href="">fourierexpansion</a>{.eqref} بـ_تمدّد فورييه_ أو <em>تحويل فورييه</em> لـ $f$، وتُعرف الأعداد $( \\hat{f}(g) )<em>{g\\in\\mathbb{G}}$ بـ_معاملات فورييه</em> لـ $f$، وتُعرف الدوالّ $( \\chi_g )<em>{g\\in\\mathbb{G}}$ بـ_شخصيات فورييه</em> (<em>Fourier characters</em>).
والخاصيّة المركزيّة لشخصيات فورييه هي أنّها <em>تماثلاتٌ تجسيرية</em> (<em>homomorphisms</em>) من الجماعة إلى الأعداد المعقّدة، بمعنى أنّه لكلّ $x,x' \\in \\mathbb{G}$، $\\chi_g(x \\star x')=\\chi_g(x)\\chi_g(x')$، حيث $\\star$ هي عملية الجماعة.
ومن نتائج هذه الخاصيّة أنّه إذا كان $\\chi_g(h)=1$ فإنّ $\\chi_g$ <em>دوريّةٌ بـ $h$</em> بمعنى أنّ $\\chi_g(x \\star h)=\\chi_g(x)$ لكلّ $x$.
ويتبيّن أنّه إذا كانت $f$ دوريّةً بأدنى دورةٍ وهي $h$، فإنّ شخصيات فورييه الوحيدة التي لها معاملات غير صفرية في التعبير <a href="">fourierexpansion</a>{.eqref} هي أيضًا الدوريّة بـ $h$.
ويمكن استعمال هذا لاسترجاع دورة $f$ من تمدّدها الفوريهي.</p>
<h3 id="تحويل-فورييه-الكمي-فوق-المكعب-البولياني-خوارزمية-سيمون">تحويل فورييه الكمّي فوق المكعّب البولياني: خوارزمية سيمون</h3>
<p>نصف الآن أبسط إطارٍ لتحويل فورييه الكمّي: الجماعة \${0,1}^n$ مع عملية XOR، وسنرمز لها بـ $({0,1}^n,\\oplus)$.
ويمكن إثبات أنّ تحويل فورييه فوق $({0,1}^n,\\oplus)$ يقابل التعبير عن $f:{0,1}^n \\rightarrow \\mathbb{C}$ على الصورة</p>
<p>$$
f = \\sum_{y\\in {0,1}} \\hat{f}(y) \\chi_y
$$</p>
<p>حيث يُعرَّف $\\chi_y:{0,1}^n \\rightarrow \\mathbb{C}$ على أنّه $\\chi_y(x) = (-1)^{\\sum_i y_i x_i}$ و $\\hat{f}(y) = \\tfrac{1}{\\sqrt{2^n}}\\sum_{x\\in {0,1}^n} f(x)(-1)^{\\sum_i y_i x_i}$.</p>
<p>إنّ تحويل فورييه الكمّي فوق $({0,1}^n,\\oplus)$ بسيطٌ في الواقع إلى حدٍّ مذهل:</p>
<p>::: {.theorem title=&quot;تحويل فورييه الكمّي فوق المكعّب البولياني&quot; #QFTcube}
ليكن $\\rho = \\sum_{x\\in {0,1}^n} f(x)|x\\rangle$ حالةً كمّية حيث $f:{0,1}^n \\rightarrow \\mathbb{C}$ دالّةٌ ما تحقّق $\\sum_{x\\in {0,1}^n} |f(x)|^2 = 1$.
عندئذٍ يمكننا استعمال $n$ بوّابة لتحويل $\\rho$ إلى الحالة</p>
<p>$$\\sum_{y\\in {0,1}^n} \\hat{f}(y) |y \\rangle$$</p>
<p>حيث $f = \\sum_{y} \\hat{f}(y)\\chi_y$ و $\\chi_y:{0,1}^n \\rightarrow \\mathbb{C}$ هي الدالّة $\\chi_y(x) = -1^{\\sum x_iy_i}$.
:::</p>
<blockquote>
<h1>{.proofidea data-ref=&quot;QFTcube&quot;}</h1>
</blockquote>
<p>الفكرة وراء الإثبات هي أنّ عملية <em>هادامارد</em> تقابل <em>تحويل فورييه</em> فوق الجماعة \${0,1}^n$ (مع عمليات XOR). ولإثبات ذلك، ما على إلّا إجراء الحسابات.</p>
<p>::: {.proof data-ref=&quot;QFTcube&quot;}
يمكننا التعبير عن عملية هادامارد $HAD$ على النحو التالي:</p>
<p>$$ HAD|a\\rangle = \\tfrac{1}{\\sqrt{2}}(|0\\rangle+(-1)^a|1\\rangle) ;.$$</p>
<p>ولنا الحالة
$$\\rho = \\sum_{x\\in{0,1}^n} f(x)|x\\rangle ;.$$</p>
<p>ولنفترض الآن أنّنا نطبّق عملية $HAD$ على كلّ واحدٍ من الكيوبِتات $n$.
ونرى أنّنا نحصل على الحالة</p>
<p>$$2^{-n/2}\\sum_{x\\in{0,1}^n}f(x)\\prod_{i=0}^{n-1}(|0\\rangle+(-1)^{x_i}|1\\rangle) ;.
$$</p>
<p>ويمكننا الآن استعمال قانون التوزيع وفكّ حدٍّ من الشكل</p>
<p>$$f(x)\\bigl(|0\\rangle + (-1)^{x_0}|1\\rangle\\bigr) \\cdots  \\bigl(|0\\rangle + (-1)^{x_{n-1}}|1\\rangle\\bigr)$$</p>
<p>إلى المجموع التالي على $2^n$ حدًّا:^[إن وجدتَ هذا محيّرًا، فحاول أن تتبيّن لماذا $\\bigl(|0\\rangle + (-1)^{x_0}|1 \\rangle\\bigr) \\bigl(|0\\rangle + (-1)^{x_1}|1 \\rangle \\bigr) \\bigl(|0\\rangle + (-1)^{x_2}|1 \\rangle \\bigr)$ هو نفسه المجموع على $2^3$ حدًّا
$|000\\rangle + (-1)^{x_2}|001\\rangle + \\cdots +(-1)^{x_0+x_1+x_2}|111\\rangle$.]</p>
<p>$$
f(x) \\sum_{y \\in {0,1}^n} (-1)^{\\sum y_ix_i}|y \\rangle ;.
$$</p>
<p>لكنّ بتغيير ترتيب المجاميع، نرى أنّ الحالة النهائيّة هي</p>
<p>$$
\\sum_{y \\in {0,1}^n} 2^{-n/2}\\bigl(\\sum_{x\\in {0,1}^n} f(x) (-1)^{\\sum x_i y_i} \\bigr) | y \\rangle
$$</p>
<p>وهي تقابل $\\hat{\\rho}$ تمامًا.
:::</p>
<h3 id="من-فورييه-إلى-إيجاد-الدورية-خوارزمية-سيمون-متقدمة-اختيارية">من فورييه إلى إيجاد الدورية: خوارزمية سيمون (متقدّمة، اختياريّة)</h3>
<p>باستعمال <a href="">QFTcube</a>{.ref}، ليس صعبًا الحصول على خوارزميّة تستطيع استرجاع سلسلةٍ $h^* \\in {0,1}^n$، انطلاقًا من دائرةٍ تحسب دالّةً $F:{0,1}^n \\rightarrow {0,1}^<em>$ <em>دوريّةً بـ</em> $h^</em>$ بمعنى أنّ $F(x)=F(x')$ لـ $x,x'$ مختلفَين إذا وفقط إذا كان $x' = x \\oplus h^*$.
والملاحظة المفتاحيّة هي أنّه إذا حسبنا الحالة $\\sum_{x\\in {0,1}^n} |x \\rangle |F(x) \\rangle$، وأجرينا تحويل فورييه الكمّي على الكيوبِتات $n$ الأولى، فسنحصل على حالةٍ لا تكون عناصرُها الأساسيّة ذات المعاملات غير الصفرية إلّا على صورة $|y \\rangle$ حيث</p>
<p>$$
\\sum y_i h^*_i = 0 (\\mod 2) \\label{eq:periodbooleanqft}
$$</p>
<p>إذًا، بقياس الحالة، يمكننا الحصول على عيّنةٍ لـ $y$ عشوائيّ يحقّق <a href="">eq:periodbooleanqft</a>{.eqref}.
لكنّ بما أنّ <a href="">eq:periodbooleanqft</a>{.eqref} معادلةٌ <em>خطّيّة</em> بالمودولو $2$ في $n$ متغيّراتٍ مجهولةٍ هي $h^<em>_0,\\ldots,h^</em>_{n-1}$، فإنّنا إذا كرّرنا هذا الإجراء للحصول على $n$ من هذه المعادلات،فإنّنا سنحصل على عددٍ من المعادلات لا يقلّ عن عدد المتغيّرات، وسيكفي ذلك (ويمكن إثباته) لاسترجاع $h^*$.&quot;</p>
<p>وتُعرف هذه النتيجة بـ<a href="https://en.wikipedia.org/wiki/Simon%27s_problem">خوارزمية سيمون</a>، وقد سبقَت خوارزمية شور وألهمتها.</p>
<h3 id="من-سيمون-إلى-شور-متقدمة-اختيارية">من سيمون إلى شور (متقدّمة، اختياريّة)</h3>
<p>بدا أنّ <a href="">QFTcube</a>{.ref} يستغلّ حقًّا البنيةَ الخاصّة البيتية للجماعة \${0,1}^n$، ومن ثمّ يمكن للمرء أن يتساءل عمّا إذا كان يمكن تمديده إلى جماعاتٍ أخرى.
لكنّ يتبيّن أنّه يمكننا في الواقع تحقيق مثل هذا التعميم.</p>
<p>والخطوة المفتاحيّة في خوارزمية شور هي تنفيذ تحويل فورييه للجماعة $\\Z_L$، وهي مجموعة الأعداد \${0,\\ldots,L-1}$ مع عملية الجمع بالمودولو $L$.
في هذه الحالة يتبيّن أنّ شخصيات فورييه هي الدوالّ $\\chi_y(x) = \\omega^{yx}$ حيث $\\omega = e^{2\\pi i/L}$ (وهنا $i$ تشير إلى العدد المعقّد $\\sqrt{-1}$).
ومعاملُ فورييه رقم $y$ في الدالّة $f:\\Z_L \\rightarrow \\mathbb{C}$ هو</p>
<p>$$\\hat{f}(y) = \\tfrac{1}{\\sqrt{L}}\\sum_{x\\in \\Z_L} f(x)\\omega^{xy} ;. \\label{fouriercoeffmodular}$$</p>
<p>ومفتاح تنفيذ تحويل فورييه الكمّي لمثل هذه الجماعات هو استعمال المعادلات العوديّة نفسها التي تُمكِّن خوارزمية <a href="https://en.wikipedia.org/wiki/Fast_Fourier_transform">تحويل فورييه السريع (FFT)</a> الكلاسيكيّة.
وبحدّة، لنفكّر في الحالة $L=2^\\ell$.
ويمكننا فصل المجموع على $x$ في <a href="">fouriercoeffmodular</a>{.eqref} إلى الحدود الموافقة لـ $x$ الزوجية (من الشكل $x=2z$) و $x$ الفردية (من الشكل $x=2z+1$) فنحصل على</p>
<p>$$\\hat{f}(y) = \\tfrac{1}{\\sqrt{L}}\\sum_{z \\in Z_{L/2}} f(2z)(\\omega^2)^{yz} + \\tfrac{\\omega^y}{\\sqrt{L}}\\sum_{z\\in \\Z_{L/2}}f(2z+1)(\\omega^2)^{yz} \\label{eqfftrecurse}
$$</p>
<p>وهذا يختزل حساب تحويل فورييه لـ $f$ فوق الجماعة $\\Z_{2^\\ell}$ في حساب تحويل فورييه للدوالّ
$f_{even}$ و$f_{odd}$ (الموافقة لتطبيق $f$ على $x$ الزوجية والفردية على التوالي)، ولديهما $2^{\\ell-1}$ مدخلًا يمكننا مطابقتها مع الجماعة $\\Z_{2^{\\ell-1}}=\\Z_{L/2}$.
وبحدّة، شخصيات فورييه للجماعة $\\Z_{L/2}$ هي الدوالّ $\\chi_y(x) = e^{2\\pi i/(L/2) yx} = (\\omega^2)^{yx}$ لكلّ $x,y \\in \\Z_{L/2}$.
وعلاوةً على ذلك، بما أنّ $\\omega^L = 1$، فإنّ $(\\omega^2)^y = (\\omega^2)^{y \\mod L/2}$ لكلّ $y\\in \\N$.
وعليه تُترجَم <a href="">eqfftrecurse</a>{.eqref} إلى
$$\\hat{f}(y) = \\hat{f}<em>{even}(y \\mod L/2) + \\omega^y \\hat{f}</em>{odd}(y \\mod L/2) ;.
$$</p>
<p>وتُستعمل هذه الملاحظة عادةً للحصول على زمنٍ سريع (مثل $O(L \\log L)$) لحساب تحويل فورييه في إطارٍ كلاسيكيّ، لكنّها يمكن أن تُستعمل للحصول على دائرةٍ كمّية من $poly(\\log L)$ بوّابة لتحويل حالةٍ من الشكل $\\sum_{x\\in \\Z_L} f(x)|x\\rangle$ إلى حالةٍ من الشكل $\\sum_{y\\in \\Z_L} \\hat{f}(y)|y \\rangle$.</p>
<p>الحال أنّه إذا لم يكن $L$ قوةً دقيقةً للعدد 2 فإنّ ذلك يسبّب بعض التعقيدات في كلٍّ من الحالة الكلاسيكيّة لتحويل فورييه السريع والإطار الكمّي لخوارزمية شور.
لكنّ من الممكن معالجتها.
والفكرة أنّه يمكننا غمر $Z_L$ في الجماعة $\\Z_{A\\cdot L}$ لأيّ عددٍ صحيح $A$، ويمكننا إيجاد عددٍ صحيح $A$ بحيث يكون $A\\cdot L$ قريبًا بما يكفي من قوةٍ للعدد $2$ (أي عددٍ من الشكل $2^m$ لبعض $m$)، بحيث إن أجرينا تحويل فورييه فوق الجماعة $\\Z_{2^m}$ لم نُدخل أخطاءً كثيرةً.</p>
<blockquote>
<h1>{ .recap }</h1>
</blockquote>
<ul>
<li>يمكن نمذجة حالة نظامٍ كمّي من $n$ كيوبِت بأنّها متّجهٌ ذو $2^n$ بعد.</li>
<li>وتُقابل أيّ عمليةٍ على الحالة بتطبيق مصفوفةٍ وحاديّة على هذا المتّجه.</li>
<li>وتُنشأ الدوائر الكمّية بترطيب عملياتٍ أساسيّة مثل $HAD$ و$U_{NAND}$.</li>
<li>يمكننا استعمال الدوائر الكمّية لتعريف الصنفين $\\mathbf{BQP_{/poly}}$ و$\\mathbf{BQP}$، وهما النظيران الكمّيان لـ $\\mathbf{P_{/poly}}$ و$\\mathbf{BPP}$ على التوالي.</li>
<li>وهناك بعض المسائل التي تكون فيها أفضل خوارزميّة كمّية معروفة <em>أسّيّةً أسرع</em> من أفضل خوارزميّة معروفة، لكنّ الحوسبة الكمّية ليست دواءً شافيًا. وبخاصة، حسب علمي، قد لا تزال الحواسيب الكمّية تحتاج إلى زمنٍ أسّيّ لحلّ مسائل $\\mathbf{NP}$-كاملة مثل $SAT$.</li>
</ul>
<div class="exercises"><h2 id="التمارين">التمارين</h2>
<p>::: {.remark title=&quot;إخلاء مسؤولية&quot; #disclaimerrem}
كُتب معظمُ التمارين في صيف عام 2018 ولم تُختبر بشكلٍ كامل بعد. وفي حين أفضّل ألّا ينشر الناس حلولًا للتمارين على الإنترنت، فإنّني سأقدّر حقًّا إن أخبرتوني بأيّ عيوب. ويمكنكم فعل ذلك عن طريق نشر <a href="https://github.com/boazbk/tcs/issues">مسألة على GitHub</a> عن التمرين، وإرفاقها اختياريًّا برسالة بريد إلكترونيّ إليّ تتضمّن تفاصيلَ أكثر عن الحلّ المحاول.
:::</p>
<p>::: {.exercise title=&quot;علاقات أصناف التعقيد الكمّية والكلاسيكيّة&quot; #BQPcontainements}
أثبت العلاقات التالية بين أصناف التعقيد الكمّية وأصناف التعقيد الكلاسيكيّة:</p>
<ol>
<li>
<p>$\\mathbf{P_{/poly}} \\subseteq \\mathbf{BQP_{/poly}}$.^[<em>تلميح:</em> يمكنك استعمال $U_{NAND}$ لمحاكاة بوّابات NAND.]</p>
</li>
<li>
<p>$\\mathbf{P} \\subseteq \\mathbf{BQP}$.^[<em>تلميح:</em> استعمال التوصيف البديل لـ $\\mathbf{P}$ كما في <a href="">characterizationofp</a>{.ref}.]</p>
</li>
<li>
<p>$\\mathbf{BPP} \\subseteq \\mathbf{BQP}$.^[<em>تلميح:</em> يمكنك استعمال بوّابة $HAD$ لمحاكاة قذف قطعة نقد.]</p>
</li>
<li>
<p>$\\mathbf{BQP} \\subseteq \\mathbf{EXP}$.^[<em>تلميح:</em> في الزمن الأسّيّ تنحصر محاكاة الحوسبة الكمّية في ضرب المصفوفات.]</p>
</li>
<li>
<p>إذا كان $SAT \\in \\mathbf{BQP}$ فإنّ $\\mathbf{NP} \\subseteq \\mathbf{BQP}$.^[<em>تلميح:</em> إذا أمكن تنفيذ تخفيضٍ ما في $\\mathbf{P}$، فيمكن تنفيذه في $\\mathbf{BQP}$ أيضًا.]
:::</p>
</li>
</ol>
<p>::: {.exercise title=&quot;اللوغاريتم المتقطّع من إيجاد الرتبة&quot; #dlogfromorder}
اعرض خوارزميّة كلاسيكيّة احتماليّة بزمن متعدّد الحدود، تُعطى جماعةٌ منتهية أبليّة $\\mathbb{G}$ (على صورة خوارزميّة تحسب عملية الجماعة)، ومُولِّدٌ $g$ للجماعة، وعنصرٌ $h \\in \\mathbb{G}$، إضافةً إلى وصولٍ إلى صندوقٍ أسود يُخرج، على مدخلٍ $f\\in \\mathbb{G}$، <em>رتبةَ</em> $f$ (أصغر $a$ بحيث $f^a =1$)، فتحسب <em>اللوغاريتم المتقطّع</em> لـ $h$ بالنسبة إلى $g$.
أي أنّ الخوارزميّة ينبغي أن تُخرج عددًا $x$ بحيث $g^x = h$.
انظر الحاشية للتلميح.^[لدينا $h=g^x$ ونحتاج إلى استرجاع $x$. وللعمل على ذلك يمكننا حساب رتبة عناصرٍ مختلفةٍ من الشكل $h^ag^b$. ورتبة عنصرٍ كهذا عددٌ $c$ يحقّق $c(xa+b) = 0 \\pmod{|\\mathbb{G}|}$. وبعدة أمثلةٍ عشوائيّة سنحصل على معادلةٍ غير تامّةٍ في $x$ (حيث $c$ لا تساوي صفرًا بالمودولو $|\\mathbb{G}|$)، ومن ثمّ يمكننا استعمال معرفتنا بـ $a,b,c$ لاسترجاع $x$.]
:::</p>
<h2 id="ملاحظات-المراجع-quantumbibnotessec">ملاحظات المراجع { #quantumbibnotessec }</h2>
<p>الفصلان 9 و10 في الكتاب <em>Quantum Computing Since Democritus</em> يقدّمان مقدّمةً غير رسميّة لكنّها غنيّةٌ جدًّا بالمعلومات إلى مواضيع هذه المحاضرة وإلى ما هو أكثر بكثير.
وتُغطّى خوارزميّتا شور وسيمون أيضًا في الفصل 10 من كتابي مع أورورا عن التعقيد الحوسبّي.</p>
<p>وهناك فيديوهاتٌ ممتازةٌ كثيرة متاحةٌ على الإنترنت تغطّي بعض هذه المواد.
تحويل فورييه مغطًّى في فيديوهات <a href="https://youtu.be/EYRmB1aNh9I?t=19s">الدكتور Chris Geoscience</a> و<a href="https://www.youtube.com/watch?v=Y9pYHDSxc7g">Clare Zhang</a> و<a href="https://www.youtube.com/watch?v=i_0DXxNeaQ0">Vi Hart</a> هذه.
وبشكلٍ أكثر تحديدًا بالنسبة إلى الحوسبة الكمّية، يُوصى بشدّة بفيديوهات <a href="https://www.youtube.com/watch?v=BM429cOogYc">أوميش فازيراني عن تحويل فورييه الكمّي</a> و<a href="https://www.youtube.com/watch?v=wUwZZaI5u0c">Kelsey Houston-Edwards عن خوارزمية شور</a>.</p>
<p>الفصل 10 في <a href="https://www.math.ias.edu/avi/book">كتاب أفي فيغدرسون</a> يعطي لمحةً عالية المستوى عن الحوسبة الكمّية.
وكذلك <a href="http://www.cs.umd.edu/~amchilds/qa/qa.pdf">ملاحظات محاضرات أندرو تشيلدز عن الخوارزميّات الكمّية</a>، وكذلك ملاحظات محاضرات <a href="https://inst.eecs.berkeley.edu/~cs191/">أوميش فازيراني</a> و<a href="http://www.theory.caltech.edu/people/preskill/ph229/">جون بريسكيل</a> و<a href="https://cs.uwaterloo.ca/~watrous/LectureNotes.html">جون ووتروس</a></p>
<p>وبالنسبة إلى الميكانيكا الكمّية على وجه العموم، فإنّ هذا <a href="https://www.youtube.com/watch?v=DfPeprQ7oGc">الفيديو</a> يوضّح تجربة الشقّين المزدوجين، وهذا <a href="https://www.youtube.com/watch?v=xM3GOXaci7w">فيديو مجلة Scientific American</a> عرضٌ جيّد لنظرية بِل.
و<a href="https://youtu.be/GdqC2bVLesQ?t=2m51s">هذه المحاضرة والندوة</a> التي أدارها براين غرين تناقش بعض المسائل الفلسفيّة والتقنيّة المحيطة بالميكانيكا الكمّية وبمسألة &quot;القياس&quot; المعروفة.
و<a href="http://www.feynmanlectures.caltech.edu/I_50.html">محاضرة فايمان عن تحويل فورييه</a> و<a href="http://www.feynmanlectures.caltech.edu/III_toc.html">الميكانيكا الكمّية على وجه العموم</a> تستحقّان القراءة كثيرًا.</p>
<p><a href="https://en.wikipedia.org/wiki/Fast_Fourier_transform">تحويل فورييه السريع</a>، المستعمل مكوّنًا في خوارزمية شور، هو إحدى أكثر الخوارزميات نفعًا عبر مجالات تطبيقاتٍ كثيرة.
وقصّة اكتشافه على يد غاوس أثناء محاولته حساب مدارات الكويكبات، ثمّ إعادة اكتشافه على يد توكي أثناء الحرب الباردة، مشوقةٌ أيضًا.</p>
<h2 id="استكشافات-إضافية">استكشافاتٌ إضافية</h2>
<p>بعض المواضيع المرتبطة بهذا الفصل التي قد تكون في متناول الطلبة المتقدّمين تشمل: (يُستكمل)</p>
<h2 id="شكر-وتقدير">شكر وتقدير</h2>
<p>نشكر سكوت آرونسون على تعليقاته الكثيرة المفيدة حول هذا الفصل.</p>
</div>`,m={book:$,chapter:n,chapterTitle:e,slug:t,title:a,headings:p,html:o};export{$ as book,n as chapter,e as chapterTitle,m as default,p as headings,o as html,t as slug,a as title};
