const s="kinney",t="figma",n="Figma للمطوّرين",e="styles-vs-variables",i="الأنماط مقابل المتغيّرات",a=[],l=`<p>إذا كنت تفكّر بينك وبين نفسك في احتمال وجود بعض التداخل بين المتغيّرات و<a href="https://stevekinney.com/courses/figma/styles">الأنماط</a> في Figma، فأنت بالتأكيد في صحبة جيدة.</p>
<ul>
<li>تتيح لك المتغيّرات تعريف مخرجات CSS في وضع المطوّر.</li>
<li>يمكن استخدام المتغيّرات — وخصوصًا متغيّرات الأرقام — لتعريف خصائص قابلة لإعادة الاستخدام مثل عروض الحدود.</li>
<li>تدعم المتغيّرات الأوضاع. أما الأنماط فلا.</li>
<li>لا يمكن للمتغيّرات تخزين سوى قيمة واحدة، بينما يمكن للأنماط تخزين مجموعات من القيم.</li>
<li>حتى وقت كتابة هذا النص، لا يمكنك تخزين أشياء مثل التدرّجات أو قيم الصور في المتغيّرات — بل عليك استخدام الأنماط. <strong>ملاحظة</strong>: دعم التدرّجات والصور <a href="https://help.figma.com/hc/en-us/articles/4406787442711-Figma-beta-features#Coming_soon">قادم قريبًا</a>.</li>
<li>حتى وقت كتابة هذا النص، لا يمكنك فعل الكثير بـ<a href="https://stevekinney.com/courses/figma/typography">الخطوط</a> فيما يتعلق بالمتغيّرات. ولهذا ستحتاج إلى استخدام الأنماط. كما أن <a href="https://help.figma.com/hc/en-us/articles/4406787442711-Figma-beta-features#Coming_soon">دعم الخطوط قادم قريبًا</a> أيضًا.</li>
<li>يمكن تحديد نطاق المتغيّرات. أما الأنماط فلا.</li>
</ul>
<p>أميل إلى تفضيل المتغيّرات على الأنماط، لكنني أعترف أنني أشكّ أحيانًا وأتساءل إن كانت الأنماط فكرة أفضل.</p>
<p><strong>يمكن بناء الأنماط فوق المتغيّرات، لكن لا يمكن بناء المتغيّرات فوق الأنماط.</strong> وفي أشياء مثل الألوان، يمكنك تركيب الأنماط من المتغيّرات. لذا، ليس بالضرورة أن يكون النهجان متعارضين.</p>
`,o={book:s,chapter:t,chapterTitle:n,slug:e,title:i,headings:a,html:l};export{s as book,t as chapter,n as chapterTitle,o as default,a as headings,l as html,e as slug,i as title};
