const n="mooc",t="part-14",p="الجزء 14: مشروع اللعبة",e="4-your-own-game",i="لعبتك الخاصة",o=[{depth:2,id:"تمرين-البرمجة-الأخير",text:"تمرين البرمجة الأخير"},{depth:3,id:"تقديم-اللعبة",text:"تقديم اللعبة"},{depth:2,id:"كيف-يقيم-الجزء-14",text:"كيف يُقيَّم الجزء 14"},{depth:2,id:"بعض-الأفكار-للألعاب",text:"بعض الأفكار للألعاب"},{depth:3,id:"لعبة-جمع",text:"لعبة جمع"},{depth:3,id:"مطر-من-العملات",text:"مطر من العملات"},{depth:2,id:"المراجعة-بين-الأقران",text:"المراجعة بين الأقران"},{depth:2,id:"استبيانات-الختام",text:"استبيانات الختام"}],l=`<h2 id="تمرين-البرمجة-الأخير">تمرين البرمجة الأخير</h2>
<p>تمرين البرمجة الأخير في هذه الدورة هو إنشاء لعبة صغيرة خاصة بك باستخدام pygame. يحتوي قالب التمرين على بعض الصور التي يمكنك استخدامها. لا تستخدم أي صور أخرى في لعبتك، وإلا فلن يتمكن الآخرون من اختبار لعبتك بالاعتماد على الشيفرة المصدرية وحدها.</p>
<p>موضوع اللعبة متروك لك، لكن من المفترض أن تكون أعقد بقدر ما هو عليه مثال Sokoban في هذا الجزء من المادة. يجب أن تحتوي اللعبة على الميزات التالية:</p>
<ul>
<li>تحتوي اللعبة على كائن متحرك (sprite) يستطيع اللاعب تحريكه بطريقة ما</li>
<li>تحتوي اللعبة على بعض العناصر القابلة للجمع و/أو أعداء</li>
<li>يجب أن تُكلَّف اللعبة اللاعب بمهمة واضحة</li>
<li>تحتوي اللعبة على عدّاد يخبر اللاعب كيف يؤدّي في اللعبة</li>
<li>شيفرة اللعبة المصدرية مقسّمة إلى دوال كما في مثال Sokoban</li>
</ul>
<p>عند الانتهاء من اللعبة، قدّمها للمراجعة بين الأقران باستخدام النموذج التالي. بعد ذلك، تعرّف على ألعاب اثنين من زملائك في الدورة، وأعطِ كل لعبة تقديرًا تراه مناسبًا، واكتب مراجعة قصيرة عنها. خذ بعين الاعتبار عند التقييم والمراجعة كلًا من مدى تشويق اللعبة وسهولة لعبها، ومدى سهولة قراءة شيفرة البرنامج.</p>
<h3 id="تقديم-اللعبة">تقديم اللعبة</h3>
<p>يجب أن تقدّم شيفرة لعبتك المصدرية عبر ميزة TMC Paste، وأن تدرج الرابط الذي تحصل عليه في النموذج أدناه.</p>
<p>وبينما تكون الحل مفتوحًا في المحرّر، اضغط زر قائمة TMC في Visual Studio Code (بجوار رمز العين). سيُفتح هذا قائمة يمكنك البحث فيها عن ميزة TMC Paste بكتابة <code>send</code>:</p>
<p><img src="/arabic-cs-library/images/mooc/part-14/tmc_paste_1.png" alt="tmc_paste_1.png"></p>
<p>اختر الخيار <code>Send Exercise to TMC Paste</code>، وستظهر إشعارة في الزاوية السفلية اليمنى من النافذة تخبرك بأن الشيفرة المصدرية قد أُرسلت إلى خادم TMC:</p>
<p><img src="/arabic-cs-library/images/mooc/part-14/tmc_paste_2.png" alt="tmc_paste_2.png"></p>
<p>يمكنك نسخ الرابط بالضغط على زر <code>Open URL</code> في الإشعارة. ستظهر نافذة منبثقة، ويجب أن تحتوي على خيار <code>Copy</code>:</p>
<p><img src="/arabic-cs-library/images/mooc/part-14/tmc_paste_3.png" alt="tmc_paste_3.png"></p>
<p>هذا هو الرابط الذي يجب أن تلصقه في النموذج أدناه.</p>
<h2 id="كيف-يقيم-الجزء-14">كيف يُقيَّم الجزء 14</h2>
<p>الهدف من هذا الجزء هو بناء لعبة صغيرة تعمل. وبما أن هذا الجزء يحتوي على مهمة واحدة فقط، <em>فأنت تحصل على نقاط مقابل الجهد</em>. قدّم لعبتك حتى إن لم تتمكن من جعلها تعمل تمامًا كما أردت.</p>
<p>إذا لم تعمل لعبتك بالشكل الذي قصدته، فيُرجى إدراج تعليقات في شيفرتك توضّح كيف <em>يُفترض</em> أن تعمل، أو أي ميزات تعتقد أنها ناقصة لكنك لم تتمكن من تنفيذها.</p>
<p>إذا كانت اللعبة التي تراجعها غير مكتملة أو لا تعمل على النحو الصحيح، فيُرجى إدراج تعليقات عمّا كان يمكن فعله لجعلها تعمل، إن كان ذلك ممكنًا.</p>
<h2 id="بعض-الأفكار-للألعاب">بعض الأفكار للألعاب</h2>
<p>الأمر متروك لك بالكامل في موضوع لعبتك، لكن إليك بعض الأفكار لمساعدتك على البدء. تذكّر المادة الموجودة في الجزء 13؛ فهي تحتوي على أمثلة يمكن أن تساعدك في تنفيذ أفكارك أيضًا.</p>
<h3 id="لعبة-جمع">لعبة جمع</h3>
<ul>
<li>يحرّك اللاعب الروبوت بمفاتيح الأسهم.</li>
<li>تظهر عملة معدنية في موضع عشوائي على الشاشة. وعندما يصل الروبوت إليها، تنتقل العملة إلى موضع جديد.</li>
<li>توجد أيضًا وحوش على الشاشة، ويجب أن يتجنّبها الروبوت.</li>
</ul>
<h3 id="مطر-من-العملات">مطر من العملات</h3>
<ul>
<li>يحرّك اللاعب الروبوت يمينًا ويسارًا أسفل الشاشة.</li>
<li>تتساقط العملات من السماء. ويجب أن يجمعها الروبوت.</li>
<li>وتسقط الوحوش أيضًا من السماء. ويجب أن يتجنّبها الروبوت.</li>
</ul>
<h2 id="المراجعة-بين-الأقران">المراجعة بين الأقران</h2>
<p>يجب أن تُقيّم اللعبة وفق المعايير التالية:</p>
<ul>
<li>كيف تبدو اللعبة؟</li>
<li>هل اللعبة <em>قابلة للعب</em>؟ هل هي مسلية اللعب وسهلة الاستخدام؟</li>
<li>هل فكرة اللعبة مثيرة للاهتمام؟</li>
<li>إلى أي مدى هي مبرمَجة جيدًا؟ هل الشيفرة سهلة القراءة، وهل تستخدم الأصناف والدوال استخدامًا مناسبًا؟</li>
</ul>
<p>المراجعة الجيدة تشير عادةً إلى كلٍّ من الميزات الجيدة وبعض الاقتراحات للتحسين.</p>
<blockquote>
<p><strong>اختبار:</strong> (مكون تفاعلي غير متاح في النسخة الثابتة - ID: 15597fec-593e-5f5e-a983-8a1d9af48fa7)</p>
</blockquote>
<h2 id="استبيانات-الختام">استبيانات الختام</h2>
<p>أولًا، يُرجى الإجابة على استبيان سريع حول هذا الجزء من الدورة.</p>
<blockquote>
<p><strong>اختبار:</strong> (مكون تفاعلي غير متاح في النسخة الثابتة - ID: 874e38cb-946e-53b2-b636-7b27ccd547e5)</p>
</blockquote>
<p>يُرجى أيضًا الإجابة على استبيان ملاحظات الدورة. وتساعدنا نتائج الاستبيان في تحسين الدورة.</p>
<blockquote>
<p><strong>اختبار:</strong> (مكوّن تفاعلي غير متاح في النسخة الثابتة - ID: e538510f-8aee-51fb-806b-5b2f15dfd084)</p>
</blockquote>
`,c={book:n,chapter:t,chapterTitle:p,slug:e,title:i,headings:o,html:l};export{n as book,t as chapter,p as chapterTitle,c as default,o as headings,l as html,e as slug,i as title};
