const t="ahastack",a="compare-spa",e="مقارنة مع تطبيق SPA",l="index",c="مقارنة مع تطبيق SPA",i=[],s=`<p>دعنا نقارن حزمة AHA بالمقاربة المعتادة لتطبيق الصفحة الواحدة (SPA)، مثل تطبيق مبنيّ باستخدام React مثلًا:</p>
<ul>
<li>الأمر أبسط في التفكير فيه، فهناك أمور أقلّ ينبغي أن تشغل بالك، فتستطيع التفكير في أمور مهمّة أخرى بدلًا من ذلك. مثلًا «كيف سيجد الناس تطبيقي» أو «دعني أضيف هذه الميزة بسرعة».</li>
<li>إنه أكثر وفاءً للمنصّة. فهو يستخدم Web كما قُصد أن تُستخدم.</li>
<li>إنه يمنحك مشكلات أداء أقلّ تعقيدًا، لأنك تستخدم Web كما قُصد أن تُستخدم.</li>
<li>إنه يتطلّب شيفرة JavaScript أقلّ. ارفع يدك إن كنت قد زرت يومًا موقعًا حيًّا كانت صفحته فارغة تمامًا وفيطر الأخطاء في DevTools مليء بالأخطاء، أو (وهو أسوأ) خطأ JavaScript مطبوع على الصفحة نفسها.</li>
<li>إنّه يتطلّب ارتباطًا أضعف بالتقنية. فإذا بنيت تطبيقًا بـ React، فأنت مطوّر React. تستخدم Svelte؟ فأنت مطوّر Svelte. أنت مربوط بذلك، ولن تعيد كتابة التطبيق بإطار أو مكتبة أخرى أبدًا لأنك ستضطر لإعادة كتابة كل شيء من الصفر. أمّا النهج الذي أستخدمه فيعتمد على تبعيات أصغر يمكنك استبدالها في أي وقت ببديل. بل يمكنك حتى كتابة نسختك الخاصة، لأن <a href="https://github.com/bigskysoftware/htmx/blob/master/src/htmx.js">htmx مجرّد ملف واحد</a>.</li>
<li>التحميل الأول أسرع بكثير لأنه لا يكاد يكون سوى بعض HTML مُعرَّض على الخادم، فأنت لا تحتاج أولًا إلى تحميل كمّ هائل من JavaScript ثم التهيئة ثم استدعاء بعض JSON الذي يُعرَّض بعد ذلك…</li>
</ul>
`,n={book:t,chapter:a,chapterTitle:e,slug:l,title:c,headings:i,html:s};export{t as book,a as chapter,e as chapterTitle,n as default,i as headings,s as html,l as slug,c as title};
