const t="nand2tetris-1",n="project03",d="المشروع 3: الذاكرة",e="index",r="المشروع 3: الذاكرة",p=[{depth:2,id:"المشروع-3-الذاكرة",text:"المشروع 3: الذاكرة"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"الهدف",text:"الهدف"},{depth:3,id:"الشرائح",text:"الشرائح"},{depth:3,id:"العقد",text:"العقد"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"نصائح",text:"نصائح"},{depth:3,id:"الأدوات",text:"الأدوات"}],h=`<h2 id="المشروع-3-الذاكرة">المشروع 3: الذاكرة</h2>
<h3 id="خلفية">خلفية</h3>
<p>الذاكرة الرئيسية للحاسوب، التي تُسمى أيضًا الذاكرة العشوائية أو RAM، هي متتالية قابلة للعنونة من مسجّلات بطول n بت، كل منها مصمم لحفظ قيمة بطول n بت. في هذا المشروع سوف تبني تدريجيًا وحدة RAM. ويتضمّن ذلك مسألتين رئيسيتين: (i) كيفية استخدام منطق البوابات لتخزين البتات بصورة مستمرة عبر الزمن، و(ii) كيفية استخدام منطق البوابات لعنونة (address) مسجّل الذاكرة الذي نريد العمل عليه.</p>
<h3 id="الهدف">الهدف</h3>
<p>ابنِ جميع الشرائح الموصوفة في الفصل 3 (انظر القائمة أدناه)، وصولاً إلى وحدة RAM. مكوّنات البناء الوحيدة التي يمكنك استخدامها هي بوابات DFF الأولية، والشرائح التي ستبنيها فوقها، والشرائح الموصوفة في الفصول السابقة.</p>
<h3 id="الشرائح">الشرائح</h3>
<table>
<thead>
<tr>
<th>اسم الشريحة</th>
<th>الوصف</th>
</tr>
</thead>
<tbody>
<tr>
<td>DFF</td>
<td>قلب ثنائي للبيانات (Flip-Flop) أولي</td>
</tr>
<tr>
<td>Bit</td>
<td>مسجّل بطول 1 بت</td>
</tr>
<tr>
<td>Register</td>
<td>مسجّل بطول 16 بت</td>
</tr>
<tr>
<td>RAM8</td>
<td>ذاكرة بطول 16 بت / 8 مسجّلات</td>
</tr>
<tr>
<td>RAM64</td>
<td>ذاكرة بطول 16 بت / 64 مسجّلًا</td>
</tr>
<tr>
<td>RAM512</td>
<td>ذاكرة بطول 16 بت / 512 مسجّلًا</td>
</tr>
<tr>
<td>RAM4K</td>
<td>ذاكرة بطول 16 بت / 4096 مسجّلًا</td>
</tr>
<tr>
<td>RAM16K</td>
<td>ذاكرة بطول 16 بت / 16384 مسجّلًا</td>
</tr>
<tr>
<td>PC</td>
<td>عدّاد برنامج بطول 16 بت</td>
</tr>
</tbody>
</table>
<table>
<thead>
<tr>
<th>سكربتات الاختبار</th>
<th>ملف المقارنة</th>
</tr>
</thead>
<tbody>
<tr>
<td>Bit.tst</td>
<td>Bit.cmp</td>
</tr>
<tr>
<td>Register.tst</td>
<td>Register.cmp</td>
</tr>
<tr>
<td>RAM8.tst</td>
<td>RAM8.cmp</td>
</tr>
<tr>
<td>RAM64.tst</td>
<td>RAM64.cmp</td>
</tr>
<tr>
<td>RAM512.tst</td>
<td>RAM512.cmp</td>
</tr>
<tr>
<td>RAM4K.tst</td>
<td>RAM4K.cmp</td>
</tr>
<tr>
<td>RAM16K.tst</td>
<td>RAM16K.cmp</td>
</tr>
<tr>
<td>PC.tst</td>
<td>PC.cmp</td>
</tr>
</tbody>
</table>
<h3 id="العقد">العقد</h3>
<p>عند تحميل تصميم شريحتك (برنامج .hdl المعدَّل) في محاكي العتاد (Hardware Simulator) المُرفق، واختباره باستخدام سكربت .tst المُرفق، يجب أن يُنتج المخرجات المدرجة في ملف .cmp المُرفق. وإذا لم يكن الأمر كذلك، فسوف يُبلغك المحاكي بذلك. ويجب استيفاء هذا الشرط لكل شريحة مدرجة أعلاه، باستثناء شريحة DFF التي تُعدّ أولية، وبالتالي لا حاجة إلى تنفيذها.</p>
<h3 id="الموارد">الموارد</h3>
<p>انظر <a href="https://www.nand2tetris.org/_files/ugd/44046b_1801b5682e4d4a67bd05e14235665d8b.pdf">الفصل 3</a>، و<a href="https://drive.google.com/file/d/1dPj4XNby9iuAs-47U9k3xtYy9hJ-ET0T/view?usp=sharing">دليل HDL</a>، و<a href="https://drive.google.com/file/d/1IsDnH0t7q_Im491LQ7_5_ajV0CokRbwR/view?usp=sharing">مجموعة رقائق Hack</a>.</p>
<p>لكل شريحة، نُزوّدك بملف .hdl هيكلي ينقصه جزء التنفيذ. وبالإضافة إلى ذلك، نُزوّدك لكل شريحة بسكربت .tst يوجّه محاكي العتاد إلى كيفية اختبارها، وبملف .cmp (ملف مقارنة) يحتوي على المخرجات الصحيحة التي يجب أن يُنتجها هذا الاختبار. ومهمتك هي إكمال واختبار ملفات .hdl الهيكلية المُزوَّدة.</p>
<p>والأدوات التي تحتاجها لهذا المشروع هي محاكي العتاد المُرفق والملفات المدرجة أعلاه. وإذا كنت قد حمّلت حزمة برامج Nand2Tetris Software Suite، فإن هذه الملفات مخزّنة في مجلد projects/03 لديك. وينقسم المجلد بدوره إلى مجلدين فرعيين، للأسباب الموضحة أدناه.</p>
<h3 id="نصائح">نصائح</h3>
<p>تُعدّ بوابة DFF بوابة أولية، وبالتالي لا حاجة إلى بنائها: فعندما يصادف المحاكي جزءًا من شريحة DFF في برنامج HDL، فإنه يستدعي تلقائيًا التنفيذ المدمج nand2tetris/tools/builtInChips/DFF.hdl.</p>
<p>الشرائح المدمجة: عند بناء شرائح RAM من أجزاء شريحة RAM من مستوى أدنى، نوصي باستخدام الإصدارات المدمجة من تلك الأجزاء. وإلا، فسوف يُنتج المحاكي بصورة تعاقبية عددًا كبيرًا من كائنات البرمجيات المقيمة في الذاكرة، واحدة لكل جزء من الأجزاء العديدة التي تُشكّل وحدة RAM نموذجية. وقد يجعل ذلك المحاكي يعمل ببطء، أو، ما هو أسوأ، أن ينفد من الذاكرة. أي أن ينفد من ذاكرة الحاسوب الذي يعمل عليه المحاكي.</p>
<p>ولتفادي هذه المشكلة، قمنا بتقسيم شرائح RAM التي عليك بناؤها في هذا المشروع إلى مجلدين فرعيين، هما projects/03/a و projects/03/b. وهذا التقسيم سطحي، وتم لغرض واحد فقط: فعند بناء الشرائح المخزّنة في b، يُجبر المحاكي على استخدام التنفيذات المدمجة لأجزاء الشريحة من المستوى الأدنى التي تُخزَّن برامج .hdl الخاصة بها في a ولكن ليس في b.</p>
<h3 id="الأدوات">الأدوات</h3>
<p>يمكن تنفيذ واختبار جميع الشرائح المذكورة في المشاريع 0-5 باستخدام محاكي العتاد المُرفق. وفيما يلي لقطة شاشة لاختبار تنفيذ مدمج لشريحة RAM8.hdl على محاكي العتاد:</p>
<p><img src="/arabic-cs-library/images/nand2tetris-1/project03-44046b_cbed6bd78b6b4a4ea21377cdd.webp" alt=""></p>
`,i={book:t,chapter:n,chapterTitle:d,slug:e,title:r,headings:p,html:h};export{t as book,n as chapter,d as chapterTitle,i as default,p as headings,h as html,e as slug,r as title};
