const t="nand2tetris-1",n="project01",d="المشروع 1: المنطق البولياني",r="index",e="المشروع 1: المنطق البولياني",a=[{depth:2,id:"المشروع-1-المنطق-البولياني",text:"المشروع 1: المنطق البولياني"},{depth:3,id:"خلفية",text:"خلفية"},{depth:3,id:"الهدف",text:"الهدف"},{depth:3,id:"الشرائح",text:"الشرائح"},{depth:3,id:"العقد",text:"العقد"},{depth:3,id:"الموارد",text:"الموارد"},{depth:3,id:"نصائح",text:"نصائح"},{depth:3,id:"الأدوات",text:"الأدوات"}],p=`<h2 id="المشروع-1-المنطق-البولياني">المشروع 1: المنطق البولياني</h2>
<h3 id="خلفية">خلفية</h3>
<p>تستند معمارية الحاسوب النمطية إلى مجموعة من البوابات المنطقية الأولية مثل And وOr وMux وغيرها، إضافةً إلى إصداراتها على مستوى البتّ مثل And16 وOr16 وMux16 وغيرها (بافتراض آلة بـ 16 بت). يَعهد إليك هذا المشروع ببناء مجموعة نموذجية من بوابات المنطق الأساسية. تشكّل هذه البوابات لبنات البناء الأولية التي سنبني منها لاحقًا وحدة المعالجة المركزية CPU وذاكرة الوصول العشوائية RAM للحاسوب.</p>
<h3 id="الهدف">الهدف</h3>
<p>ابنِ جميع بوابات المنطق الموصوفة في الفصل 1 (انظر القائمة أدناه)، للحصول على مجموعة شرائح أساسية. لبنات البناء الوحيدة التي يمكنك استخدامها في هذا المشروع هي بوابات Nand الأولية والبوابات المركّبة التي ستبنيها تدريجيًا فوقها.</p>
<h3 id="الشرائح">الشرائح</h3>
<table>
<thead>
<tr>
<th>اسم الشريحة</th>
<th>الوصف</th>
</tr>
</thead>
<tbody>
<tr>
<td>Nand</td>
<td>بوابة Nand (أولية)</td>
</tr>
<tr>
<td>Not</td>
<td>بوابة Not</td>
</tr>
<tr>
<td>And</td>
<td>بوابة And</td>
</tr>
<tr>
<td>Or</td>
<td>بوابة Or</td>
</tr>
<tr>
<td>Xor</td>
<td>بوابة Xor</td>
</tr>
<tr>
<td>Mux</td>
<td>بوابة Mux</td>
</tr>
<tr>
<td>DMux</td>
<td>بوابة DMux</td>
</tr>
<tr>
<td>Not16</td>
<td>نفي بـ 16 بت</td>
</tr>
<tr>
<td>And16</td>
<td>عملية And بـ 16 بت</td>
</tr>
<tr>
<td>Or16</td>
<td>عملية Or بـ 16 بت</td>
</tr>
<tr>
<td>Mux16</td>
<td>مُزاوِد (multiplexor) بـ 16 بت</td>
</tr>
<tr>
<td>Or8Way</td>
<td>Or(in0,in1,...,in7)</td>
</tr>
<tr>
<td>Mux4Way16</td>
<td>مُزاوِد بـ 16 بت و4 مسارات</td>
</tr>
<tr>
<td>Mux8Way16</td>
<td>مُزاوِد بـ 16 بت و8 مسارات</td>
</tr>
<tr>
<td>DMux4Way</td>
<td>مُزاوِد عكسي (demultiplexor) بـ 4 مسارات</td>
</tr>
<tr>
<td>DMux8Way</td>
<td>مُزاوِد عكسي (demultiplexor) بـ 8 مسارات</td>
</tr>
</tbody>
</table>
<table>
<thead>
<tr>
<th>سكربتات الاختبار</th>
<th>ملف المقارنة</th>
</tr>
</thead>
<tbody>
<tr>
<td>Not.tst</td>
<td>Not16.cmp</td>
</tr>
<tr>
<td>And.tst</td>
<td>And.cmp</td>
</tr>
<tr>
<td>Or.tst</td>
<td>Or.cmp</td>
</tr>
<tr>
<td>Xor.tst</td>
<td>Xor.cmp</td>
</tr>
<tr>
<td>Mux.tst</td>
<td>Mux.cmp</td>
</tr>
<tr>
<td>DMux.tst</td>
<td>DMux.cmp</td>
</tr>
<tr>
<td>Not16.tst</td>
<td>Not16.cmp</td>
</tr>
<tr>
<td>And16.tst</td>
<td>And.cmp</td>
</tr>
<tr>
<td>Or16.tst</td>
<td>Or.cmp</td>
</tr>
<tr>
<td>Mux16.tst</td>
<td>Mux.cmp</td>
</tr>
<tr>
<td>Or8Way.tst</td>
<td>Or.cmp</td>
</tr>
<tr>
<td>Mux4Way16.tst</td>
<td>Mux.cmp</td>
</tr>
<tr>
<td>Mux8Way16.tst</td>
<td>Mux.cmp</td>
</tr>
<tr>
<td>DMux4Way.tst</td>
<td>DMux.cmp</td>
</tr>
<tr>
<td>DMux8Way.tst</td>
<td>DMux.cmp</td>
</tr>
</tbody>
</table>
<h3 id="العقد">العقد</h3>
<p>عند تحميل تصميم شريحتك (برنامج .hdl معدَّل) في محاكي العتاد (Hardware Simulator) المُرفق، واختباره باستخدام سكربت .tst المُرفق، يجب أن يُنتج المخرجات المدرَجة في ملف .cmp المُرفق. إذا لم يكن الأمر كذلك، فسأُبلغك المحاكي بذلك. يجب استيفاء هذا الشرط لكل شريحة مذكورة أعلاه، باستثناء شريحة Nand التي تُعتبر أولية، وبالتالي لا حاجة إلى تنفيذها.</p>
<h3 id="الموارد">الموارد</h3>
<p>انظر <a href="https://www.nand2tetris.org/_files/ugd/44046b_f2c9e41f0b204a34ab78be0ae4953128.pdf">الفصل 1</a> (من الإصدار الأول للكتاب)، و<a href="https://drive.google.com/file/d/1dPj4XNby9iuAs-47U9k3xtYy9hJ-ET0T/view?usp=sharing">دليل HDL</a> (باستثناء A2.4)، و<a href="https://drive.google.com/file/d/1IsDnH0t7q_Im491LQ7_5_ajV0CokRbwR/view?usp=sharing">مجموعة شرائح Hack</a>.</p>
<p>نوفّر لكل شريحة ملف .hdl هيكلي فيه موضع مخصّص لجزء التنفيذ المفقود. وبالإضافة إلى ذلك، نوفّر لكل شريحة سكربت .tst يوجّه محاكي العتاد إلى كيفية اختبارها، وملف .cmp (ملف مقارنة) يحتوي على المخرجات الصحيحة التي يجب أن يُنتجها هذا الاختبار. مهمتك هي إكمال ملفات .hdl الهيكلية المُرفقة واختبارها.</p>
<p>إذا كنت قد نزّلت حزمة برامج Nand2Tetris Software Suite (من قسم البرامج في هذا الموقع)، فستجد محاكي العتاد المُرفق وجميع ملفات المشروع الضرورية في مجلد nand2tetris/tools وفي مجلد nand2tetris/projects/01 على الترتيب، على حاسوبك. للتعرف على محاكي العتاد، انظر درس محاكي العتاد (<a href="https://www.nand2tetris.org/_files/ugd/56440f_115a10b28c1e49e786390a9a0b6ddcee.ppsx?dn=Hardware%20Simulator%20Tutorial.ppsx">PPT</a>، <a href="https://www.nand2tetris.org/_files/ugd/44046b_02055f8bb5ac47648c0ab642f01c1919.pdf">PDF</a>).</p>
<h3 id="نصائح">نصائح</h3>
<p>المتطلّب المسبق: إذا لم تكن قد فعلت ذلك بعد، فنزّل حزمة برامج Nand2Tetris Software Suite من قسم البرامج في هذا الموقع إلى حاسوبك. اقرأ الفصل 1 والملحق 2 (دون تضمين القسم A2.4)، واختبر الأجزاء I-II-III من درس محاكي العتاد، قبل البدء في العمل على هذا المشروع.</p>
<p>الرقائق المدمجة: تُعتبر بوابة Nand أولية، وبالتالي لا حاجة إلى تنفيذها: فكلما صادف المحاكي جزء شريحة Nand في شيفرة HDL لديك، فإنه يستدعي تلقائيًا التنفيذ المدمج tools/builtInChips/Nand.hdl. نوصي بتنفيذ جميع البوابات الأخرى في هذا المشروع بالترتيب الذي تظهر به في الفصل 1. لكن لاحظ أن محاكي العتاد المُرفق يتضمّن تنفيذات مدمجة لكل هذه الرقائق. لذلك يمكنك استخدام أيّ منها قبل تنفيذه: سيستدعي المحاكي تلقائيًا إصداراتها المدمجة.</p>
<p>على سبيل المثال، انظر في برنامج Mux.hdl الهيكلي المُرفق. لنفترض أنه لأي سبب لم تُكمل تنفيذ شريحة Mux، لكنك لا تزال ترغب في استخدامها كأجزاء داخلية في تصاميم رقائق أخرى. يمكنك فعل ذلك بسهولة، بفضل العرف التالي. إذا فشل المحاكي في العثور على ملف Mux.hdl في المجلد الحالي، فإنه يستدعي تلقائيًا التنفيذ المدمج لها، وهو جزء من بيئة المحاكي المُرفق. ويتمتّع هذا التنفيذ المدمج بالواجهة والوظيفة نفسها الخاصة برقاقة Mux الموصوفة في الكتاب. وبالتالي، إذا أردت أن يتجاهل المحاكي تنفيذًا أو أكثر من تنفيذات رقائقك، فأعِد تسمية ملف chiPname.hdl المقابل، أو أزِله من مجلد المشروع. وعندما تكون مستعدًا لتطويرها بلغة HDL، أعد ملف chipName.hdl إلى المجلد، وتابع تعديله بشيفرة HDL.</p>
<h3 id="الأدوات">الأدوات</h3>
<p>يمكن تنفيذ جميع الشرائح المذكورة في المشاريع 1-5 واختبارها باستخدام محاكي العتاد المُرفق. وفيما يلي لقطة شاشة لاختبار تنفيذ شريحة Xor.hdl على محاكي العتاد:</p>
<p><img src="/arabic-cs-library/images/nand2tetris-1/project01-44046b_d2d64ef4f50948e7ae0f5d9cd.webp" alt=""></p>
`,h={book:t,chapter:n,chapterTitle:d,slug:r,title:e,headings:a,html:p};export{t as book,n as chapter,d as chapterTitle,h as default,a as headings,p as html,r as slug,e as title};
