const n="learn-ocaml",t="preface",e="مقدمة",a="index",o="مقدمة",d=[{depth:2,id:"مقدمة",text:"مقدمة"},{depth:2,id:"مقدمة-1",text:"مقدمة"},{depth:3,id:"من-يجب-أن-يقرأ-هذا-الكتاب",text:"من يجب أن يقرأ هذا الكتاب"},{depth:3,id:"الموقع-المرافق-للكتاب",text:"الموقع المرافق للكتاب"},{depth:3,id:"شكر-وتقدير",text:"شكر وتقدير"}],p=`<h2 id="مقدمة">مقدمة</h2>
<h2 id="مقدمة-1">مقدمة</h2>
<p>التعلم لبرمجة حاسوب أمرٌ صعب. والبرمجةُ الجيدة تتطلب معرفةً بالخوارزميات،
والخيال، والبصيرة، وإتقان لغة برمجة. والشيءُ الأهم من ذلك كله، هي تتطلب خبرة،
لأن الصعوبات كثيراً ما تختبئ في التفاصيل. يقدم هذا الكتاب توليفةً مبنيةً على
خبرتنا الخاصة، بوصفنا مبرمجين ومدرّسي برمجة.</p>
<p>من المهم تذكُّر أن الأسلوب جوهريٌّ في البرمجة. فخوارزميةٌ واحدة يمكن كتابتها
في لغةٍ معينة بطرقٍ متعددة؛ وما جازَ منها أن يكون أنيقاً وفعالاً في الوقت نفسه،
هو ما يجب أن يسعى المبرمجُ إلى تحقيقه، فوق كل شيء. ولذا اخترنا استخدام لغة برمجة
ملموسة، OCaml، بدلاً من شبه شيفرة (pseudocode).</p>
<p>ينقسم الكتاب إلى ثلاثة أجزاء. الجزء I هو مقدمةٌ إلى لغة OCaml. وهو موجَّهٌ
إلى المبتدئين، بما يشمل مبرمجي المبتدئين والمبرمجين الأكثر خبرةً الذين لا
يعرفون OCaml. وستمكّن برامج صغيرة متعددة القارئ من اكتشاف المفاهيم
الأساسية للبرمجة ولغة OCaml. أما الجزءان II و III فيركّزان على مفاهيم
خوارزمية أساسية، بهدف تمكين القرّاء من كتابة برامجهم الخاصة بطريقة فعّالة
ومنظّمة.</p>
<p>تُعرض المفاهيم الخوارزمية مباشرةً في صياغة OCaml، ويمكن إعادة استخدام جميع
البرامج في هذا الكتاب بسهولة.</p>
<h3 id="من-يجب-أن-يقرأ-هذا-الكتاب">من يجب أن يقرأ هذا الكتاب</h3>
<p>الكتابُ موجَّهٌ إلى المدرّسين والطلاب والمبرمجين الذين يسعون إلى اكتشاف
لغة OCaml واستخدامها بفعالية. للمدرّسين والطلاب، قد يُستخدم الكتاب ككتاب
دراسي في دورات عن الخوارزميات أو البرمجة الوظيفية. وهو يحتوي على العديد من
أمثلة الشفرة والتمارين. ولمبرمجي OCaml، قد يُستخدم كنص مرجعي في دراسة بُنى بيانات
أو خوارزميات محددة.</p>
<h3 id="الموقع-المرافق-للكتاب">الموقع المرافق للكتاب</h3>
<p>تم تجميع جميع برامج هذا الكتاب واختبارها مع إصدار OCaml 4.14.0. والبرامج
متاحة على العنوان:</p>
<p><code>http://programmer-avec-ocaml.lri.fr/</code></p>
<h3 id="شكر-وتقدير">شكر وتقدير</h3>
<p>نودّ أن نشكر François Pottier على مناقشاته حول إعداد هذا الكتاب. ونحن ممتنون
لزملائنا Arthur Charguéraud و Frédéric Voisin على مراجعتهما الدقيقة والبناءة
للنص. ونودّ أيضاً أن نشكر كل من قرأ الكتاب وعلّق عليه: Thomas Braibant،
Martin Clochard، David Declerck، Léon Gondelman، Louis Mandel، Simão Melo de
Sousa، Mattias Roux. أخيراً، نشكر فريق Eyrolles التحريري على مساعدته القيّمة
في تجميع الكتاب.
&quot;</p>
`,i={book:n,chapter:t,chapterTitle:e,slug:a,title:o,headings:d,html:p};export{n as book,t as chapter,e as chapterTitle,i as default,d as headings,p as html,a as slug,o as title};
