const a="ahastack",t="compare-web-1",e="مقارنة مع تطبيق Web 1.0",n="index",l="مقارنة مع تطبيق Web 1.0",c=[],i=`<p>دعنا نقارن حزمة AHA بالمقاربة التقليدية للـ HTML المُعرَّض على الخادم، فكّر مثلًا في تطبيق مبنيّ باستخدام Django أو Rails أو Laravel، لا يستخدم أي شيفرة JavaScript في جهة العميل لإضافة التفاعلية:</p>
<ul>
<li>باستخدام حزمة AHA يمكنك تقديم تطبيق تفاعلي أكثر بكثير. ف تطبيقات «Web 1.0» التقليدية ثقيلة الطابع نوعًا ما في الاستخدام بسبب إعادة تحميل الصفحة الكاملة، وتشعر بأنها قديمة. كل طلب يستبدل الشاشة. ويحدث وميض أثناء التنقّل. وتفقد موضع التمرير. ولا تبدو حديثة.</li>
<li>التفاعلية في جهة العميل هي تفاعلية تصريحية (declarative) بفضل Alpine.js. ستحتاج إلى كتابة بعض شيفرة JavaScript في جهة العميل، لكن ليس كثيرًا منها، إذ إن معظم الحاجات والأنماط في جهة العميل تُحلّ بسهولة باستخدام Alpine.</li>
<li>عند حدوث تفاعل بين جهة العميل والخادم، تُعرَض أجزاء HTML جزئية (HTML partials) مباشرةً داخل الصفحة، دون التنقّل بعيدًا عنها إن لم تكن بحاجة إلى ذلك، على عكس عرض صفحة HTML جديدة بالكامل وإجراء تحديثات كاملة للصفحة. وهذا يبدو تفاعليًا أكثر بكثير ويمنح الصفحة حياةً بطريقة مستحيلة مع المقاربة القديمة للـ HTML المُعرَّض على الخادم.</li>
</ul>
`,s={book:a,chapter:t,chapterTitle:e,slug:n,title:l,headings:c,html:i};export{a as book,t as chapter,e as chapterTitle,s as default,c as headings,i as html,n as slug,l as title};
