const n="mooc",o="auxiliary",i="صفحات مساعدة",c="support-and-assistance",s="الدعم والمساعدة",t=[{depth:3,id:"الإرشاد-خلال-فصل-الخريف",text:"الإرشاد خلال فصل الخريف"}],d=`<h3 id="الإرشاد-خلال-فصل-الخريف">الإرشاد خلال فصل الخريف</h3>
<p><strong>سيتم تحديث جدول الإرشاد في مطلع شهر سبتمبر، مع توفّر مواعيد إرشاد أكثر</strong></p>
<p>ستوفّر دورة عام 2026 الإرشاد في حرم كومبولا وعلى Discord معًا. وتُعقد الحصص في الحرم الجامعي في القاعة Exactum BK107. وتُعقد حصص الإرشاد في الأوقات التالية (تم التحديث في 3 سبتمبر):</p>
<ul>
<li>أيام الاثنين من الساعة 16:00 إلى 19:00</li>
<li>أيام الثلاثاء من الساعة 13:00 إلى 16:00</li>
<li>أيام الخميس من الساعة 16:00 إلى 19:00</li>
<li>أيام الجمعة من الساعة 13:00 إلى 16:00</li>
</ul>
<!-- على الحرم الجامعي في قاعة Exactum BK107 أيام الأربعاء من الساعة 12–16، وكذلك أيام الجمعة من الساعة 12–16.

| الوقت / التاريخ | الاثنين | الثلاثاء | الأربعاء | الخميس | الجمعة |
|-----|----|----|----|----|----|
| 10-11 | - | X | - | - | X |
| 11-12 | - | X | - | - | X |
| 12-13 | - | - | - | X | - |
| 13-14 | - | - | - | X | - |
| 14-15 | - | - | - | - | - |
| 15-16 | - | - | X | - | - |
| 16-17 | - | X | X | - | - |
| 17-18 | - | X | - | - | - |-->
<p>أثناء الحصص في الحرم الجامعي، قد تتوفّر المساعدة أيضًا على Discord إذا كان لدى المساعدين وقت لمتابعة خادم Discord الخاص بالدورة. وبطبيعة الحال، ما زال بإمكانك طلب المساعدة على Discord متى احتجت إلى ذلك.</p>
<p><em>الجدول قابل للتغيير.</em></p>
<h4>Discord</h4>
<p>Discord هي منصّة تواصل تتيح المحادثات النصية ومحادثات الصوت/الفيديو معًا. ويمكنك معرفة المزيد عن هذه المنصّة <a href="https://discord.com/">في موقع Discord</a>.</p>
<p>تتوفّر قنوات الدورة عبر <a href="https://study.cs.helsinki.fi/discord/join/ohjelmoinnin_mooc">هذا الرابط</a>. واطّلع خصوصًا على قناتَي <code>ohjelmoinnin_mooc_english</code> و <code>ohjelmoinnin_mooc_voice</code> للحصول على الدعم باللغة الإنجليزية.</p>
<p>سيكون المدرّس على أتمّ الاستعداد في قنوات الدورة على Discord في أوقات الإرشاد. كما سيردّ المدرّس على الأسئلة المُرسَلة عبر الرسائل الخاصة. ويتيح Discord أيضًا نقاشًا حول الدورة خارج أوقات الإرشاد، لذا فإن الانضمام إليه يستحق ذلك!</p>
`,e={book:n,chapter:o,chapterTitle:i,slug:c,title:s,headings:t,html:d};export{n as book,o as chapter,i as chapterTitle,e as default,t as headings,d as html,c as slug,s as title};
